[
    {
        "text": "1882"
    },
    {
        "text": "R. P. ROBERTUS W. BRADY PRAEPOSITUS PROVINCIALIS A Die 8 Maii, 1877. College of St. Francis Xavier, 49 W. 15th St., New York City. P. JACOBUS A. WARD Socius Adm. Cons. Prov. CONSULTORES PROVINCIAE P. SOCIUS R. P. PROVINCIALIS a die 21 Nov. 1877 P. RECTOR COLL. S. JOANNIS Fordham 6 1879 P. RECTOR COLL. SS. CORD. Woodstock P. RECTOR COLL. S. FRAN. XAV. . 28 Oct. 1880"
    },
    {
        "text": "CATALOGUS PROVINCIAE MARYLANDIAE NEO EBORACENSIS IN STATU NEO EBORACENSI COLLEGIUM NEO EBORACENSE et Residentia ad S. Francisci Xaverii COLLEGE OF ST. FRANCIS XAVIER, 49 W. 15th STREET, NEW YORK CITY. P. Samuel Frisbee Rect. a die 28 Augusti, 1880 Proc Cons. prov. P. Nilus N. McKinnon Min Lect. ethic Praef. eccl. et val Conc. in T. Praes. S. Sitis et Consol. Mariae Cat. et conf. puell. in Acad. SS. Cordis Cons. dom. P. Augustinus Regnier Oper. in xenod. et carcere in insula Blackwell P. Augustus Thebaud Oper Conf. NN. et in T. Scriptor Cons. dom. an. 4. P. Carolus H. Denny Oper Conc. et conf. in T. Praes. sod. filiar. M. et archi. sod. SS. Cordis P. Carolus O'Connor Oper. Conf. in T. et alumn. Praes. conf. bon. mort. doc. cat. persev Cur. ger. schol. par. et domin Praef. bibl."
    },
    {
        "text": "P. Franciscus Michel Oper. in xenod. et carc. in ins. Hart. Adj. in aliis ins Conf. in T. P. Gulielmus Pardow Praef. stud. inf. et disc., et lect. ad mens. conc. in T. Submin Cons. dom. P. Henricus Duranquet Cur. ger. miss. insul Oper. in carc. et xenod. P. Isidorus Daubresse Oper Conf. NN. et alumn. et in T. Praes. coll. cas. consc. pro. NN. et sac. saec. P. Joannes Holzer Oper. in xenod. P. Joannes B. Jungck Adj. praef. in curs. com. Dir. music. Doc. ling. german. P. Josephus Prachensky Oper. in xenod. et carc. ins. Ward. P. Josephus Shea Lect. log, metaph. et evid. relig. Conf. NN. et in T. Conc. Praes. coll. cas. consc. pro. sac. saec. P. Josephus Vetter Oper. in xenod. et carcere in insula Blackwell P. Mauritius Ronayne Adm. Praef. spir., conf. NN. et in T. Lect. hist. Explic. catech. FF. P. Patritius F. Dealy Cur. ger. paroch Praes. sod. vet. alumn Mod. Union. Cathol. et Xav. Soc Praes. sod. SS. Rosarii Conf. et conc. in T. Cons. dom. an. 2 P. Patritius McQuaid Oper Conf. sen. in dom. S. Joseph. et in T. Conf. alumn. P. Raphael Gelinas Oper. in ins. Randall et Ward P. Theodorus Thiry Oper Praes. sod. viror. et mut. auxil. pro viris Mod. acad. et sod. jun. opif. Soc. S. Inf. Conf. NN. et in T. et alumn. MAGISTRI P. Hieronymus Daugherty Doc. rhet. an. 6 mag. Mod. acad. phil. et rhet. Doc. evid. relig. Mod. 1 sod. alumn. Exhort. et conf. alumn. et in T. Mag. caerem."
    },
    {
        "text": "Raphael O'Connell Doc. hum. an. 3 mag. et ling. gall Coll. pp. pro. litt. ann Script. hist. dom Exp. pp. med. FF. Gulielmus F. Gregory Doc. supr. gram. an. 4 mag. et 1 arith. Bidellus P. Dionysius A. Kelley Doc. med. gram. an. 12. mag. et 2 arith. Mod. 2 sod. alumn Exhort. alumn. Conf. in T. Patritius J. McGinney Doc. inf. gram. 1 cl. an 2 mag. et 3 arith. P. Hugo Langlois Doc. special. curs. lat. an. 12 mag. Conf. in T. Daniel McGoldrick Lect. chym. et scient. natur. Gulielmus Walsh Adj. praef. et direct. music. Doc. ling. gall Praef. min. ad altare Supp. pro mag. Joannes Whitney Lect. math. subl. et dir. tot. curs. math. Praef. bibl. alumn. Fabianus S. Noel Doc. class. noct. et doct. Christianam Adj. praef. etc Stud. priv. Et octo DD. auxiliares COADJUTORES Aemilius Risler Doc. delin. et calig. Vis. exam. vesp. Ad dom. Conradus Meyer Cust. vest. Adj. infirm. Franciscus McCloskey Praes. famul. Cur. forn Ad dom. Gulielmus Rache Pictor Ad dom. Joannes Dowdle Adj. proc Praef. quaest Aedit. sac. dom. Vis. orat Ad dom. Joannes Flood Infirm Ad dom. Joannes Welsh Adj. praes. famul. Caement. Ad dom. Josephus Koerner Adj. proc. Ad dom. Matthaeus O'Connor Aedit. Ad dom."
    },
    {
        "text": "Michael Rogers Arcul. Ad dom. Nicolaus Litique Sartor Ad dom. Senanus Mangan Empt. Disp. Manud. Thomas Gormley Fab. plumb Excit Vis. exam. merid. Ad dom. Thomas McShane Cust. tricl. Timotheus McNamara Ad dom. PP. 23. Schol. 7. Coadj. 15. Univ. 45. COLLEGIUM FORDHAMENSE AD S. JOANNIS Convictus et Residentia ST. JOHN'S COLLEGE, FORDHAM, NEW YORK. P. Frid. Gulielmus Gockeln Rector a die 25 Junii, 1874 P. Henricus Kavanagh Min Praef. eccles. et val. NN. Cur. ger. eccl. paroch. Conf. alumn. Cons. dom. an. 2 P. Ludovicus Jouin Adm Lect. ethic. Praef. bibl. Conf. NN. et alumn. Praes. coll. cas. consc. P. Michael P. Costin Praef. spir. et conf. NN. et alumn. Lect. math. subl Catech. et conf. surd. et mut. Neo Eborac. P. Nicolaus Hanrahan Proc. Conf. NN. et filiar. S. Cord. Mariae Adj. in eccl. paroch. Cons. dom. an. 7 P. Patritius A. Halpin Praef. stud., discip. et val. alumn. Exhort. alumn Submin Cons. dom. an. 2 P. Thomas J. A. Freeman Lect. scient. nat. et evid. relig. Exhort. et conf. alumn. Cons. dom. an. 1 P. Timotheus O'Leary Lect. log. et metaph Supp. lect. ethic. Mod. acad. phil. et rhet. et 2 sod."
    },
    {
        "text": "MAGISTRI P. Patritius O'Reilly Doc. rhet. an. 7 mag. Exhort. et conf. alumn. Conf. NN Mod. 3 sod Expl. catech. FF. P. Jacobus B. Becker Doc. hum. an. 6 mag. Mod. 1 sod. Exhort. et conf. alumn Praef. lect. ad mens. Michael H. O'Brien Doc. sup. gram. an. 4 mag. Doc. ling. gall. Coll. pp. pro litt. ann Adj. praef. alumn. Josephus Zwinge Doc. med. gram. et ling. germ. an. 3 mag. Adj. praef. alumn. Georgius Lucas Doc. inf. gram. 1 cl. an. 4 mag Adj. Praef. alumn. Jeremias F. X. Coleman Doc. inf. gram. 2 cl. an. 1 mag. Praef. minist. ad altare Adj. praef. alumn. P. Ignatius Renaud Doc. spec. lat. schol. an. 13 mag. Conf. NN. et puell. acad. Ursul Script. hist. dom. Joannes C. Keveney Doc. hum. in curs. comm. et algebr. et ling. gall Leg. com. et comp. lib Adj. praef. Georgius Fargis Doc. geom Lect. hist. phil. et rhet. Mod. soc. hist. et soc. dram Praef. musicae Adj. praef. alumn. PRAEFECTI Carolus C. Jones Doc. in curs. comm. Daniel M. McElhinney Doc. arith. Supp. mag. Georgius E. Quin Stud. philos. Gulielmus J. Richley Doc. in curs. comm. Joannes A. Chester Doc. in curs. comm. Et praeterea DD. auxiliares 5 COADJUTORES Antonius Dooher Pistor Dionysius Considine Adj. praef. alumn. Ad dom. Dionysius Hogan Arcul. 2 Visit. orat. Ad dom. Fridericus de Pooter Hortul. botan Ad dom."
    },
    {
        "text": "Fridolinus Haefele Arcul. 1 Ad dom. Gulielmus Hennen Cur. val. Jacobus Early Coq. Praes. hort. Jacobus Egan Adj. Coq. Jacobus Mallen Cust. tric. Joannes Sheerin Aedit. Sartor Vis. exam. merid. Josephus Bradley Aedit. in eccl. Praef. quaest. Josephus Byrne Adj. cust. tricl. Ad omnia Julius Mace Doc. music. Excit. Ad dom. Leo Kutter Cust. vest. NN. Adj. cust. vest. alumn. et disp. Vis. noct. Ludovicus Kaiser Cust. vest. alumn. Adj. cust. vest. NN. Matthaeus Gilshannen Disp. Visit. exam. vesp. Mauritius Roach Infirm. Nicolaus Paradise Sutor Empt. Patritius Corrigan Caement. Ad omnia Patritius Muldoon Villicus Patritius Smith Cur. forn. Ad dom. Thomas Hallahan Pictor Praes. famul. Adj. infirm Ad omn. PP. 11. Schol. 11. Coadj. 22. Univ. 44."
    },
    {
        "text": "RESIDENTIA AD S. LAURENTII NEO EBORACENSIS ST. LAURENCE'S CHURCH, EAST 84th STREET, NEW YORK. P. David A. Merrick Superior a die 21 Junii, 1881 Cur. ger. paroch Oper Moder. sod. puell. P. Carolus Petitdemange Oper. Conf. parvul. in dom. sor. de Mercede Cons. dom. P. David Walker Oper Praes. conf. bon. mort., sod puer. et Soc. Tem Cur. ger. schol. paroch Cons. dom. an. 3 P. Gulielmus Moylan Oper Praef. spir. et bibl. Praes. coll. cas. consc. Praes. sod. matron., SS. Cordis et Ros Catech. puer. et puell. COADJUTORES Carolus Brendle Vis. orat. et exam. Excit. Ad dom. Joel Miville Aedit. Cust. vest. Ad dom. Michael Kays Jan. Ad dom. Patritius Farrell Coq. Emptor Disp. Ad omnia PP. 4. Coadj. 4. Univ. 8. RESIDENTIA AD S. JOSEPHI NEO EBORACENSIS ST. JOSEPH'S GERMAN CHURCH, EAST 87th STREET, NEW YORK CITY. P. Josephus Durthaller Superior a die 31 Julii, 1874 Cur. ger. paroch Oper Conf. poenit. sor. bon. past. et orphan Proc Praes. sod. matron. et juven. P. Joannes Hackspiel Oper. Conf. Magdal., poenit et puell. apud sor. bon. past Praes. conf. bon. mort. P. Josephus Jerge Oper Conf. puell. apud sor. bon. past. Praes. sod. puell. PP. 3. Univ. 3."
    },
    {
        "text": "DOMUS PROBATIONIS S. P. IGNATII ad West Park MANRESA, WEST PARK, ESOPUS P. O., ULSTER COUNTY, N. Y. P. Patritius Gleason Rector a die 8 Sept. 1880 Mag. nov. Proc. P. Eduardus Doucet Soc. mag. nov. Doc Praef. spir. et Conf. NN. P. Joannes Bapst Conf. NN. Cur. val. COADJUTORES Dominicus Leischner Disp. Hortul. Excit. Geraldus Barry Caement. Ad dom. Gulielmus Donovan Adj. villici Ad dom. Jacobus Dwyer Ad omnia Joannes Freeth Arcul. Ad dom. Joannes Hilbert Sartor Ad dom. Joannes O'Connell Adj. hortul Ad dom. Josephus Kain Infirm Cust. vest. Vis. exam. vesp. Matthaeus Devine Villicus Emptor Petrus Tansey Lavat. Vis. orat. et exam. merid. Ad dom. Ricardus Purcell Adj. villic. Ad dom. NOVITII SCHOLASTICI Franciscus X. Aigner David Hearn Georgius Mulry Georgius Pettit Henricus Judge Jacobus Deck Thomas Burke"
    },
    {
        "text": "Michael Donar Eduardus Corbett Edmundus Burke Patritius Cormican Franciscus Lubbe Las Vegas, N. M. Jacobus R. Gray Carolus Mackin, Gulielmus J. Kerrill Albertus A. Ulrich Bernardus E. McCusker Thomas Fenton Petrus J. O'Carroll Jacobus H. Moffit Eduardus F. Roche COADJUTORES NOVITII Patritius Fitzgerald Jacobus McNulty in Coll. S. Petri, N. J. Patritius McCann Joannes J. Welch Joannes Doran PP. 3. Schol. 20. Coadj. 15. Univ. 38."
    },
    {
        "text": "RESIDENTIA TROJANA AD S. JOSEPHI ST. JOSEPH’S CHURCH, TROY, N. Y. P. Josephus Loyzance Sup. a die 30 Julii 1876 Cur. ger. utrius. paroch Oper Mod. filiar. Mariae Cur. ger. schol. puell Praes. soc. S. Vinc. et S. Jos. P. Alanus McDonell Oper Praes. soc. S. Sitis Sod. Pur. Cor. Muriae Sod. puer. soc. Temp Cons. dom. an. 2 P. Franciscus Marechal Oper. Cur. vicesger. S. Mich. Praes. conf. bon. mort., Ros. puer. et puell. Cons. dom. an. 3 P. Josephus Delabays Oper Praes. coll. cas. consc. Conf. FF. doct. Christ. et orphan Cons. dom. an. 6 P. Michael Nash Oper Praes. sod. juv., soc. Ros., prop. fid. et sod. SS. Cord. Cur. ger. schol. puer Cons. dom. an. 6 COADJUTORES Franciscus X. Brady Aed. in eccl. S. Mich. Hortul Vis. orat. et exam. Ad dom. Martinus Ealy Coq. Cust. tricl. Ad dom. Thomas Hogue Aed Empt Disp. Cust. vest. Vis. noct Janit. Excit. PP. 5. Coadj. 3. Univ. 8."
    },
    {
        "text": "IN DISTRICTU COLUMBIAE COLLEGIUM GEORGIOPOLITANUM et Convictus GEORGETOWN COLLEGE, D. C. P. Patritius F. Healy Rect. a die 31 Julii, 1874 Cens. libr. Praes. con. mod. Miss. Ind. Cath. P. Jacobus A. Doonan Min Praef. stud. et schol Conc. in sac Conf. extra. mon. Visit. B. M. V. Mod. soc. Philod. Cons. dom. an. 3 P. Joannes B. Mullaly Proc. Script. hist. dom. Doc. ling. gall. 3 cl. Cons. dom. an 7 P. Petrus J. Blenkinsop Praef. spir. et conf. NN., ord. mon. Visit. et in sac. Exhort. NN. Praes. coll. cas. consc. P. Jacobus A. Clark Cur. val. P. Jacobus Curley Adm Dir. Spec. astron Cust. virid. bot. Conf. NN. P. Benedictus Guldner Lect. log. met. et eth. Conf. NN Conf. et conc. in sac. et in eccl. mon. Visit. Henricus T. B. Tarr Lect. chym. et math. 1 cl. Praef. cubic. Josephus H. Richards Lect. phys. mech. et alg. Catech. FF. Praef. cubic."
    },
    {
        "text": "MAGISTRI P. Gulielmus T. Whiteford Doc. rhet. an. 10 mag. Conf. NN. et in sac Catech. conv. maj Praef. lect. ad mens Praes. sod. B. V. M. conv. maj Cons. dom. an. 2 Joannes F. X. O'Conor Doc. hum. an 4 mag. Praef. bibl. Praes. sod. B. V. M. alumn. min Mag. caerem. Mod. soc. Philon. Franciscus B. Goeding Doc. sup. gram. an. 4 mag. et ling. germ. Jacobus T. Gardiner Doc. med. gram. an. 3 mag. Joannes Scully Doc. inf. gram. an. 4 mag. et arith. 1 cl. P. Franciscus Casey Doc. rud. 1 cl. an. 7 mag. et arith. 3 cl. Conc. in sac. P. Jacobus A. McHugh Doc. rud. 2 cl. an 8 mag. Conc. in sac Praef. odei Praef. cubic. Thomas McLaughlin Doc. 2 cl. math. an. 1 mag. Joannes B. Lamb Doc. 3 cl. math. et ling. gall. 2 cl. an. 1 mag. P. Michael Flynn Doc. ling. gall. 1 schol. et cl. spec. Eduardus McTammany Doc. schol. spec. ling. angl. PRAEFECTI P. Gulielmus R. Cowardin Praef. 1 conv. maj. Catech. conv. min Doc. arith. 2 cl. Cons. dom. an. 1 Joannes Scully Thomas McLaughlin P. Michael Flynn Jacobus T. Gardiner Praef. 1 conv. min. Joannes B. Lamb Franciscus B. Goeding"
    },
    {
        "text": "COADJUTORES Aloisius Roth Cust. vest. alumn. min. Cur. baln. et lavac. Antonius McNerney Infirm Ad dom. Bartholomaeus Doyle Cur. val. Daniel Clarke Cur. val. Georgius F. Schaffner Dispens. Coq. Gulielmus Dugan Ratioc. Soc. proc. Gulielmus McElany Cust. tricl. alumn. Excit. Jacobus Marley Aedit. Soc. cust. tricl. NN. Jacobus O'Sullivan Faber lign. Jacobus T. O'Sullivan Faber ferr. Ad dom. Joannes Daly Cur. val. Patritius Sears Cust. tricl. NN. et cell. vin. Ricardus Dugan Cust. vest. et lavac Vis. med. et exam Ad dom Excit. Thaddaeus McKenna Adj. cust. vest. et lavac. Ad dom. Thomas Dougherty Sut. Comp. libr Empt. Ad dom. Thomas Gavan Pistor Ad dom. Thomas Shanahan Ad dom. PP. 12. Schol. 9. Coadj. 17. Univ. 38. RESIDENTIA GEORGIOPOLITANA AD SS. TRINITATIS TRINITY CHURCH, GEORGETOWN, D. C. P. Stephanus A. Kelly Min. Proc. Praef. eccl. Oper. Praes. sch. puer. ad SS. Trin., sod. bon. mort., Apost. Orat. et B. V. M. P. Aloisius Roccofort Oper Praes. schol. dom. Praes. conf. B. P. Claver et S. Caeciliae Martinus Whelan Coadj. Aedit. Ludim Ad. dom. PP. 2. Coadj. 1. Univ. 3."
    },
    {
        "text": "COLLEGIUM WASHINGTONIENSE GONZAGA COLLEGE, WASHINGTON, D. C. P. Robertus Fulton Rector a die 21 Junii, 1881 Proc. Praef. stud Conf. et conc. in T. Catech Praes. sod. SS. Cordis et Apostol. Orat. P. Patritius H. Toner Min Oper. Conf. et conc. in T. Praes. schol. paroch Cons. dom. P. Jacobus Noonan Oper Conf. et conc. in T. Praes. sod. juv., viror, mulier. et confr. bon. mort. Cons. dom. P. Patritius Forhan Oper Conf. et conc. in T. Praes. sod. viror. et mulier Cons. dom. an. 5 MAGISTRI P. Daniel Lynch Doc. sup. gram. Conf. NN. et puell. in Acad. Visit. et in T. Praef. spir Adm. Cons. dom. an. 20 Cornelius Gillespie Doc. med. gram. et arith. 1 cl. an. 3 mag. Praef. mor. Gulielmus B. Brownrigg Doc. inf. gram., algeb. an. 3 mag. Praes. sod. discip Sacrist. Script. hist. dom. P. Patritius J. O'Connell Doc. elem. et arith. 2 cl. Conf. in T. Joannes A. Buckley Doc. elem. et arith. 3 cl., ling. gall. 1 cl. an. 6 mag. Praef. cantus Arthurus J. McAvoy Doc. ling. angl., math. 2 et 3 cl., ling. gall. 2 cl. an. 3 mag. Praef. sch. et bibl. Mag. caerem."
    },
    {
        "text": "COADJUTORES Joannes Quin Aedit Ad dom. Thomas Kelly Coq Cust. tricl. et cell. vin Excit. PP. 6. Schol. 4. Coadj. 2. Univ. 12. RESIDENTIA AD S. JOSEPHI ST. JOSEPH'S CHURCH, C 2d N. E., WASHINGTON, D. C. P. Joannes P. M. Schleuter Min Proc. Praef. eccl. Oper Praes. sod. B. V. M. puell. et viror., confr. bon. mort. et S. Vincent. Conf. NN. Praes. et catech. schol. paroch. P. Josephus Busam Oper. Praes. sod. B. V. M. juv. et matron Conf. NN. Catech. in T. et schol. paroch. Henricus Rimbaugh Coadj Ad omnia PP. 2. Coadj. 1. Univ. 3."
    },
    {
        "text": "IN STATU MARYLANDIAE COLLEGIUM BALTIMORENSE LOYOLA COLLEGE, BALTIMORE, MD. P. Eduardus McGurk Rector a die 10 Oct. 1877 Praef. stud. et schol Proc. coll. Conf. et conc. in T. P. Samuel Cahill Min Soc. proc. coll. Praef. val., schol. dom. et sod. juven. Doc. gram. spec Conf. in T. Cons. dom. an. 1 P. Antonius Van den Heuvel Cur. val. P. Augustus Langcake Adm. Praef. eccles. et spir Oper. Conf. et conc. in T. Conf. NN. Praef. lect. ad mens Praes. sod. B. V. M. P. Carolus A. Heichemer Soc. proc. prov. Conf. in T. Conf. NN. Cons. dom. an. 1 P. Eduardus J. Sourin Oper. Conf. NN. Vis. in carc. P. Gulielmus F. Clarke Oper Conf. et conc. in T. Conf. NN. Catech. discip. Praes. coll. cas. consc. P. Petrus P. Fitzpatrick Lect. log. metaph. et ethic. Conf. et conc. in T. Praes. sod. bon. mort. et confr. SS. Cord. et Apost. Orat. Conf. NN. Cons. dom. an. 1 Carolus C. Lancaster Proc. prov Admin. bon. Theobaldus M. McNamara Lect. chym. et phys., et phys. math. Praef. odei"
    },
    {
        "text": "MAGISTRI P. Henricus Shandelle Doc. rhet. et hum. an. 8 mag. algeb., ling. germ. et eloc. 1 cl. Praef. soc. lit. Cons. dom. an. 2 Patritius J. Dooley Doc. sup. gram. an. 5 mag. Arith. 1 cl., ratioc. 1 cl., ang. 1 cl Praef. atrii Vis. med. et exam Bid. Joannes H. O'Rourke Doc. med. gram. an. 2 mag. math. 1 et 2 cl. et ling. ang. et assist. praef. atrii Praef. sod. discip. Gulielmus Quigley Doc. inf. gram. an. 2 mag., ling. gall. 3 cl. et ling. ang., math. 3 cl. Praef. bibl. Carolus Williams Doc. rud. 1 et 2 cl. an. 4 mag., arith 2 cl. et ratioc. 2 cl. Mag. caerem. et praef. min. 2 cl. eloc. et call. Michael A. Noel Doc. schol. praepar. an. 2 mag., arith. 3 cl. Scrip. hist. dom Assist. praef. bibl. Aloisius Maes Doc. ling. gall. COADJUTORES Daniel McLaughlin Aedit. Ad dom. Eduardus Shanahan Coq. Soc. empt. Eduardus Green Pict. Ad dom. Jeremias Flaherty Cust. tricl. Joannes Fortescue Soc. proc. coll. Empt. Ratioc. Joannes Paffe Sart. Cust. vest Aedit. Sac. dom. Ricardus O'Connell Fab. lign. Ad dom. Timotheus Sullivan Cust. cell. vin Ad dom. Vis. noct. PP. 9. Schol. 8. Coadj. 8. Univ. 25."
    },
    {
        "text": "DOMUS PROBATIONIS FRIDERICOPOLITANA NOVITIATE, FREDERICK, MD. P. Archibaldus J. Tisdall Rector a die 1 Oct. 1877 Mag. nov. P. Gulielmus H. Sumner Min. Sup. jun. Soc. mag. nov. Proc Praef. val. et bibl. Conf. in T. Cons. dom. an. 3 P. Bernardus Toale Oper Conf. NN. et in T Cons. dom. an. 1 Admon. P. Dominicus P. Coppens Oper. Excurr. ad S. Josephi, Urbanam et Middletown Coll. pp. pro litt. an Cons. dom. an. 1 P. Georgius I. Strong Cur. val. P. Jacobus F. Holland Praef. eccl. Oper Praes. schol. S. Joannis et sod. SS. Ang. P. Joannes J. Murphy Doc. rhet Praef. spir. et schol., stud., lect. ad mens. et ton Conf. NN. Praes. coll. cas. consc. Patritius J. O'Sullivan Doc. hum. AUDITORES RHETORICAE Anno Secundo Geraldus J. Bergan Cust bibl. jun. Joannes Greene Gulielmus Coyle Joannes Nicholson Gulielmus Curley Michael Cunningham Ignatius P. Deane Milesius A. McLaughlin Joannes Condon Stephanus Bueno Thomas Harlin Joannes F. Mahan Bid. Mag. caer."
    },
    {
        "text": "Anno Primo Cornelius Clifford Bid. schol. Joannes Brosnan Eduardus Kane Joannes S. Coyle Eduardus Reynaud Joannes B. O'Leary Eugenius French Adj. Mag. caer. Patritius J. Casey Gulielmus Cunningham Subbid. Ricardus Ryan Rufus Duff Gulielmus Ennis Thomas Cryan Gulielmus McDonough Jacobus Mugan Thomas P. Kernan Jacobus J. O'Connor Bid. schol. Thomas Wallace V. Howard Brown COADJUTORES VETERANI Blasius Walch Fab. horol. Franciscus Bausenwein Sart. Excit. Franciscus F. Bowes Infirm. Franciscus X. Scheuren Dispens Aedit. in T. Jacobus Doyle Cust. tricl. Vis. mat. Joannes Harkins Ludim. ad S. Joan Ad dom. Joannes Hogan Coq. Joannes O'Sullivan Cur. val. Joannes Rowley Arment. Joannes Sheehy Cur. val. Joannes Siebers Adj. hortul. Martinus O'Neill Stabul. Ad dom. Michael Carroll Cur. val. Michael Ryan Sutor Vis. noct. Ricardus Barrett Ludim. ad S. Joan. Ad dom. Thaddaeus Begley Janit. Thomas Carberry Hortul Ad dom. Thomas Kennedy Empt. Cust. vest. Ad dom. Virgilius S. Goulden Manud. coadj Fab. lign. Vis. med. et exam."
    },
    {
        "text": "NOVITII SCHOLASTICI P. Aloisius J. D. Bradley Franciscus Barnum Audenus A. Hill Gulielmus P. O'Connor Jacobus J. Byrne Joannes S. Hollohan Thomas G. Salter Carolus B. Macksey Daniel R. Campbell Gualterus S. Clarke Jacobus A. Gillespie Joannes W. Kolb Eduardus P. Lamb Joannes A. Moore Gulielmus H. Morrison P. Franciscus T. McCarthy Augustinus J. P. O'Malley Franciscus T. McNulty Gulielmus G. Quirk Josephus H. Rockwell COADJUTORES NOVITII Josephus E. Clocker Josephus A. Vigeant Ricardus F. Furlong PP. 9. Schol. 50. Coadj. 22. Univ. 81."
    },
    {
        "text": "COLLEGIUM SACRATISSIMI CORDIS JESU WOODSTOCK COLLEGE, HOWARD CO., MD. 1 P. Jacobus Perron Rector a die 22 Aprilis, 1875 Cons. prov. P. Carolus Bahan Min Proc. Praef. val. Cons. dom. an. 1 P. Aemilius de Augustinis Lect. theol. dogm. pomer Conf. et exam. NN. Cens. lib. Excurr. ad Elysville Cons. dom. an. 4 P. Aloisius Sabetti Lect. theol. moral. et jur. canon Praes. coll. cas. consc. et acad. sac. rit Cens. lib. Conf. NN. Praef. sac. dom. P. Benedictus Sestini Lect. astr., math. subl. et hist. nat Conf. NN. Cens. libr. Direct. gen. Apost. Orat Red. MESSENGER P. Blasius Schiffini Lect. theol. dogm. comp. et ethic. Cens. libr. P. Carmelus Polino Lect. metaph. spec. 2 an Cens. libr. P. Carolus Piccirillo Praef. stud. et bibl. Lect. S. Script. Cens. libr. Exam. NN. Cons. dom. an. 3 P. Dominicus Pantanella Lect. theol. dogm. mat. Conf. et exam. NN. Praef. ton. pro. theol Cens. libr. Cons. dom. an 4 P. Eduardus I. Devitt Lect. metaph. spec. 3 an Exam. NN. Praef. lect. ad mens. et concion. Red. WOOD STOCK LETTERS Script. hist. dom Coll. pp. pro litt. ann. Cens. libr. Excurr. ad Poplar Springs P. Januarius Degni Lect. phys., chym. et phys. math."
    },
    {
        "text": "P. Joan. Bapt. Miege Adm. Praef. spir. Conf. NN. P. Petrus Cooney Oper Cur. ger. paroch. Excurr. ad Sykesville P. Salvator Brandi Lect. log. et metaph. gen Praes. acad. hebr. Exam. NN. Excurr. ad Harrisonville AUDITORES THEOLOGIAE Anno Quarto P. Thomas H. Stack Cat. puer. ad Elysville Anno Tertio Aloisius Robaut Daniel McErlane Eduardus Connolly Praes. acad. eloc. et ton. pro. philos. Hermannus Blumensaat Jacobus Hoeffer Joannes A. Conway Bid. sch. S. Script. et jur. can Cat. puer. ad Marriotsville P. Joannes Harpes Doc. cat. FF. Coadj. Michael A. O'Kane Cat. puer. ad Marriottsville Michael P. Dowling Nicolaus Schlechter Thomas Fitzgerald Vis. mat. et noct. Thomas O'Callaghan Expl. pp. med. FF. Coadj. Anno Secundo Alexander Freund Dominicus Giacobbi Bid. sch. dogm. Vis. med. et exam. Jacobus O'Sullivan Praef. bibl. ad jan. Joannes J. Beckett Michael O'Neil Subbid. Sanctes Filippi Vis. med. et exam."
    },
    {
        "text": "Anno Primo Henricus Sandaal Adj. praef. sac. dom. AUDITORES THEOL. DOGM. COMPENDIOSAE Anno Secundo Andreas Rapp Bid. sch. dogm. Angelus Coltelli Praef. bibl. theol Praef. acad. cant. eccl. Henricus Rigues Hubertus Heidenreich Michael Mulry P. Robertus Pardow Bid. Thomas W. Hayes Anno Primo Alfredus Blatter Petrus de Villiers AUDITORES PHILOSOPHIAE Anno Tertio Augustinus Effinger Cat. puer. ad Woodstock Augustinus K. Meyer Bid. schol. Cornelius B. Sullivan Eduardus Gaffney Franciscus J. Cummings Franciscus Klocker Franciscus Powers Praef. odei Cat. puer. ad Elysville Fridericus Tourtelot Gulielmus Clark Gulielmus Power Henricus de Laak Praes. 1 acad. graec. Jacobus Corbley Joannes Clarke"
    },
    {
        "text": "Joannes Hart Cat. puer. ad Woodstock Joannes Rodock Vis. noct. et mat. Joannes Wynne Cat. puer. nigrit. Nicolaus Davis Patritius Casey Patritius Kelly Adj. praef. bibl. dom. P. Raphael Dewey Thomas Murphy Catech. puer. ad Woodstock Anno Secundo Abraham Emerick Alexius de Stockalper Aloisius Brosnan Aloisius Rotter Antonius Maas Dionysius McCarthy Catech. puer. ad Harrisonville Dionysius O'Sullivan Eduardus Spillane Bid. phil. Emmanuel de Lamoriniere Praes. 2 acad. graec. Franciscus Berberich Gulielmus Cornell Gulielmus Gannon Bid. schol. Gulielmus Hayes Gulielmus Hoffend Vis. med. et ex. Gulielmus Mullan Subbid. Gulielmus Stanton Praef. off. ad comp. libr. Gulielmus Tyrrell Vis. noct. et mat. Henricus Van Rensselaer Joannes Kokenge Joannes Collins Vis. med. et ex. Joannes D. Mathery Vis. noct. et mat. Joannes F. Quirk Joannes Galligan"
    },
    {
        "text": "Josephus Hann Joannes O'Gorman Vis. med. et ex. Josephus Woods Martinus McGinnis Michael O'Connor Adj. bid. sch. pro. chym. Patritius Boyle Patritius Kernan Patritius McQuillan Patritius Murphy Patritius O'Leary Thomas Gasson Thomas Haggerty Catech. puer. nigrit. Thomas E. Sherman Timotheus Barrett Anno Primo Daniel A. Doherty Vis. med. et ex. Eduardus Magrath Franciscus H. McGovern Vis mat. et noct. Franciscus McGurk Cat. puer. ad Woodstock Gulielmus Duffy Cust. sac. Immac. Conc. Gulielmus Judge Henricus Rache Cust. sac. S. Jos. Jacobus Mulvaney Bid. schol. Jacobus V. Kelly Cust. sac. mort. Joannes Pittar Joannes T. Hedrick Doc. math. elem. Josephus A. Gorman Josephus A. Mattson Cust. sac. SS. Cord. Josephus Hanselman Cat. puer. ad Harrisonville Josephus J. Prendergast Josephus Renaud Cust. sac. SS. Angl. Josephus Stadelman"
    },
    {
        "text": "Josephus V. Schmidt Ludovicus Weber Praes. 3 acad. graec. Patritius Mulry Petrus A. Roche Cat. puer. nigrit. Petrus Bougis Petrus Kayser Praef. bibl. philos. Stephanus de Rouge Thomas Callanan Thomas J. Walsh COADJUTORES Alexander Walsh Cust. vest. Jan. 2 Ad dom. Antonius Romano Cur. val. Extra dom. Bernardus Gaffney Hortul. Cajetanus Campone Cust. tricl. Cornelius Reardon Adj. proc. Daniel Fortescue Adj. red. MESSENGER Gulielmus Hill Fab. fer Vis. med. ex. et noct. Henricus Dugan Ad dom. Henricus McCabe Aedit. Ad dom. Excit. Jacobus J. McCloskey Adj. infirm. Jacobus O'Kane Typogr. Joannes Cunningham Infirm. Joannes Mattingly Arment. Michael Cashman Ad dom. Michael Foley Cur. val. Extra dom. Patritius Cassidy Ad dom. Patritius McGlone Cust. cell. vin Jan. 1 Comp. lib. Patritius Souren Coq. Raphael Vezza Arcul. Theodorus Vorbrinck Villic. Empt. Excit. Thomas Crowley Sutor Thomas Ekins Sartor PP. 18. Schol. 109. Coadj. 22. Univ. 149."
    },
    {
        "text": "MISSIONES PAROCHIALES in Statu Marylandiae RESIDENTIA AD BOHEMIAM WARWICK P. O., CECIL CO., MD. P. Joannes B. Gaffney Oper Excurr. ad Middletown, etc. RESIDENTIA AD S. IGNATII ST. INIGOES, ST. MARY'S CO., MD. P. Livius Vigilante Superior Oper. P. Jacobus P. Neale Proc. Oper Excurr. ad S. Nicolai et S. Georgii RESIDENTIA AD LEONARDTOWN LEONARDTOWN, ST. MARY'S CO., MD. P. Carolus K. Jenkins Sup. Oper Praes. sod. B. V. M. nigrit Praes. sch. dom. P. Basilius Pacciarini Oper. Excurr. ad S. Joannis et Newtown P. Cemens S. Lancaster Oper Excurr. ad S. Heart et Lady's Chapel Praes. conf. bon. mort. P. Gulielmus Treacy Oper Excurr. ad S. Joseph. et Me chanicsville"
    },
    {
        "text": "RESIDENTIA AD S. THOMAE COX’S STATION, CHARLES CO., MD. P. Bernardus F. Wiget Sup. Oper Praes. sod. B. V. M. viror, puer. et mulier. P. Andreas P. Keating Oper. Excurr. ad Pomfret, Corn wallis' Neck, Hilltop, etc. P. Eugenius McSwyney Oper Excurr. ad Port Tobacco, La Plata, etc. David C. Daly Schol Cur. val., stud. priv. Joannes Broderick Schol. Cur. val., stud. priv. RESIDENTIA AD WHITEMARSH COLLINGTON P. O., PRINCE GEORGE'S CO., MD. P. Jacobus Major Sup. Oper. Excurr. P. Jacobus Cotting Oper. Excurr. Mauritius Cavanagh Coadj. Coq Aedit. Ad omn. IN MISSIONIBUS IN STATU MARYLANDIAE PP. 12. Schol. 2. Coadj. 1. Univ. 15."
    },
    {
        "text": "IN STATU MASSACHUSETTS COLLEGIUM BOSTONIENSE BOSTON COLLEGE, 761 HARRISON AVENUE, BOSTON, MASS. P. Jeremias O'Connor Rect. a die 11 Jan. 1880 Praef. stud Praes. caet. juv. cathol., sod. B. V. M. puell. et confr. bon. mort. Conf. et conc. in T. P. Alphonsus Charlier Min Adm Praef. eccl. et val Script. hist. dom Coll. pp. pro litt. ann Praes. conf. SS. Cordis Cons. dom. an. 15 P. Alexius L. Jamison Oper Praes. schol. dom Conf. in T. P. Antonius F. Ciampi Proc. Conf. et conc. in T. Praes. sod. filiar. Mariae ad SS. Cordis Cons. dom. an. 1 P. Eduardus H. Welch Praef. spir. et conf. NN. Oper Catech. discip Praes. coll. cas. consc. et sod. filiar. Mariae ad N. D. Conf. et conc. in T Cens. libr. P. Nicolaus Russo Lect. log., metaph. et eth. Praef. bibl. Praes. sod. matron Conf. et conc. in T. Cons. dom. an. 4 P. Petrus Cassidy Praef. schol Adj. praes. caet. juv. cath. Praes. sod. juv. Doc. ling. gall. 1 cl. Conf. et conc. in T. Praef. odei P. Simon P. Dompieri Oper. cur. ger. nosoc. municip. Conf. NN. et in T. Josephus I. Ziegler Lect. phys. et chym. 3"
    },
    {
        "text": "MAGISTRI P. Michael J. Byrnes Doc. rhet. an. 13 mag. Mod. soc. lit. discip. senior Praef. sod. B. V. M. viror Conf. et conc. in T. Cons. dom. an. 1 Timotheus Brosnahan Doc. hum. an. 3 mag. et math. 1 cl. Eduardus X. Fink Doc. sup. gram. an. 3 mag., math. 2 cl. et ling. gall. 3 cl. Praes. soc. milit. discip. cadets Michael C. Dolan Doc. med. gram. an. 5 mag., algeb. 2 cl. et ling. gall. 4. cl. Adj. praes. soc. dramat. Joannes M. Colgan Doc. inf. gram. an. 2. mag., math. 3 cl. et ling. gall. 4. cl. Martinus J. Hollohan Doc. elem. 1 cl. an. 1 mag. et algeb. 1 cl. Mod. soc. lit. discip. junior Adj. praef. bibl. P. Hugo A. Quin Doc. elem. 2 cl. an 6 mag. Dir. spirit. in asyl. munic. puer Oper. D. Leo Brand Stud. theol. priv Submin. Praef. atrii et sod. SS. Angl. discip. Mag. caerem Bidellus Praeterea scholarum Magistri externi duo COADJUTORES Jacobus McCloskey Jan. Ad dom. Joannes Curran Cust. tricl. Vis. med. et exam Ad dom. Joannes Moriarty Coq. Cust. cell. vin. Excit. Patritius Brady Cust. calor Jan. coll. Vis. noct. Ad dom. Robertus Dockrey Pictor Aedit. sac. dom Infirm Ad dom. Theodulus Vachon Empt. Cust. vest. Soc. aedit. Ad dom. Timotheus Fealy Aedit. Ad dom. PP. 10. Schol. 7. Coadj. 7. Univ. 24."
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS AD S. MARIAE CHURCH OF ST. MARY OF THE SACRED HEART, 45 COOPER STREET, BOSTON, MASS. P. Gulielmus H. Duncan Sup. Proc. Oper Praef. eccl. Praes. schol. paroch. pro puell., sod. B. V. M. matron., confr. SS. Cordis, bon. mort., scap., sanct., et confr. S. Vinc Conf. et conc. in T. Conf. NN. P. Bernardus A. Maguire Mission. excurr. sup. Conf. NN. P. Fridericus J. Holland Oper Praes. sod. B. V. M. pro junior. faem Conf. et conc. in T. Instr. convers Conf. NN. Cons. dom. an. 2 P. Gulielmus J. Scanlan Oper Praes. sod. B. V. M. pro viris Conf. et conc. in T. Conf. NN. Cons. dom. P. Gulielmus F. Hamilton Mission. excurr. Conf. NN. P. Jacobus J. Bric Oper. in ins. Deer et Rainsford in xenod. et carc. P. Joannes A. Morgan Mission. excurr. P. Joannes H. Finnegan Mission. excurr. P. Michael F. Byrne Oper Praes. schol. paroch. pro puer. Praes. sod. B. V. M. pro. puell. in schol. paroch. et juv. Conf. et conc. in T. Cons. dom. P. Thomas. A. Reid Oper Praes. schol. dom. et sod. B. V. M. pro puer Conf. et conc. in T. COADJUTORES Joannes Lynch Aedit. Empt Ad dom. Joannes McElroy Jan. Ad dom Cur. val. Patritius F. Quinn Cust. tricl. Excit Ad dom. Cur. val. Jacobus McDonnell Aedit. Ad dom. Cur. val. PP. 10. Coadj. 4. Univ. 14."
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS AD SS. TRINITATIS TRINITY CHURCH, 2I LUCAS STREET, BOSTON, MASS. P. Franciscus X. Nopper Sup. Proc. Praef. eccl. Oper. Praes. schol. paroch., confr. SS. Cordis, et SS. Rosarii viror. P. Ignatius Bellwalder Praef. spir. et Conf. NN Oper Praes. confr. SS. Rosar. matron., sod. B. V. M. puell. et bon. mort Excurr ad Lawrence et Manchester P. Joannes Jansen Praes. sod. B. V. M. juven Oper Doc. ling. germ. in coll. Boston COADJUTORES Caspar Menke Aedit. Sart. Jan. Ad dom. Laurentius Guthing Disp. Coq. Sart. Ad dom. PP. 3. Coadj. 2. Univ. 5. COLLEGIUM VIGORNIENSE ET CONVICTUS HOLY CROSS COLLEGE, WORCESTER, MASS. P. Eduardus D. Boone Rector a die 9 Aprilis, 1879 Praef. stud. et schol. P. Albertus Peters Min Proc Praef. sac. Conf. et conc. in sac Script. hist. dom Coll. pp. pro litt. ann Cons. dom. P. Carolus H. Stonestreet Praef. spir. et conf. NN. Conf. et conc. in sac Praes. coll. cas. consc. Exhort. dom Catech. FF. coadj Adm."
    },
    {
        "text": "P. Joannes J. Ryan Lect. log., met. et eth Catech. alumn. Praef. bibl. Conf. et conc. in sac. Conf. NN. Cons. dom. an. 3 Gulielmus P. Brett Lect. astron., phys. et chym. MAGISTRI P. Joannes J. McAuley Doc. rhet. an. 12 mag. Conf. et conc. in sac Conf. NN. Praef. lect. ad mens Praes. sod. B. V. M. alumn. Cons. dom. an. 2 Thomas J. Gannon Doc. hum. an. 4 mag. et math. 3 cl. Patritius Quill Doc. supr. gram. an. 5 mag. et math. 2 cl. Gulielmus J. Tynan Doc. med. gram. an. 4 mag. et math. 1 cl. Jacobus W. Collins Doc. inf. gram. an. 3 mag. et arith. 3 cl. Franciscus X. Sadlier Doc. rud. an. 3 mag., arith. 2 cl. et ling. gall. 1 cl. Praes. sod. SS. Angel. Joannes F. Lehy Doc. algeb. et ling gall. 2 cl. an. 3 mag. Josephus J. Himmelheber Doc. arith. 1 cl., ratioc. et calig. et spec. cl. an. 5 mag. Praef. atrii philos Adj. praef. bibl. Mag. caerem. et praef. min. ad altare PRAEFECTI P. Patritius H. Brennan Praef. val. et odei Doc. ling. gall. 3 cl. Cons dom. an. 2 Gulielmus J. Tynan Jacobus W. Collins Joannes F. Lehy Thomas J. Gannon COADJUTORES Antonius Beckmann Fab. lign. Aedit. Jacobus O'Neill Pistor Jacobus Strain Soc. proc Ratioc. Empt Infirm. Joannes Farrell Cur. val. Ad dom."
    },
    {
        "text": "Joannes J. O'Neill Cust. vest. Soc. infirm. Ad dom. Michael Hogan Adj. coq. Michael Loftus Cust. tricl. NN. et cell. vin. Excit. Michael O'Sullivan Cur. val. Patritius Gallagher Coq. PP. 6. Schol. 8. Coadj. 9. Univ. 23. IN STATU NEO CAESARIENSI RESIDENTIA CAESARIENSIS AD S. PETRI et Collegium Inchoatum ST. PETER'S COLLEGE, GRAND STREET, JERSEY CITY, N. J. P. Joannes McQuaid V. Rector a die 31 Julii, 1880 Cur. ger. paroch Proc. P. Petrus O. Racciot Min Praef. stud. et disc. Conf. et Conc. in T. Praes. coll. cas. consc. Mod. confr. bon. mort. et Ros. viror Praef. bibl. et lect. ad mens Cons. dom. P. Antonius M. Mandalari Oper. Catech. FF. Vis. xenod. Conf. et conc. in T. Conf. alumn Mod. soc. vir. Cons. dom. P. Franciscus McAtee Oper. Adm. Praef. spir. et conf. NN. et alumn Catech. schol. dom Mod. Sod. SS. Cordis, sod. filiar. Mariae et B. V. M. P. Joannes Cunningham Doc. spec. lat. curs. an. 27 mag."
    },
    {
        "text": "MAGISTRI P. Franciscus Smith Doc. rhet. an. 7 mag. Lect. hist. et evid. relig. Conf. NN. et alumn. et poenit. apud. soror. bon. past. Conc. in T. Mod. soc. Temp. et S. Vinc. et Unio. Cath Mod. 1 sod Praef. bibl. alumn. Cons. dom. an. 3 Michael P. Hill Doc. hum. an. 3 mag. et geom. Expl. med. FF. Mod. 2 sod. Jacobus Fagan Doc. supr. gram. an. 3. mag. et ling. gall Coll. pp. pro litt. ann Script. hist. dom Adj. praef. bibl. Franciscus G. Gunn Doc. med. gram. an. 4 mag. et ling. germ. Jacobus Wellworth Doc. inf. gram. 1 cl. an. 3 mag. Jacobus Smith Doc. inf. gram. 2 cl. an. 4 mag. Submin. Franc. Sales. Fullerton Doc. ling. angl. 1 cl. et algeb. an. 5 mag. Joannes Fox Lect. chym. et math. Doc. ling. angl. 2 cl. Franciscus X. Brady Doc. arith. Adj. praef. Supplet pro mag. Michael Conway Cur. val. COADJUTORES Jacobus McNulty Aedit. in T. Cust. tricl. Vis. noct. Ad dom. Jacobus O'Brien Disp. Adj. cur. forn. Excit. Ad omn. Joannes Cullin Cust. vest Adj. sart. Ad omn. Joannes Langan Arcul. Cur. forn. Ad omn. Nicholaus Schu Janit Infirm. Sart. Ad omn. Patritius Ranahan Coq. Empt. Ad dom. PP. 6. Schol. 9. Coadj. 6. Univ. 21."
    },
    {
        "text": "IN STATU PENNSYLVANIAE RESIDENTIA CONEWAGINENSIS P. O. MCSHERRYSTOWN, ADAMS CO., PENN. P. Josephus Enders Sup. Oper. Proc. Praes. sod. SS. Sacram., confr. SS. Cordis et Rosarii P. Georgius Villiger Oper Excurr. ad Littlestown Praes. sod. B. V. M. P. Joannes B. Archambault Oper. Excurr. ad Oxford et Paradise Praes. sod. B. V. M. P. Joannes B. Emig Oper. Excurr. ad Hanover Praes. sod. B. V. M. P. Petrus Flanagan Oper. Conf. et conc. in T. P. Petrus Manus Oper. Excurr. ad McSherrystown et Irishtown Conf. in T. Praes. confr. bon. mort. P. Thomas Finnegan Cur. val. COADJUTORES Hugo McGunegle Hortul. Ad dom. Michael Donohue Ad dom. PP. 7. Coadj. 2. Univ. 9."
    },
    {
        "text": "RESIDENTIA GOSHENHOPPENSIS CHURCHVILLE, COLEBROOKDALE P. O., BERKS CO., PENN. P. Augustinus Bally Sup. Oper. Praes. sod. B. V. M. P. Joannes B. Meurer Oper Excurr. ad varias stationes. Josephus Brembacher Coadj. Aedit. Ad dom. PP. 2. Coadj. 1. Univ. 3. RESIDENTIA PHILADELPHIENSIS SS. NOMINIS JESU CHURCH OF THE GESU, 18th STILES STS., PHILADELPHIA, PENN. P. Burchardus Villiger Sup. Oper Proc. Praef. eccl. Praes. confr. bon. mort., SS. Cordis, Rosarii et animar. defunct. P. Alphonsus Coppens Oper Conf. sen. apud sor. paup. Conf. et conc. in T. Praes. sod. B. V. M. Cons. dom. an. 4 P. Carolus Cicaterri Adm. Oper Praef. spir. et conf. NN. et in T. Coll. pp. pro. litt. ann Praes. coll. cas. consc. nostr. Cust. bibl. Cons. dom. an. 3 P. Gulielmus H. Carroll Oper. Conf. et conc. in T. Praes. schol. elem. et dom Cons. dom. P. L. Hippolytus Gache Oper Conf. NN. et in T. Visit. nosoc. Conc. in T. P. Patritius Claven Oper. P. Ricardus White Oper. Cur. val."
    },
    {
        "text": "COADJUTORES Arthurus Gormley Cust. cell. vin Ad dom. Joannes Brady Cust. vest Aedit. Ad dom. Joannes Hammill Cur. val. Thomas Murray Ad dom. PP. 7. Coadj. 4. Univ. 11. RESIDENTIA PHILADELPHIENSIS AD S. JOSEPHI ST. JOSEPH'S CHURCH, WILLING'S ALLEY, PHILA., PENN. P. Josephus M. Ardia Sup. Oper Proc. Praef. eccl Praes. confr. SS. Cordis et schol. paroch. P. Aloisius Romano Oper Conf. et conc. in T. Praes. sod. B. V. M. jun Praef. bibl. P. Franciscus O'Neill Oper. Conf. et conc. in T. Conf. NN. Coll. pp. pro litt. ann. Script. hist. dom Cons. dom. an. 1 P. Patritius A. Jordan Oper. Conf. et conc. in T. Praes. schol. dom. et sod. B. V. M. sen Cons. dom. an. 12 P. Patritius Duddy Cur. val. COADJUTORES Joannes Dowling Excit. Cust. tricl. et vest Ad dom. Michael Nash Infirm Aedit. Ad dom. PP. 5. Coadj. 2. Univ. 7."
    },
    {
        "text": "IN STATU RHODE ISLAND RESIDENTIA AD S. JOSEPHI IN CIVITATE PROVIDENCE ST. JOSEPH'S CHURCH, 92 HOPE ST., PROVIDENCE, R. I. P. Gulielmus B. Cleary Sup. Oper. Proc. Praef. eccl. Praes. schol. paroch., sod. B. V. M. puell. et matron., confr. SS. Ros. et soc. sanct. Mod. soc. S. Vincent Coll. pp. pro. litt. ann. P. Joannes B. Nagle Oper Praes. schol. dom. et sod. B. V. M. viror. juven. et puer Conf. NN. P. Thomas M. Sheerin Oper. Praes. sod. viror. sen. et confr. bon. mort. Conf. NN. Eduardus Donnelly Coadj Aedit. Ratioc. Ad dom. PP. 3. Coadj. 1. Univ. 4. IN STATU VIRGINIAE RESIDENTIA ALEXANDRINA ST. MARY'S CHURCH, ALEXANDRIA, VA. P. Dionysius O'Kane Sup. Oper. Proc. Praes. schol. dom., confr. SS. Cordis. et bon. mort. Excurr. ad Fairfax, etc. P. Joannes B. de Wolf Oper Praes. sod. B. V. M. et schol. dom. nigrit Excurr. ad Falls Church, etc. PP. 2. Univ. 2. ADDENDUM In Coll. S. Francisci Xaverii, Neo Eboraci P. Paulus Mignard Cur. valet."
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM IN ROMANA P. Boursaud, Eduardus V. Fesulis Subst. Secr. Assist. IN ANGLIAE P. Kerr, Petrus P. Oper. in ins. Jamaicae IN BELGICA P. Campbell, Thomas Aud. theol. an. 4 Lovanii P. Casey, Jacobus IN FRANCIAE P. Prendergast, Joannes Agit an. 3 prob. IN NEAPOLITANA P. Haugh, Daniel Oper. in Colorado Hughes, Michael Schol. Doc. in coll. Las Vegas, N. Mex. Lubbe, Franc. Schol. Nov IN TAURINENSI P. Voung, Edmundus J. Doc. in Coll. S. Clarae, Cal. Hamilton, Robertus Coadj. Doc. in miss. ad Montes Saxos. IN VENETA P. Muller, Augustus Oper. in miss. Mangalore PP. 8. Schol. 2. Coadj. 1. Univ. 11."
    },
    {
        "text": "EX ALIIS PROVINCIIS IN NOSTRA DEGENTES EX ANGLIAE Heidenreich, Hubertus Aud. theol. an. 2. curr. br. EX AUSTRIACA P. Holzer, Joannes Oper. P. Prachensky, Josephus Oper. EX BELGICA De Pooter, Fridericus Coadj. EX FRANCIAE P. Daubresse, Isidorus Oper. P. Loyzance, Josephus Oper. P. Marechal, Franciscus Oper. P. Mignard, Paulus Cur. val. P. Perron, Jacobus Rect. Woodstock Sem. P. Thebaud, Augustus Script. Oper. Mace, Julius Coadj Doc. mus. EX GERMANICA P. Nopper, Franciscus X. Oper. P. Schleuter, Joannes P. M. Oper. EX LUGDUNENSI ET MISS. NEO AUREL. P. Gache, L. Hippolytus Oper. P. Roccofort, Aloisius Blatter, Alfredus Aud. theol. an. 1 curr. br."
    },
    {
        "text": "Clarke, Joannes Davis, Nicolaus Freund, Alexander Gaffney, Eduardus Lamoriniere de , Em. O'Callaghan, Thomas O'Leary, Patritius Power, Gulielmus Rigues, Henricus Stockalper de , Alois Tyrrell, Gulielmus EX MISSOURIANA P. Miege, Joannes B. Berberich, Franciscus Boyle, Patritius Corbley, Jacobus Dowling, Michael P. Effinger, Augustinus Fitzgerald, Thomas Hoeffer, Jacobus Hoffend, Gulielmus Klocker, Franciscus Kokenge, Joannes B. Laak de , Henricus Mathery, Joannes D. McErlane, Daniel McGinnis, Martinus Meyer, Augustinus M. O'Connor, Michael O'Neil, Michael Rotter, Aloisius"
    },
    {
        "text": "Schlechter, Nicolaus Sherman, Thomas E. Sullivan, Cornelius B. EX NEAPOLITANA P. Augustinis de , Aemilius M. Lect. theol. dogm. P. Brandi, Salvator M. Lect. phil. P. Degni, Januarius Lect. phys. et chym. P. Mandalari, Antonius M. Oper P. Pantanella, Dominicus Lect. theol. dogm. P. Piccirillo, Carolus Praef. stud. et lect. P. Polino, Carmelus Lect. phil. P. Romano, Aloisius Oper. P. Russo, Nicolaus Lect. phil. P. Sabetti, Aloisius Lect. jur. can., etc. P. Schiffini, Blasius Lect. eth. Campone, Cajetanus Coadj. Ad dom. Vezza, Raphael Coadj. Arcul. EX TAURINENSI Coltelli, Angelus Filippi, Sanctes Giacobbi, Dominicus O'Gorman, Joannes O'Sullivan, Jacobus Robaut, Aloisius EX VENETA P. Cicaterri, Carolus Oper. PP. 25. Schol. 40. Coadj. 4. Univ. 69."
    }
]