[
    {
        "text": "1922"
    },
    {
        "text": "R. P. JOSEPHUS H. ROCKWELL PRAEPOSITUS PROVINCIALIS A DIE 31 JUL., 1818 30 West Sixteenth Street, New York, N. Y., United States of Amerles P. Josephus N. Dinand, Socius a die 25 Jul. 1918, Cons. Prov., Adm. Josephus H. Ramspacher, Socius Coadj. CONSULTORES PROVINCIAE P. Gulielmus F. Clark, Rector Dom. Prob. S. Andreae, a die 20 Nov. 1915 P. Joannes B. Creeden, Rector Coll. Georgiopol., a die 1 Mai. 1918 P. Josephus N. Dinand, Socius R. P. Provincialis, a die 25 July, 1918 P. Jacobus A. McGivney, Proc. et admin. bon. Prov., pag. 28 30 WEST 16TH STREET, NEW YORK, N. Y."
    },
    {
        "text": "COLLEGIUM BALTIMORENSE LOYOLA COLLEGE, CALVERT AND MADISON STS., BALTIMORE, MD. P. Josephus A. McEneany, Rect. a die 27 Jul. 1918, Dir. apost. orat. pro archidiaec. Baltimor., Mod. soc. S. V. P., Conf. et conc. in T., Exam. candid. P. Josephus M. Renaud, Min., Proc., Praef. val., Conf. et conc in T., Cons. an. 16 P. Ayd, Josephus J., Oper. in carc. et dom. correct., Lect. aecon. polit., hist. et journalism, Mod. soc. disp. alumn. Coll., Praes. coll. cas. consc., Conc. in T. P. Brennan, Patritius H., Conf. NN. P. Connell, Franciscus M., Praef. stud. in Schola Alta, Mod. soc. prop. fid. et soc. litt. S. Agnet., Conf. et conc. in T., Exam. candid., Cons. an. 2 P. Delihant, Thomas J., Oper., Mod. faed. SS. Cord., confr. bon. mort. et schol. domin., Instr. conv., Conf. alumn. et in T., Conc. in T. P. Finegan, Philippus M., Praef. stud. in Coll., Doc. rhet. et ling. hisp. an. 13 mag., Praef. lect. ad mens., Red ANNUAL, Conf. NN. et in T., Conc. in T., Exam. can did. P. Gerst, Franciscus J., Stud. priv. in Johns Hopkins Univ. P. Hargadon, Franciscus B., Doc. hum. et evid. rel. an. 17 mag., Conf. et conc. in T. P. Joliat, Josephus S., Stud. priv. in Johns Hopkins Univ. P. Kelley, Josephus M., Lect. phys. et mech., Mod. soc. Secchi P. McDonnell, Eugenius DeL., Praef. eccl., Oper., Mod. sod B. V. M. vir. et mul. et faed. vir., Red. CHURCH BUL LETIN, Conf. NN., alumn. et in T., Conc. in T., Cons. an. 4 P. McLoughlin, Henricus W., Lect. chim. anal. et gen., Doc. trig. et anal. geom., Conf. NN. et in T., Cons. an. 1"
    },
    {
        "text": "P. O'Carroll, Petrus J., Submin., Adj. proc., Coll. pp. litt in. et script. hist. dom., Conf. NN. alumn. et in T. P. Ooghe, Justinus J., Lect. log., metaph. gen., spec. et eth., Praef. bibl. dom., Conc. in T. P. Purtell, Michael A., Praef. spir., Conf. NN. et alumn., Cur. ger. surd. et mut., Expl. pp. et cat. FF. P. Sheehy, Michael J., Adj. proc., Adj. in carc. P. Ziegler, Josephus I., Doc. inf. gram. ord. super. et ling. gall. an. 32 mag., Conf. NN. et in T., Exam. candid. Bleicher, Antonius J., Doc. sup. gram., geom., eloc. et evid rel., Mod. soc. disp. alumn. jun., An. 2 Finan, Franciscus C., Doc. inf. gram. ord. infer., eloc. et evid rel., Mod. soc. dram., Adj. mod. soc. athlet., An. 1. Henfling, Fridericus W., Doc. med. gram., alg., geom., eloc. et evid. rel., Praef. bibl. alumn., Bid., An. 4 Hughes, Thomas C., Doc. inf. gram. ord. infer., eloc. et evid rel., Mod. soc. S. Joan. Berch., An. 1 Purcell, Alfredus A., Doc. med. gram., alg., geom.,, eloc. et evid. rel., Red. LOYOLA, An. 4 Travers, Aloisius S., Praef. disc., Doc. ling. hisp., Mod. soc. athlet., An. 3 COADJUTORES Carley, Gulielmus E., Villic. praed. Prov. Duffy, Joannes J., Mod. fam., Cust. calor. et sac. S. Joseph., Excit., Vis. mat. et noct., Bid., Ad dom. Hammill, Joannes H., Adj. secr. dom., faed. vir. et Coll. Debt Fund, Ad dom McShane, Thomas, Cust. vest., cell. vin. et sac. dom., Infirm. Empt., Excit., Vis. mat., noct., med. et exam., Ad dom. Powers, Raymundus J., Ad dom. Vizard, Michael, Aedit., Adj. mod. soc. S. Joan. Berch., Ad dom. Sac. 18 Schol. 6 Coadj. 6 Univ. 30"
    },
    {
        "text": "RESIDENTIA BOWIENSIS SS. Ascensionis CHURCH OF THE ASCENSION, BOWIE, MARYLAND P. Aloisius J. Guiney, Sup. a die 4 Sep. 1919, Proc., Oper. Mod. sod. B. V. M. mul., faed. SS. Cord. et soc. S. Joan. Berch., Praef. odei, Coll. pp. litt. an. et script. hist. dom., Cap. equit. S. Joan., Excurr. ad Woodmore, Conf et conc. in T. P. Kelly, Henricus B., Oper., Mod. faed. SS. Cord. et sod. B. V. M. mul., confr. SS. Nominis, Excurr. ad White Marsh, Conf. NN. et in T., Conc. in T., Cons. an. 1 Sac. 2 Univ. 2"
    },
    {
        "text": "COLLEGIUM BROOKLYNIENSE BROOKLYN COLLEGE, 1125 CARROLL ST., BROOKLYN, N. Y. P. Josephus A. Farrell, Rect. a die 24 Jun. 1920, Proc., Mod. sod. B. V. M. alumn. vet., Conc. in T., Exam. candid. P. Jacobus F. McDermott, Min., Praef. val., Mod. sod. B.V. M. paroch., Conf. alumn. et in T., Conc. in T., Cons. an. 1 P. Boyle, Terentius J., Doc. med. gram. et math. an. 15 mag., Conf. alumn., Conc. in T. P. Fleming, Ricardus A., Praef. stud. et lect. ad mens., Cat. alumn., Conc. in T., Mod. faed. SS. Cord. alumn., Exam. candid., Cons. an. 3 P. Hammer, Dominicus E., Doc. sup. gram. et math. an. 14 mag., Praes. coll. cas. consc., Praef. bibl. dom., Conf. NN. et alumn., Cons. an. 2 P. Kelleher, Joannes B., Oper., Mod. faed. SS. Cord., Instr. conv., Conf. NN., alumn. et in T., Conc. in T. P. Lamb, Franciscus J., Praef. spir., Adm., Expl. pp. et cat FF., Coll. pp. litt. an. et script. hist. dom., Conf. NN., alumn. et in T., Exam. candid. P. McGehee, Junius A., Doc. inf. gram. ord. infer. et math. an. 7 mag. P. Murphy, Thomas E., Praef. eccl., Oper., Mod. confr. SS Nominis, schol. domin., soc. S. V. P. et soc. sanct., Conf. NN., alumn. et in T., Conc. in T., Exam. candid., Cons. an. 10 P. Oates, Alfredus B., Praef. disc., Mod. sod. B. V. M. alumn., Cat. alumn., Mod. soc. athlet., Conc. in T. P. Robinson, Carolus J., Doc. inf. gram. ord. infer. et math. an. 6 mag., Conf. alumn., Conc. in 1"
    },
    {
        "text": "P. Skelly, Oliverius B., Doc. inf. gram. ord. super. an. 6 mag., Cat. alumn., Conc. in T., Mod. sod. B. V. M. alumn. Brennan, Jacobus L., Doc. med. gram. et ling. hisp., Mag caer., Mod. soc. S. Joan. Berch., Adj. praef., An. 2 Higgins, Patritius J., Doc. inf. gram. ord. super. et math., Mod. soc. disp. jun., Cust. sac. dom., Adj. praef., An. 2 McAree, Josephus F., Doc. phys. et math., Adj. praef., An. 4 Nugent, Jacobus D., Doc. sup. gram. et ling. hisp., Adj. mod. soc. athlet., Adj. praef., Bid., An. 4 Ruppel, Franciscus J., Doc. inf. gram. ord. super., Praef. bibl alumn., Adj. praef., An. 4 Sullivan, Eduardus M., Doc. inf. gram. ord. infer. et ling. gall., Adj. praef., An. 2 COADJUTORES Barreca, Rosarius C., Ad dom., Vis. med. et noct., Excit. Fieth, Henricus L., Cust. tricl., vest. et cell. vin., Vis. exam Marley, Jacobus, Aedit. Sac. 12 Schol. 6 Coadj. 3 Univ. 21"
    },
    {
        "text": "COLLEGIUM BUFFALENSE B. PETRI CANISII CANISIUS COLLEGE, MAIN AND JEFFERSON STS., BUFPALO, N. Y. P. Michael J. Ahern, Rect. a die 6 En. 1919, Mod. sod. B. V. M. alumn. vet., Lect. geol., astron. et in curs. ext., Cust. mus., Exam. synod. diaec. Buffal., Conc. in T., Exam. candid. P. Hermannus J. Adelman, Min., Praef. val., Doc. evid. rel. Conf. alumn., Conc. in T., Exam. candid., Cons. an. 1 P. Cronin, David C., Doc. hum. et curs. elect. an. 10 mag., Lect. ling. angl. in curs. ext., Mod. soc. disp., Conc. in T. P. Cunningham, Gualterus F., Lect. log., metaph. gen., cosmol et log. in curs. ext., Mod. faed. SS. Cord. alumn., Conc. in T. P. Farrell, Eduardus T., Lect. eth., metaph. spec. et psych. in curs. ext., Mod. sod. B. V. M. alumn., Conf. alumn., Conc. in T. P. Leary, Jacobus F., Proc., Conf. alumn., Cons. an. 3 P. McGarvey, Henricus A., Doc. hum. an. 14 mag., Lect ling. lat. in curs. ext., Red. CANISIUS MONTHLY, Praef. bibl. dom., Conf. NN. et alumn., Conc. in T. P. Murphy, Audoenus S., Praef. disc., Submin., Doc. evid. rel., Mod. athlet., Conf. NN., Conc. in T. P. O'Mailia, Milesius J., Praef. stud., Lect. phil. in curs. scient., paedag. et sociol. in curs. ext., Praef. lect. ad mens., Conc. in T., Exam. candid., Cons. an. 5 P. Schweitzer, Petrus J., Lect. hist. et hist. phil. et in curs. ext., Praes. coll. cas. consc., Coll. pp. litt. an. et script. hist. dom., Conf. NN. et alumn., Conc. in T."
    },
    {
        "text": "P. Sindele, Franciscus X., Praef. spir., Adm., Doc. rhet. an. 24 mag. et ling. angl. in curs. ext., Cur. ger. nosoc., Conf. NN., Conc. in T., Exam. candid., Cons. an. 2 Busam, Josephus F., Lect. biol., Praef. bibl. alumn., Adj. praef. An. 4 Judge, Gualterus L., Cur. val. extra dom. Kelsch, Aloisius J., Doc. hum., Mod. music., Vis. med., Adj. praef., An. 4 Kolkmeyer, Emeranus J., Lect. phys et mech., Vis. exam., Adj. praef., An. 4 COADJUTORES Biazzo, Augustinus, Aedit., Cust. cell. vin., Adi. cust. tricl., Excit. McHugh, Michael, Cust. tricl., Ad dom. Sac. 11 Schol. 4 Coadj. 2 Univ. 17"
    },
    {
        "text": "SCHOLA ALTA BUFFALENSIS B. PETRI CANISD CANISIUS HIGH SCHOOL, 651 WASHINGTON ST., BUFFALO, N. Y. P. Robertus H. Johnson, Sup. a die 20 Jul. 1919, Praef. eccl. Mod. faed. SS. Cord., Conf. et conc. in T., Exam. candid. P. Bernardus A. Fuller, Min., Praef. val., Oper., Mod. schol. paroch. et sod. S. Agnet., S. Stanisl. et S. Joan. Berch., Cat. alumn., Conf. alumn. et in T., Exam. candid., Cons. an. 2 P. Bernard, Joannes J., Proc., Submin., Oper., Conf. alumn. et in T., Conc. in T., Cons. an1 P. Bonvin, Ludovicus, Oper., Cap. alumn., Conf. NN., alumn. et in T. P. Bunse, Fridericus J., Doc. inf. gram. ord. infer., ling. germ. et cat. alumn. an. 21 mag., Praef. spir., Adm., Coll. pp. litt. an. et script. hist. dom., Praes. coll. cas. consc., Conf. NN., alumn. et in T., Conc. in T., Exam. candid P. Clark, Michael A., Praef. stud. et lect. ad mens., Conf. et sonc. in T., Exam. candid., Cons. an. 3 P. Harmon, Jacobus A., Doc. inf. gram. ord. super. et cat. alumn. an. 6 mag., Adj. mod. athlet., Conf. alumn. et in T., Conc. in T. P. Huefner, Josephus A., Doc. inf. gram. ord. infer. et cat. ilumn. an. 8 mag., Mod. faed. SS. Cord. alumn., Conf. alumn. et in T., Conc. in T. P. Jutz, Joannes, Oper., Conf. NN. P. Leonard, Petrus W., Oper., Mod. sod. B. V. M. vir., matr. et confr. bon. mort., Conf. alumn. et in T., Conc. in T., Cons. an. 2"
    },
    {
        "text": "P. Maguire, Jacobus I., Oper., Mod. confr. SS. Nominis, Boy Scouts et sod. B. V. M. virg., Conf. NN., alumn. et in T., Conc. in T. P. Monahan, Joannes J., Praef. disc., Mod. soc. athlet., Cur. jer. taber. alumn., Mod. sod. E. V. M. puer. in eccl., Vis. carc., Conf. et conc. in T. Barry, Joannes F., Doc. sup. gram. et ling. hisp., Mod. soc disp. Behrens, Adj. praef., An. 2 Carey, Gulielmus A., Doc. med. gram., ling. hisp. et elec., Red. ARENA, Adj. praef., An. 3 Creed, Daniel A., Doc. sup. gram., ling gall. et eloc., Mod. soc. music., Praef. bibl. alumn., Adj. praef., An. 3 Feeney, Leonardus E., Doc. med. gram., ling. gall. et eloc. Mod. soc. dram., Adj. praef., An. 1 Kehoe, Joannes J., Doc. inf. gram. ord. infer. et eloc., Cust sac. alumn., Adj. praef., An. 1 Lennon, Josephus A., Doc. inf. gram. ord. infer. et eloc., Praef. bibl. dom., Adj. praef., An. 1 McCauley, David V., Doc. med. gram. et math., bibliop., Adj. praef., An. 2 McDermott, Jacobus J., Doc. sup. gram., ling. gall. et eloc., Mod. sod. B. V. M. alumn. sen., Bid., Adj. praef., An. 4 Torpy, Petrus J., Doc. inf. gram. ord. super. et eloc., Mod. sod. B. V. M. alumn. jun., Adj. praef., An. 2 COADJUTORES Geber, Joannes B., Aedit., Sart., Cust. vest., Adj. jan. Hermann, Georgius, Coq., Empt Sandheinrich, Georgius, Jan., Vis. noct., mat., med. et exam Schneider, Philippus, Cust. sac. dom., Infirm., Ad dom. Stamen, Josephus, Arcul., Ad dom. Sac. 12 Schol. 9 Coadj. 5 Univ. 26"
    },
    {
        "text": "RESIDENTIA BUFFALENSIS S. Annae ST. ANN'S RECTORY, 371 WATSON ST., BUFFALO, N. Y. P. Bernardus C. Cohausz, Sup. a die 21 Jul. 1921, Praef. eccl., Mod. sod. B. V. M. matr. et caet. vir., schol. paroch., prop. fid., confr. bon. mort., faed. SS. Cord., Red. ANNA BoTE, Cat., Conf. et conc. in T. P. Gustavus A. Reinsch, Min., Praef. val., Oper., Mod. sod. B. V. M. juv. et soc. S. V. P., schol. domin., confr. SS. Nominis juv., Cat., Conf. et conc. in T., Cons. an. 11 P. Faber, Josephus, Oper., Praef. spir., Adm., Mod. sod. B. V. M. puer. et soc. S. Annae, Cat., Expl. pp. FF. Conf. et conc. in T., Cons. an. 3 P. Maeckel, Hermannus J., Oper., Submin., Praes. coll. cas. consc., Mod. sod. B. V. M. vir. et coet. oper., confr. SS. Nominis vir., Cat., Conf. NN. et in T., Conc. in T., Cons. an. 1 P. Marchl, Franciscus, Oper., Mod. sod. B. V. M. virg. et puell., Coll. pp. litt. an. et script. hist. dom., Cat., Conf. NN. et in T., Conc. in T. P. Wolff, Henricus, Oper., Proc., Praef. bibl. dom., Mod. soc. Joan. Berch., Conf. et conc. in T. COADJUTORES Kiel, Rudolphus, Jan., Infirm., Sart., Cust. sac. dom., Adj. proc. Metzger, Georgius, Aedit., Cust. tricl. et vest., Ad dom. Sac. 6 Coadj. 2 Univ. 8"
    },
    {
        "text": "RESIDENTIA CHAPTICONENSIS B. M. Virginis Lauretanae RECTORY OF OUR LADY OF LORETTO, CHAPTICO, MARYLAND P. Carolus F. Bridges, Sup. a die 30 Dec. 1919, Oper., Mod faed. SS. Cord., sod. B. V. M. alb. et nigrit., schol. domin., Coll. pp. litt. an. et script. hist. dom. P. Bolster, Joannes J., Oper., Excurr. ad SS. Cord. Bush wood et SS. Angel. Abelb, Mod. faed. SS. Cord., sod. B. V. M. alb. et nigrit., schol. domin., Conf. NN P. Butler, Joannes D., Proc., Oper., Excurr. ad S. Joseph Morganza , Mod. faed. SS. Cord., sod. B. V. M. alb. et nigrit., schol. domin. et equit. S. Joseph., Conf. NN., Cons. an. 6 P. Hogan, Michael, Oper., Excurr. ad Immac. Concep. Me chanicsville , Mod. faed. SS. Cord., sod. B. V. M. alb et nigrit. et schol. domin., Conf. NN., Cons. an. 2 Sac. 4 Univ. 4"
    },
    {
        "text": "COLLEGIUM CAESARIENSE SANCTI PETRI ST. PETER'S COLLEGE, 144 GRAND ST., JERSEY CITY, N. J. P. Thomas F. Graham, Rect. a die 7 Jul. 1021, Dir. apost. orat. diaec. Novarc., Mod. confr. SS. Nominis, Conf. et conc. in T., Exam. candid. P. Joannes J. Cassidy, Min., Proc., Praef. eccl. et odei, Mod. sod. B. V. M. virg., Red. CHURCH BULLETIN, Conf. alumn. et in T., Conc. in T., Exam. candid., Cons. an. 1 P. Collins, Patritius M., Praef. disc. in Aula Manr., Coll. pp. litt. an. et. script. hist. dom., Conf. NN., Cat. alumn., Conc. in T., Cons. an. P. Cotter, Jacobus M., Oper., Mod. sod. B. V. M. vir. et faed. SS. Cord., Instr. conv., Conf. alumn. et in T., Conc. in T. P. Fitzpatrick, Joannes F., Oper., Conf. alumn. et in T., Conc. in T. P. Fitzpatrick, Michael F., Praef. stud. et lect. ad mens., Mod. faed. SS. Cord. alumn., Cat. alumn., Conf. et conc. in T., Exam. candid., Cons. an. 1 P. Gartland, Thomas J., Oper., Mod. schol. paroch. et schol. domin., soc. prop. fid. et soc. S. V. P., Conf. NN. alumn. et in T., Conc. in T., Cons. an. 4 P. Kayser, Petrus, Praef. spir., Adm., Oper., Praes. coll. cas consc., Praef. bibl. dom., Mod. confr. bon. mort., Cat fam., Expl. pp. et cat. FF., Conf. NN. et in T., Conc. in T. P. Kiehne, Gregorius G., Doc. phys. et math., Submin., Mod coet. S. Petri, Conf. NN., Conc. in T., Exam. candid."
    },
    {
        "text": "P. McDonald, Georgius G., Praef. disc., Cat. alumn., Conc. in T. Conroy, Jacobus G., Doc. inf. gram. ord. super., Mod. soc disp. jun., Adj. praef., Bid., An. 3 Garner, Franciscus E., Doc. sup. gram. et ling. hisp., Praef bibl. alumn., Adj. praef., An. 2 Gilleran, Leo J., Doc. med. gram., math. et ling. gall., Mod soc. dram. alumn. et soc. music. instrum., Adj. praef., An. 1 Hewitt, Robertus A., Doc. sup. gram, math. et ling. gall., Mod. soc. disp. Beaudevin et ephem. alumn., Adj. praef., An. 1 McCarl, Jacobus A., Doc. med. gram., Mod. soc. S. Joan. Berch., Adj. praef., An. 1 Moran, David J., Doc. inf. gram. ord. infer. et math., Mod soc. disp. jun., Adj. praef., An. 1 O'Neil, Henricus V., Doc. inf. gram. ord. super., Mod. soc athlet., Adj. praef., An. 2 COADJUTORES Alekszunas, Adolphus, Cust. tricl. Power, Stephanus, Cust. vest., Ad dom., Vis. noct., mat. et exam. Reilly, Hugo, Aedit. Sac. 10 Schol. 7 Coadj. 3 Univ. 20"
    },
    {
        "text": "COLLEGIUM FORDHAMENSE ET CONVICTUS SANCTI JOANNIS FORDHAM UNIVERSITY, FORDHAM, NEW YORK, N. Y. P. Eduardus P. Tivnan, Rect. a die 6 Jan. 1919, Conc. alumn. Exam. candid. P. Franciscus J. Driscoll, Min., Praef. val. NN., Cons. an. 1 P. Bertolero, Cajetanus, Doc. ling. hisp., Submin., Adj. proc., Cur. ger. vend. libr. alumn., Conf. NN. et alumn. P. Burke, Edmundus J., Lect. aecon. polit. in coll. et in schol. sociol., Lect. biol. in schol. grad. P. Caballero, Gustavus, Lect. biol. et ling. hisp., Conf. NN. P. Collins, Joannes J., Praef. spir., Adm., Cat. FF. et fam., Conf. NN., Exam. candid. P. Cormican, Patritius J., Lect. litt. in schol. grad., Coll. pp. litt. an. et script. hist. dom. P. Cox, Ignatius W., Lect. log, metaph. gen. et cosmol. in schol. phil. et ontol. in schol. grad., Praef. cub. P. Deane, Carolus J., Lect. hist. in schol. phil. et in schol. grad. P. Debold, Philippus J., Doc. inf. gram. ord infer. et hist. an. 12 mag., Conf. et cat. alumn., Adj. praef. alumn. P. Dolan, Gulielmus S. F., Praef. stud. in schol. alt., Cat alumn. P. Dore, Franciscus J., Reg. schol. sociol. et pharm., Conf. alumn. P. Fasy, Joannes H., Lect. eth. in schol. phil. et in schol. grad., Praes. coll. cas. consc., Cat. alumn P. Francis, Georgius A., Stud. priv. chim."
    },
    {
        "text": "P. Fremgen, Augustus M., Doc. hum., lin. germ. an. 13 mag., Red. FORDHAM MONTHLY, Mod. music P. Gaynor, Hugo A., Doc. hum., ling. gal. an. 14 mag., Mod sod. B. V. M., Conc. alumn. P. Hargadon, Leo I., Doc. math., Cat. alumn., Praef. bibl. dom., Conf. alumn. P. Hart, Joannes C., Praef. spir. alumn., Cat. et conc. alumn. P. Jessup, Michael, Praef. stud., Exam. candid., Conc. an. 2 P. Keating, Josephus T., Proc., Conf. et conc. alumn., Cons. an. 12 P. Le Buffe, Franciscus P., Reg. schol. jurisprud., Lect. eth. in schol. jurisprud., eth. et psych in schol. grad., Conf alumn. P. Mahony, Michael J., Lect. log, metaph. gen., cosmol. in schol. phil., log. et hist. phil. in schol. grad., Praef. lect. ad mens., Conf. NN. et alumn., Conc. alumn. P. Murphy, Josephus A., Lect. metaph. spec. in schol. phil. psych. et nat. theol. in schol. grad., Doc. evid. rel., Conc. alumn. P. Oates, Petrus A., Doc. rhet. et evid. rel. an. 17 mag., Lect. in schol. sociol. et grad., Mod. faed. SS. Cord. alumn. Conf. alumn. P. O'Laughlin, Franciscus D., Lect. phys., Mod. sod. B. V. M., Conf. NN., Cons. an. 10 P. Ranken, Ricardus R., Reg. schol. grad. P. Robb, Samuel J., Praef. disc., Exam. candid. P. Stedler, Joannes A., Doc. rhet. et evid. rel. an. 17 mag., Conf. et conc. alumn. P. Treacy, Geraldus C., Doc. rhet. et evid. rel. an. 9 mag., Collab. ephem. AMERICA, Conc. alumn. Collins, Joannes H., Doc. med. gram., Red. RAMKIN, Praef. cub., Bid., An. 4 Duff, Jacobus M., Doc. inf. gram. ord. super. et math., Mod. sod. B. V. M., Praef. cub., An. 3"
    },
    {
        "text": "Farley, Theodorus T., Doc. inf. gram. ord. super., Mod. sod. B. V. M., An. 1 Gannon, Robertus I., Doc. hum., Praef. cub., Mod. soc. dram., An. 3 Lynch, Joannes J., Lect. phys. et math., Praef. cub., Dir. observ. seismol., Praef. cub., An. 2 Martin, Hayne R., Doc. sup. gram., Mod. soc. disp. jun., An. 2 McGarry, Gulielmus J., Lect. astron, math., ling. gall. et phil. element. in schol. premed., Praef. cub., An. 4 McNally, Paulus A., Doc. math., Mod. soc. disp. sen., An. 7 Muenzen, Josephus B., Stud. priv. chim., An. 1. Phelan, Timotheus J., Doc. med. gram. et meth., Mag. caer., Mod. soc. S. Joan. Berch., Praef. cub., An. 3 Pouthier, Eduardus S., Doc. biol. et hist. in schol. alt., Praef. bibl. alumn. et cub., Mod. soc. music. instrum., An 4 Shea, Arthurus V., Praef. disc. in schol. alt., Doc. hist. in schol. alt., An. 2 Shea, Bernardus V., Doc. inf. gram. ord. super., Mod. sod. B. V. M., Praef. cub., An. 1 Shiple, Georgius J., Stud. priv. chim., An. 4 Walsh, Jacobus A., Doc. sup. gram., An. 1 COADJUTORES Byrne, Matthaeus J., Cust. sac. dom. et cell. vin Cadigan, Jacobus P., Cust. tricl. NN. et sac. alumn. Lawton, Gulielmus F., Jan., Cus. sac. sod. Luddy, Gulielmus J., Ad dom guinn, Joannes H., Cust. tricl. alumn., Vis. med. et exam Sullivan, Daniel F., Empt., Excit. Sac. 29 Schol. 15 Coadj. 6 Univ. 50"
    },
    {
        "text": "COLLEGIUM GEORGIOPOLITANUM ET CONVICTUS GEORGETOWN COLLEGE, WASHINGTON, D. C. P. Joannes B. Creeden, Rect. a die 1 Mai. 1918, Conc. in sac., Exam. candid., Cons. Prov P. Eduardus S. Brock, Min., Praef. val. NN., Dir. George town Union, Exam. candid., Cons. an. 3 P. Archer, Petrus, Dir. Spec. astron., Lect. calc. et astron. in schol. phil. et grad., Conf. alumn P. Barnum, Franciscus, Cust. archiv. hist. Maryland, Praef. spir. alumn., Conf. NN P. Brosnan, Aloisius P., Conf. NN. et alumn., Praef. spir alumn., Script P. Burkett, Philippus H., Lect. sociol., Praef. bibl. dom. P. Cowardin, Gulielmus R., Conf. NN. et alumn. P. Donovan, Franciscus R., Proc., Conf. alumn., Cons. an. 2 P. Doyle, Franciscus X., Doc. hum. an. 6 mag., Lect. phil. in schol. premed., Mod. faed. SS. Cord., Red. JOURNAL, Conc. in sac., Praef. cub. P. Gasson, Thomas I., Lect. phil., evid. rel. et aecon. polit. in schol. grad. et ling. angl. in schol. phil. et jurisprud. in schol. jur., Mod. soc. S. V. P. alumn., Conf. NN. et alumn., Conc. in sac., Exam. candid., Cons. an. 4 P. Gipprich, Joannes L., Lect. phys. et mech., Doc. math. Mod. sod. B. V. M., Praef. cub., Adj. praef. alumn. P. Hill, Audoenus A., Praef. spir., Adm., Lect. eth. et evid. rel. in schol. phil. et med., Expl. pp. FF., Conc. in sac. P. McDonough, Vincentius S., Praef. disc. et val. alumn., Doc. eloc., Mod. soc. athlet. P. Meagher, Joannes P., Lect. metaph. spec. et aecon. polit et evid. rel. in schol. premed., Conc. in sac. P. Miley, Thomas H., Lect. phys. in schol. dental. et mech. in schol. rhet., Doc. math. in schol. hum., Lect. evid rel. in schol. rhet., Praes. coll. cas. consc."
    },
    {
        "text": "P. Murphy, Joannes F. X., Lect. evid. rel. et hist. in schol. phil. et rhet. et hum. et polit. scien. in schol. scient., Adj. praef. alumn., Praef. cub., Conf. alumn., Conc. in sac. P. Nevils, Gulielmus C., Praef. stud., Mod. schol. Foreign Service, Examin. candid., Cons. an. 3 P. O'Leary, Arthurus A., Cur. val. P. Plante, Joannes B., Doc. ling. gall. P. Shandelle, Henricus J., Coll. pp. litt. an. et script. hist. dom., Conf. NN. P. Shyne, Cornelius A., Conf. NN. et alumn., Conc. in sac., Cat. alumi P. Storck, Gulielmus A., Submin., Adj. praef. stud. in schol. praep., Conc. in sac., Mod. soc. S. Joan. Berch. P. Tondorf, Franciscus A., Lect. physiol. et biol., Cust. mus., Dir. observ. seismol. P. Toohey, Joannes J., Lect. log. et metaph. gen. et evid. rel. Doc. ling. germ., Mod. soc. philodem., Praef. lect. ad mens. Brown, Thomas J., Lect. chem., Doc. trig. et anal. geom., Adj. praef. disc., Praef. cub., An. 2 Grattan, Joannes E., Doc. rhet., Mod. soc. S. Joan. Berch., Praef. cub., Adj. praef. disc., An. 3 Guenther, Antonius M., Doc. rhet. et ling. germ., Mod. soc Gaston, Praef. cub., Adj. praef. disc., An. 4 Hoar, Gulielmus J., Doc. inf. gram. ord. super., Mod. soc. Philaleth., Praef. cub., Adj. praef. disc., An. 3 Leeming, Bernardus A., Doc. rhet., ling. gall. et geom. plan et sol., Praef. cub., Adj. praef. disc., An. 4 Lloyd, Robertus S., Doc. med. gram., Praef. cub., Red. NEW PREP NEWs, Adj. praef. disc., An. 4"
    },
    {
        "text": "Madden, Joannes A., Doc. inf. gram. ord. infer., Praef. cub., Adj. praef. disc., An. McCarron, Hugo M., Doc. hum. et ling. hisp., Mod. soc Philonom., Red. HoyA, Praef. cub., Adj. praef. disc., An. 4 O'Brien, Josephus T., Doc. sup. gram. et ling. angl. in schol hum. et rhet., Adj. praef. bibl., Mod. soc. White, Adj praef. disc., Praef. cub., An. 3 Reith, Josephus, Lect. phys., Doc. trig. et anal. geom. et ling germ., Praef. cub., Adj. praef. disc., An. 3 Waldron, Joannes A., Doc. rhet. et ling. gall., Adj. red. JOUR NAL, Praef. cub., Adj. praef. disc., An. 3 COADJUTORES Alekszunas, Julius V., Cust. tricl. NN. et sac. dom. Crough, Jeremias J., Mod. fam., Bid. Golden, Virgilius L., Fab. lign. Harrington, Jacobus, Villic., Cust. calor., Excit., Vis. mat. Lang, Fridericus, Empt., GEcon., Cust. vest. alumn. et sac S. Annae McCloskey, Jacobus, Hortul., Cust. sac. S. Alphonsi Ramage, Carolus J., Cust. spec. astron., observ. seismol. et lum. elect., Vis. noct., Cust. sac. S. Joan. Berch. Slicer, Jacobus, Cust. cell. vin. et sac. Dahlgren Traynor, Patritius, Cust. vest. et sac. S. Ignatii, Vis. med. et exam. Sac. 24 Schol. 11 Coadj. 9 Univ. 44"
    },
    {
        "text": "RESIDENTIA GEORGIOPOLITANA SS. Trinitatis HOLY TRINITY CHURCH, 3514 O STREET, N. W. WASHINGTON, D. C. P. Joannes C. Geale, Sup. a die 27 Feb. 1919, Proc., Cur. ger. paroch., Mod. soc. ad sust. schol. paroch., Coll pp. litt. an. et script. hist. dom., Mod. soc. S. V. P. Conf. et conc. in T. P. Dixon, Joannes A., Oper., Mod. sod. B. V. M. Fil. Mar., soc. S. Joan. Berch., coet. Trinity et soc. dram., Conf et conc. in T. P. Hennessy, Carolus J., Oper., Mod. sod. B. V. M. vir. et matr., puer. et puell. in schol. paroch., Red. CHURCH BULLETIN, Praef. bibl. dom., Conf. et conc. in T., Cons. an. 1 P. Magrath, Eduardus J., Oper., Mod. schol. domin., confr. SS. Nominis vir. et puer., Instr. conv., Conf. NN. et in T., Cons. an. 7 P. Weber, Ludovicus S., Oper., Praef. spir., Mod. faed. SS. Cord., Conf. NN. et in T., Conc. in T., Cons. an. 2 Sac. 5 Univ. 5"
    },
    {
        "text": "RESIDENTIA LEONARDOPOLITANA S. Aloisii ST. ALOYSIUS' RECTORY, LEONARDTOWN, MARYLANT P. Joannes W. Casey, Sup. a die 22 Feb. 1920, Proc., Oper. Mod. sod. B. V. M. et SS. Angel. alb. et nigrit. P. Fleming Joannes J., Oper., Excurr. ad Our Lady's Chapel Medley's Neck , Mod. faed. SS. Cord., sod. B. V. M. alb. et nigrit. et confr. SS. Nominis, Conf. NN., Cons an. 1 P. Moakley, Jacobus I., Oper., Mod. faed. SS. Cord., schol domin., confr. SS. Nominis alb. et nigrit., soc. sanct. et dram., Conf. NN. et in xenod., Cons. an. 1 P. O'Connor, Jacobus J., Oper., Praef. spir., Adm., Excurr. ad S. Joan. Hollywood et S. Mariae California , Mod faed. SS. Cord., sod. B. V. M. alb. et nigrit., confr. SS. Nominis, soc. sanct. et dram., Conf. NN., Cons. an. 1 P. Weis, Alphonsus, Oper., Excurr. ad S. Fr. Xav. New town , Mod. faed. SS. Cord., sod. B. V. M. alb. et nigrit., confr. SS. Nominis, Coll pp. litt. an. et script. hist. dom., Praef. bibl. Sac. 5 Univ. 5"
    },
    {
        "text": "COLLEGIUM NEO EBORACENSE SANCTI FRANCISCI XAVERII COLLEGE OF ST. FRANCIS XAVIER, 30 WEST I6TH ST., NEW YORK, N. Y. P. Patritius J. Casey, Sup. a die 5 Sept. 1919, Conf. et conc. in T., Exam. candid. P. Hermannus I. Storck, Min., Praef. val., Mod. soc. purg., Conf. alumn. et in T., Exam. candid., Cons. an. 2 P. Bielecki, Victor, Adj. red. nuntii Pol. SS. Cord P. Campbell, Thomas J., Script., Coll. pp. litt. an. et script. hist. dom., Conf. NN et alumn., Conc. in T. P. Casey, Patritius H., Oper., Praes. coll. cas. consc., Red CHURCH BULLETIN, Mod. soc. S. V. P. et soc. sanct., Conf. NN., alumn. et in T., Conc. in T., Exam. sac jun. P. Dalton, Hugo A., Doc. inf. gram. ord. infer. an. 7 mag., Cur. ger. surd. et mut., Conc. in T. P. Donlon, Alphonsus J., Oper., Mod. faed. SS. Cord., Conf. alumn. et in T., Conc. in T. P. Gallagher, Ludovicus J., Praef. stud., Exam. candid., Cons. an. I P. Gillespie, Jacobus A., Oper., Mod. confr. SS. Rosar., Conf. NN., alumn. et in T., Conc. in T. P. Harmon, Joannes C., Praef. eccl., Mod. sod. B. V. M. matr., virg., confr. SS. Nominis, schol. paroch. et domin., soc. XAVIER GUILD, Conf. alumn. et in T., Conc. in T., Cons. an. 9 P. Jungck, Joannes B., Oper., Mod. music., Doc. ling. gall., Conf. NN., alumn. et in T., Exam. candid. P. Lenahan, Franciscus J., In Ins. Ward Oper."
    },
    {
        "text": "P. McCartney, Gulielmus A., Adj. praef. stud. et disc. in curs gram., Cat. alumn., Mod. soc. inf. Jesu, Conc. in T. P. McGivney, Jacobus A., Proc. et admin. bon. Prov., Cust. archiv., Dir. miss., Trad. exer. spir. P. McNally, Joannes F., Praef. disc., Cat. alumn., Mod. soc. athlet., Conc. in T. P. McNiff, Franciscus J., Praef. spir., Adm., Adj. red. MES SENGER OF THE SACRED HEART, Praef. lect. ad mens., Cat. fam., Expl. pp. et cat. FF., Conf. NN P. Morgan, Joannes A., Oper., Mod. sod. B. V. M. vir., soc prop. fid. et confr. bon. mort., Conf. alumn. et in T., Conc. in T. P. Mulligan, Joannes H., In Ins. Randall Oper. P. Neary, Joannes J., Proc., Submin., Praef. bibl. paroch., Conf. alumn. et in T., Conc. in T., Cons. an. 1 P. Pfeil, Aloisius, In nosoc. St. Anthony's Hospital, Wood haven, L. I. Oper. P. Portas, Franciscus X., Doc. ling. hisp. P. Quinn, Daniel J., Adj. dir. dom. exercit. Mt. Manresa, Conc. in T., Oper., Conf. NN. P. Raines, Attilius H., Doc. med. gram. an. 9 mag., Mod. sod B. V. M. alumn. sen., Cat. alumn., Conf. alumn. et in T., Conc. in T. P. Sullivan, Gulielmus F. X., Doc. inf. gram. ord. infer. an. 16 mag., Cat. alumn., Praef. bibl. dom. P. Warol, Aloisius, Red. nuntii Pol. SS. Cord P. Wynne, Joannes J., Mod. sod. B. V. M. alumn. vet., Red. CATHOLIC ENCYCLOPEDIA Donahue, Forrest S., Doc. sup. gram., Praef. adei, Adj. praef. alumn., An. 1"
    },
    {
        "text": "Fay, Thomas August., Doc. phys., chim. et math., Adj. praef. alumn., Bid., An. 4 Haitz, Josephus F., Doc. inf. gram. ord. super., Mod. sod B. V. M. alumn. jun., Adj. praef. alumn., An. 2 Kelley, Gulielmus G., Doc. sup. gram., Mod. soc. dram., Adj. praef. alumn., An. 4 McManus, Josephus E., Doc. sup. gram. et ling. gall., Mod. soc. disp. sen., Adj. praef. alumn., An. 1 Mulligan, Jacobus T., Doc. med. gram., Mod. faed. SS. Cord. alumn., Praef. bibl. alumn., An. 2 O'Hurley, Joannes F., Doc. med. gram. et math., Mod. soc. disp. jun., Adj. praef. alumn., An. 3 Sheridan, Robertus E., Doc. inf. gram. ord. super., Mag. caer. Mod. soc. S. Joan. Berch., Adj. praef. alumn., An. 1 JSmith, Georgius F., Doc. inf. gram. ord. infer., Adj. mod. soc athlet., Adj. praef. alumn., An. 1 COADJUTORES Ditman, Joannes, Cust. cell. vin. et sac. dom., Vis. med. et exam. Donlon, Patritius, Ad dom. Downey, Robertus F., Aedit., Adj. mod. soc. S. Joan. Berch., Vis. noct. Furlong, Ricardus F., Cust. tricl., Excit. Malecki, Paulus, Adj. proc. et red. nuntii Pol. SS. Cord. Sac. 26 Schol. 9 Coadj. 5 Univ. 40"
    },
    {
        "text": "SCHOLA LOYOLAEA NEO EBORACENSIS ET SCHOLA ALTA REGIS ST. IGNATIUS' RECTORY, 980 PARK AVE., NEW YORK, N. Y. P. Jacobus M. Kilroy, Rect. a die 25 Mar. 1919, Mod. soc. S. V. P. et sod. B. V. M. puell., Conf. et conc. in T., Exam. candid. P. Franciscus L. Reilly, Min., Praef. val. et eccl., Mod. sod., B. V. M. vir. et dom. parvul., Conf. et conc. in T., Cons an. 2 P. Corbett, Eduardus M., In Ins. Blackwell Oper. in nosoc. et carc P. Ennis, Gulielmus J., Oper., Mod. faed. SS. Cord. et Wood. stock A. A., Conf. NN. et in T., Conc. in T. P. Farley, Joannes H., Praef. stud. et disc. in Schola Loyolaea, Cat. alumn., Mod. sod. B. V. M. alumn. et faed. SS Cord., Coll. pp. litt. an. et script. hist. dom., Conf. et conc. in T., Exam. candid. P. Fox, Joannes W., Proc., Mod. schol. paroch., Cat. alumn. Red. CHURCH BULLETIN, Conf. in T., Cons. an. 11 P. Judge, Henricus A., In Ins. Blackwell Oper. in xenod et carc. P. Kenedy, Eugenius T., Oper., Mod. sod B. V. M. puer. et soc. prop. fid., Conf. et conc. in T. P. Lyons, Carolus W., Oper., Mod. confr. SS. Nominis et sod. B. V. M. virg., Conf. et conc. in T., Exhort. NN. Cons. an. 2 P. Mahoney, Jacobus B., Praef. stud. in Schola Regis, Cat. alumn., Praef. lect. ad mens., Conf. et conc. in T., Exam. candid., Cons. an. 2 P. Martin, Ricardus, Doc. chim. in Schola Regis, Conf. NN et in T. P. McCarthy, Franciscus T., Instr. conv., Praef. bibl., Lect. in schol. grad. Fordham"
    },
    {
        "text": "P. Murphy, Gulielmus K., Doc. med. gram. et biol. in Schola Regis an. 7 mag., Cat. alumn., Conf. et conc. in T. P. Murphy, Joannes J., Doc. sup. gram. in Schola Regis an. 8 mag., Cat. alumn., Conf. et conc. in 1 P. Powers, Franciscus P., Oper., Praef. odei, Mod. confr. SS. Rosar., soc. sanct. et bibl. paroch., Conf. NN. et in T., Conc. in T. P. Quin, Georgius E., Praef. spir., Adm., Oper., Mod. schol. domin., confr. bon. mort. et soc. ad sustent. schol. paroch., Expl. pp. et cat. FF., Conf. NN. et in T., Conc. in T. P. Reilly, Thomas J., Praef. disc. in Schola Regis, Mod soc. athlet., Cat. alumn., Excurr. ad Ins. Blackwell, Conf. et conc. in T., Exam. candid. P. Spillane, Eduardus P., Oper., Praes. coll. cas. consc., Mod sod. B. V. M. matr., Conf. in T., Conc. in T. P. Wall, Georgius W., In Ins. Blackwell Oper. in nosoc. et carc. Bean, Henricus E., Doc. med. gram., biol. et ling. gall. in Schola Regis, Mod. soc. disp. Regis, An. 1 Boudreau, Rudolphus A., Doc. inf. gram. ord. super. et ling gall. in Schola Regis, Mod. soc. dram., An. 1 Donovan, Fridericus J., Doc. inf. gram. ord. super. et ling. gall. in Schola Regis, Mag. caer., Mod. soc. S. Joan. Berch. et music. instrum., An. 3 Dougherty, Franciscus X., Doc. med. gram. et biol. in Schola Regis, Mod. faed. SS. Cord., soc. SS. Sacramen., Praef. bibl. alumn., An. 3 Herlihy, Cornelius A., Doc. inf. gram. ord. infer. in Schola Regis, Adj. mod. athlet., An. 2 Mulcahy, Stephanus A., Doc. med. gram. et ling. gall. in Schola Loyol., Mod. soc. dram., Red. LOYOLA, An. 1"
    },
    {
        "text": "O'Keefe, Jeremias F., Doc. inf. gram. ord. infer. in Schola Loyol., Mod. sod. B. V. M. jun. et soc. S. Joan. Berch. An. 1 Peirce, Franciscus X., Doc. sup. gram. et ling. hisp. in Scholc Regis, Mod. soc. inf. Jesu, Red. REGIS, An. 2 Reed, Joannes J., Doc. inf. gram. ord. infer. in Schola Regis, Mod. soc. W. A., Vis. med. et exam, An. 1 Reilly, J. Josephus, Doc. sup. gram. in Schola Loyol., Mod soc. disp. Onaz, Praef. bibl. alumn., An. 3 Rice, Gulielmus W., Doc. sup. gram. et ling. hisp. in Schola Regis, Mod. sod. B. V. M. sen., Adj. red. REGiS, Bid., An. 4 Setter, Joannes G., Doc. med. gram. et ling. hisp. in Schola Regis, Mod. soc. disp. Chrysostom, An. 1 Walsh, Laurentius A., Doc. inf. gram. ord. super. in Schola Loyol., Mod. sod. B. V. M. sen. et soc. athlet., Vis. med. et exam., An. 2 Wieckmann, Josephus C., Doc. inf. gram. ord. infer. in Schola Regis, Mod. sod. B. V. M. jun., Cust. sac. alumn., An. 1 COADJUTORES Cavanaugh, Leo M., Aedit. in T., Excit., Ad dom. Lafferty, Thomas F., Empt., Praef. fam., Cust. cell. vin., Adj. aedit. Muldowney, Patritius J., Coq. et cust. tricl., Adj. empt., Excit. O'Hara, Thomas J., Cust. vest., Infirm., Cust. sac. dom., Vis. med. et exam., Ad dom. Sac. 19 Schol. 14 Coadj. 4 Univ. 37"
    },
    {
        "text": "DOMUS SCRIPTORUM NEO EBORACENSIS Campion House 39 WEST 8OTH ST., NEW YORK, N. Y. P. Ricardus H. Tierney, Sup. a die 31 Jul. 1917, Dir. ephem. AMERICA, Red. THE CATHOLIC MINE P. Franciscus A. Breen, Min., Proc., Praef. val., Cons. an. 2 P. Blakely, Paulus L., Script., Cens. libr., Conf. NN. P. Dwight, Gualterus, Script., Adj. red. THE CATHOLIC MIND Cens. libr., Conf. NN., Cons. an. 7 P. Fisher, Joannes H., Script., Praef. bibl., Cens. libr., Conf. NN., Exam. sac. jun P. Husslein, Josephus C., Script., Submin., Cens. libr., Conf. NN., Cons. an. 1 P. Reville, Joannes C., Script., Coll. pp. litt. an. et script. hist. dom., Cens. libr., Conf. NN., Cons. an. 7 P. Stadelman, Josephus M., Cur. ger. caec., Praef. spir., Adm., Praes. coll. cas. consc., Conf. NN. Sac. 8 Univ. 8"
    },
    {
        "text": "RESIDENTIA NEO EBORACENSIS Kohlmann Hall 801 WEST 181ST ST., NEW YORK, N. Y. P. Carolus J. Mullaly, Sup. a die 31 Jul. 1920, Proc., Dir apost. orat., Red. MESSENGER OF THE SACRED HEART et PILGRIM OF OUR LADY OF MARTYRS, Dir. Wood stock Aid Association, Cur. ger. sacel. B. V. M., Auries. ville, N. Y., Cens. libr., Trad. exer. spir., Exam. sac jun. P. Joannes Corbett, Min., Adj. dir. apost. orat., Adj. red MESSENGER OF THE SACRED HEART, Praes. coll. cas consc., Trad. exer. spir., Coll. pp. litt. an. et script. hist. dom., Cens. libr., Cons. an. 2 P. O'Rourke, Joannes H., Praef. spir., Adm., Trad. exer. spir., Conf. NN., Cons. an. 2 P. Shealy, Terentius J., Dir. dom. exercit. VMt. Manresar Dir. soc. vir. ad exer. spir. et stud. sociol. fov., Trad exer. spir., Cens. libr., Conf. NN. P. Stanton, Gulielmus J., Trad. exer. spir., Conf. NN. COADJUTOR Ramaz, Claudius, Adj. proc., Cur. ger. operar. et typogr. Sac. 5 Coadj. 1. Univ. 6"
    },
    {
        "text": "RESIDENTIA NEO EBORACENSIS SS. Nativitatis, pro Italis CHURCH OF THE NATIVITY, 44 SECOND AVENUE, NEW YORK, N. Y. P. Patritius F. Quinnan, Sup. a die 21 Jul. 1921, Proc., Cur. ger. paroch., Praef. eccl., Mod. sod. B. V. M. virg. sen., faed. SS. Cord., prop. fid., S. V. P., schol. domin. et coet. juv., Conf. et conc. in T. P. Dominicus A. Cirigliano, Min., Oper., Mod. sod. B. V. M. virg. jun., TBoy ScoUTs, S. Joan. Berch., confr. SS. Nominis pro Amer. et pro Ital., coet. juv., Conf. et conc. in T., Cons. an. 2 P. Longo, Henricus C., Oper., Mod. B. V. M. vir. et matr., Confr. SS. Rosar. et bon. mort., Coll. pp. litt. an. et script. hist. dom., Conf. NN. et in T., Conc. in T., Cons. an. 13 Sac. 3 Univ. 3"
    },
    {
        "text": "COLLEGIUM PHILADELPHIENSE SANCTI JOSEPHI ST. JOSEPH'S COLLEGE, EIGHTEENTH AND THOMPSON STS., PHILADELPHIA, PA. P. Albertus G. Brown, Rect. a die 1 Oct. 1921, Dir. apost orat. pro. archidoec. Philadelph., Mod. faed. SS. Cord., confr. SS. Nominis sen. et jun., soc. S. V. P. et ad sust. schol. paroch. et eccl., Conf. et conc. in T., Exam. candid. P. Benedictus J. Smith, Min., Praef. val., Mod. schol. paroch. et domin., sod. SS. Angel. puer. et puell., soc. music. et alumn. GESU, Adj. paroch., Conf. alumn. et in T., Conc. in T., Cons. an. 8 P. Byrnes, Franciscus X., Praef. stud., Lect. evid. rel., Conf. et conc. in T., Exam., candid., Cons. an. 1 P. Casey, Jacobus T., Exhort. NN., Conf. NN., alumn. et in T., Conc. in T. P. Didusch, Josephus S., Lect. biol. et chim. organ., Cust. mus., Mod. soc. CRIMSON AND GRAY, Conf. NN., alumn et in T. P. Egan, Joannes A., Doc. inf. gram. ord. super. an. 6 mag. Mod. soc. disp. BARBELIN, Cur. ger. paup. in dom. sor paup., Conf. et conc. in T. P. Fortier, Matthaeus L., Lect. eth., sociol. et evid. rel., Mod. sod. B. V. M. alumn. vet., Conf. et conc. in T. P. Guldner, Benedictus, Oper., Praes. coll. cas. consc., Coll pp. litt. an. et script. hist. dom., Conf. NN. et in T., Conc. in T. P. Keany, Bernardus, Oper., Mod. sod. B. V. M. matr. et Dorc., confr. bon. mort., Conf. NN., alumn. et in T. Conc. in T. P. McFadden, Gulielmus F., Miss. excurr."
    },
    {
        "text": "P. McLoughlin, Josephus J., Oper., Mod. sod. B. V. M. vir., Vis. carc., Conf. et conc. in T. P. Mullan, Elder, Praef. spir., Adm., Lect. metaph. spec., theol. et evid. rel., Mod. sod. B. V. M. alumn. coll. et schol. alt., virg. praecep. et faed. SS. Cord. alumn., Cat. FF., Conf. NN., alumn. et in T. P. O'Brien, Carolus L., Doc. inf. gram. ord. infer. an. 3 mag., Lect. evid. rel., Mod. sod. B. V. M. juv. et soc. disp. VILLIGER, Conf. alumn. et in T., Conc. in T. P. O'Connell, Raphael V., Oper., Praef. bibl. dom. et lect. ad mens., Instr. conv., Conf. NN., alumn. et in T., Conc. in T. P. O'Connor, Joannes J., Praef. disc., Cat. alumn., Mod. soc. athlet., Conf. et conc. in T. P. O'Gorman, Gulielmus J., Lect. log., metaph. gen., cosmol et evid. rel., Conf. et conc. in T., Exam. candid. P. Smith, Josephus H., Oper., Red. CHURCH BULLETIN, Conf. NN., alumn. et in T., Conc. in T. P. Taaffe, Jacobus A., Doc. rhet. et evid. rel. an. 20 mag., Red. CRIMSON AND GRAY, Mod. soc. dram., Conf. alumn. et in T. Conc. in T. P. Tracy, Robertus J., Proc., Submin., Mod. sod. B. V. M. nutr., soc. prop. fid. et sanct., Conf. alumn. et in T., Cons. an. 6 P. Tully, Thomas I., Doc. inf. gram. ord. infer. an 12 mag., Cat. alumn., Conf. alumn. et in T., Conc. in T. P. White, Henricus P., Oper., Vis. nosoc. Lankenan, Conf. alumn. et in T., Conc. in T. Butler, Thomas P., Lect. chim. gen. et anal. in Coll., Doc. trig et anal. geom., Doc. chim. gen. in schol. alt., Adj. praef. An. 3 Delaney, Joannes P., Lect. phys. et mech., astron. et geol., Adj. praef., An. 4"
    },
    {
        "text": "Fay, Thomas Aloisius, Doc. med. gram., Lect. hist. in Coll. Adj. praef. et adj. mod. athlet., An. 4 Frohnhoefer, Fridericus R., Doc. inf. gram. ord. infer., Adj. praef., An. 2 Heenan, Joannes J., Doc. hum., Adj. praef., An. 5 McNamee, Stephanus F., Doc. med. gram., Red. CHRONICLE Schol. Alt., Adj. praef., Bid., An. 3 Mulqueen, Haroldus, Doc. sup. gram. et math., Mod. soc. disp. WALSH, Adj. praef., An. 2 O'Hare, Leo H., Doc. inf. gram. ord. super., Mod. soc. S Joan. Berch., Mag. caer., Adj. praef., An. 2 Reilly, Franciscus J., Doc. sup. gram. et math., Praef. bibl alumn., Expl. pp. FF., Adj. praef., An. 4 Stearns, Gulielmus R., Doc. inf. gram. ord. infer. et math. Adj. praef., An. 1 COADJUTORES Anglin, Patritius, Coq., Empt., Infirm., Excit Scherf, Antonius, Aedit., Cust. vest., Ad dom. Schroen, Franciscus C., Pict. Stengel, Ferdinandus, Adj. proc., Ad dom. Walsh, Jacobus J., Disp., Cust. cell. vin., Vis. med., exam. et noct. Wirtz, Henricus, Cust. tricl. et sac. dom. Sac. 21 Schol. 10 Coadj. 6 Univ. 37"
    },
    {
        "text": "RESIDENTIA PHILADELPHIENSIS S. Josephi ST. JOSEPH'S CHURCH, 321 WILLING'S ALLEY. PHILADELPHIA, PA. P. Josephus P. O'Reilly, Sup. a die 1 Oct. 1921, Proc., Praef. eccl., Cur. ger. paroch., Mod. faed. SS. Cord., confr. SS. Nominis, soc. S. V. P., Conf. et conc. in T. P. Cotter, Joannes A., Miss. excurr. P. Emerick, Abraham J., Oper., Praef. spir., Adm., Mod schol. paroch. et schol. domin., confr. bon. mort. et SS. Rosar., soc. S. Joan. Berch., Cur. ger. nosoc., Conf. NN et in T., Conc. in T., Cons. an. 1 P. Hart, Arthurus S., Oper., Instr. conv., Mod. coet. Dorcas et soc. ad sol. deb. schol., Conf. et conc. in T., Cons. an. 6 P. Kelly, Patritius H., Oper., Mod. soc. prop. fid., Coll. pp. litt. an. et script. hist. dom., Conf. NN. et in T., Conc. in T. P. McIntyre, Carolus J., Miss. excurr. P. Walsh, Joannes P. M., Miss. excurr. Sac. 7 Univ. 7"
    },
    {
        "text": "DOMUS PROBATIONIS POUGHKEEPSIENSIS SANCTI ANDREAE NOVITIATE OF ST. ANDREW ON HUDSON, POUGHKEEPSIE, N. Y P. Gulielmus F. Clark, Rect. a die 11 Oct. 1921, Cons. Prov., Sup. audit. phil. P. Antonius J. Mass, Instr. PP. 3 prob., Adm., Conf. NN. Praes. coll. cas. consc., Exam. candid., Cens. libr., Cons. an. 4 P. Petrus F. Cusick, Mag. nov., Conf. NN., Exam. candid. Cons. an. 6 P. Cemens R. Risacher, Min., Sup. jun., Praef. val., Lect. chim., Cat. fam., Exam. candid., Cons. an. 1 P. Cotter, Antonius C., Lect. log. et metaph. gen., Conf. et exam. NN., Cens. libr. P. Cummings, Eugenius B., Cur. val. ad S. Jos. P. Daley, Josephus J., Miss. excurr. P. Dooley, Patritius J., Praef. spir. jun., Doc. hist., Conf. NN. P. Duggin, Allen F., Lect. log. et metaph. gen., Exam. NN., Praef. ton. phil. P. Duston, Joannes F., Doc. lat. et angl. in schol. hum. et eloc. an. 7 mag., Coll. pp. litt. an. et script. hist. dom. P. Fink, Eduardus X., Cur. val P. Hedrick, Joannes T., Proc., Praef. spir., Conf. NN., Red. KALEND P. Hogan, Josephus S., Doc. lat. et angl. in schol. rhet. an. 9 mag., Mod. soc. disp. P. Johnson, Georgius F., Doc. graec. et angl. in schol. hum an. 18 mag., Praef. bibl. P. MacQuillan, Patritius A., Cur. ger. xenod., Conf. NN. P. Osterrath, Leo, Conf. NN., Cur. val P. Palermo, Stanislaus, Oper. ad S. Jos. P. Quirk, Joannes F., Cur. val."
    },
    {
        "text": "P. Schmidt, Carolus E., Soc. mag. nov., Submin., Doc. gram. nov., Exam. candid., Excurr. ad Pleasant Valley P. Tallon, Gulielmus T., Praef. stud., Doc. graec. et angl. in schol. rhet. an. 13 mag., Praef. lect. ad mens., Cons. an. 2 P. Walsh, Gulielmus H., Conf. NN., Cur. val. PATRES TERTIAE PROBATIONIS P. Connors, Georgius A. P. Deppermann, Carolus E. P. Doherty, Joannes F. P. Dolan, Jacobus H. P. Downes, Franciscus J. P. Eberle, Georgius T. P. Fortescue, Josephus A. P. Gallagher, Joannes P., Praef P. Graham, Gulielmus H. P. Hogan, Georgius G. P. Jacobs, Joannes M. P. Jordan, Gulielmus F. P. Mattimore, Joannes A. P. McCarthy, Timotheus J. P. McCormick, Vincentius A. P. Millar, Moorhouse I. X. P. Nevin, Gulielmus A. P. Parsons, Josephus W. P. Quinn, Thomas J. M. P. Ryan, Daniel F. P. Shanahan, Thomas A. P. Thibbitts, Aloisius M., Adj. praef. AUDITORES PHILOSOPHIAE ANNO PRIMO 1 Bihler, Hugo J. Brennan, Eduardus L."
    },
    {
        "text": "Burke, Franciscus J. Campbell, Arthurus R. Codaire, Georgius A. Cotter, Franciscus J. Dwyer, Joannes F., Bid. schol. Gambert, Nicolaus H. Guthrie, Josephus H. Henderson, Elmer J. Hutchinson, Joannes H. Kenney, Carolus P. Klocke, Joannes H. Lanigan, Gulielmus J. MacCarthy, Justinus F. MacCormack, Antonius J. MacLeod, Henricus C. Marique, Josephus M. F McDonald, Franciscus J. Mills, Gualterus W. Mohan, Jacobus J. Mullen, Joannes C., Adj. bid. phil. Nolan, Patritius T. D'Beirne, Vincentius de P. Power, Franciscus G., Adj. lect. chim. Smith, Martinus J. Stockman, Haroldus V. Toolin, Franciscus J. Twombly, Cornelius J., Praes. acad. graec. Whalen, Eduardus J. AUDITORES PHILOSOPHIAE ANNO PRIMO I1 Cox, Joannes F., Bid. phil. Coyne, Franciscus J. Crotty, Eduardus M. Dineen, Timotheus J. Doucette, Bernardus F."
    },
    {
        "text": "Dow, Gulielmus J. Dowling, Ricardus J. Dubois, Evan C., Cust. sac. S. Ign. Fair, Leo R. Fitzsimmons, Matthaeus J., Cust. sac. S. Helen. Fox, Leo T. Freatman, Haroldus L. Gallagher, Fridericus A. Gavin, Jacobus M. Gisel, Eugenius A., Praef. bibl. phil. Hart, Vincentius J. Keane, Kerr J. Long, Joannes J. Lynch, Gulielmus A. Martin, Henricus T. McEleney, Joannes J., Bid. schol McLaughlin, Jacobus D. Mears, Josephus G. Murphy, Georgius M. O'Brien, Joannes Aloisius O'Donnell, Georgius A. Sloane, Clarentius E. Sweeney, Joannes F. X., Praes. acad. graec., Adj. praef. bibl. dom. Walsh, Josephus R Zema, Gabriel A. AUDITORES RHETORICAE 1 Connolly, Jacobus J. Cosgrove, Raymundus R. Curtin, Gulielmus C. Diehl, Joannes J. Dumas, Gustavus J. Eberle, Carolus J. FitzGerald, Josephus D. Harney, Jacobus M."
    },
    {
        "text": "Hart, Daniel F. X. Hearn, Josephus R Keane, D. Augustinus Kirchgessner, Georgius J. Mahan, Carolus G. J. Maloney, Josephus A., Bid. schol. McCarthy, Leo J. McCoy, Jacobus F. McCullough, Georgius W. McFadden, Daniel O'C. McVeigh, Franciscus J. Murphy, Josephus Thomas Neville, Cyrillus J. Nolan, Josephus E. Nuttall, Edmundus J. O'Connell, Josephus B. O'Malley, Franciscus A., Praef. bibl. jun. wNeill, Carolus A. Redmond, Jacobus J. Shalloe, Franciscus J. Smith, Eric C. Smith, Thomas J. Stahl, Nicolaus G. Sullivan, Eduardus J. Tynan, Joannes G. AUDITORES RHETORICAE II Andersen, Henricus J. Anderson, Franciscus G. Ballou, Gualterus J., Bid. jun Barbera, Georgius P. Butler, Joannes T. Clink, Josephus J. Collins, Joannes J. Connors, Josephus B. Doody, Michael J."
    },
    {
        "text": "Duffy, Gulielmus J. Fasy, Gulielmus C. Feeney, Thomas B. Foley, Patritius S. Foran, T. Laurentius Glaeser, Antonius N. Hart, Franciscus J. Hausmann, Carolus W. J. Horn, Franciscus M. Hugal, Franciscus A. Johnson, Gulielmus L. Keeley, Joannes F Murray, Joannes Clayton O'Brien, Joannes Alphonsus O'Connor, Daniel F. X O'Connor, Josephus A. Pieper, Carolus P. Proctor, Joannes C. Quigley, Thomas H. Rooney, Eduardus B., Bid. schol. Ryan, Eduardus A. Sullivan, Franciscus V. Vaughan, Lemuel P. Walsh, Philippus X AUDITORES HUMANIORUM 1 Atherton, Laurentius S. Barry, Thomas D. Berger, Carolus A. Bona, Adrianus L. Brady, Thomas F. Campbell, Robertus G. Dooley, Eduardus F FitzGerald, Gulielmus E. Hegarty, Ricardus J. Herlihy, Thomas M."
    },
    {
        "text": "McEvoy, Joannes V., Adj. bid. jun. McGuinn, Gualterus G. O'Callaghan, Joannes A. Rohan, Jacobus J. Sarjeant, Franciscus B. Sullivan, Haroldus J. Walsh, Glen E., Bid. schol. AUDITORES HUMANIORUM II Anable, Raymundus H. Blatchford, Fridericus W. Carroll, Franciscus J. Coleran, Jacobus E. Duffy, Jacobus L., Adj. mag. caer. Fey, Leo F. Glavin, Joannes M. Harrison, Josephus F. Hayes, Vincentius de P. Hoover, Gualterus F. Killeen, Joannes, Mag. caer. Maxwell, Josephus R. O'Brien, Robertus T. O'Mahony, Timotheus J. Regan, Gualterus J. Russo Alesi, Antonius Schoberg, Gulielmus F., Bid. schol. Wolff, Edmundus J., Adj. bid. jun. NOVITII SCHOLASTICI Cullumh, Leo A Burke, Daniel J. Doino, Franciscus D. Cervini, Andreas F. Hoover, Harmer C. Murray, Joannes C. Brock, Eduardus S. Coffey, Thomas J. "
    },
    {
        "text": "Dowd, Augustinus V. P. Ford, Joannes C. Long, Joannes Jac Porter, Joannes P. Crean, Thomas P. Herlihy, Franciscus T. McGrath, Josephus D. Phelan, Josephus M. Gorman, Laurentius C. Briody, Joannes B. Amyot, Omer H. Duhamel, Josephus S. Kennedy, Raymundus H. Mulligan, Eduinus C. Shea, Joannes L. DeMaria, Antonius I. Cannon, Thomas B. English, Joannes H. Feeney, Gulielmus H. Higgins, Jacobus J. Lyons, Jacobus J. Martin, Leo J. Murray, Josephus L. O'Lalor, Thomas E. Quevedo, Ludovicus A. Quilty, Thomas J. Reilly, Gualterus A. Sheehan, Gulielmus D. Fuhs, Philippus A. Krim, Franciscus J. Leo, Franciscus J. McGowan, Georgius P. Murphy, Mortimer J. Riordan, Gulielmus A Donelan, Franciscus A. Hale, Matthaeus Murphy, Jacobus M."
    },
    {
        "text": "Ryan, Joannes J. Schmid, Gilbertus F. McDonald, Henricus P. Cusick, Gulielmus H. Shea, Stephanus A. Egan, Jacobus J. McCarten, Fridericus T."
    },
    {
        "text": "COADJUTORES VETERANI Bauerlein, Eduardus J., Sart., Empt., Excit. Bowes, Franciscus F., Ad dom. Burns, Thomas F., Pict. Carey, Jacobus F., Fab. lign. Cummings, Joannes F., Infirm. Dempsey, Petrus, Manud. nov. coadj., Cust. vest. et cell. vin. Dockery, Robertus, Infirm. et ad dom. ad S. Jos. Fehily, Franciscus J., Pistor Herr, Antonius J., Villic. Kavanagh, Gulielmus J., Adj. cust. calor. et lum. elect. Lynch, Michael J., Adj. coq. McNulty, Jacobus, Cur. val. Moran, Thomas, Jan., Vis. med. et exam. Nolan, Antonius, Coq. O'Brien, Joannes M., Adj. sart. O'Connell, Eduardus J., Ad dom. O'Sullivan, Jacobus T., Cust. calor. et lum. elect. Schaffner, Georgius F., Coq. ad S. Jos."
    },
    {
        "text": "NOVITII COADJUTORES Broderick, Joannes J. Eichmiller, Michael J. Farrell, Jacobus J. Roth, Bertram F. McSorley, Eduardus W. Faith, Stephanus L. "
    },
    {
        "text": "Sac. 43 Schol. 213 Coadj. 24 Univ. 280"
    },
    {
        "text": "RESIDENTIA RIDGENSIS Sancti Michaelis ST. MICHAEL'S CHURCH, RIDGE, MARYLAND P. Josephus P. Carney, Sup. a die 21 Jul. 1921, Proc., Oper., Cur. ger. S. Michaelis, Mod. sod. B. V. M., faed. SS. Cord., soc. sanct. et dram. P. Cryan, Thomas I., Oper., Praef. spir., Adm., Excurr. ad eccl. SS. Effigiei, S. Nicolai, S. Georgii et S. F. Xavierii, Mod. faed. SS. Cord., Conf. NN., Cons. an. 3 P. La Farge, Joannes, Oper., Excurr. ad eccl. S. Jacobi et S. Nicolai, Praef. schol. alb. S. Michaelis, S. Davidis et schol. nigrit. S. Alphonsi, Mod. faed. SS. Cord., Coll. pp. litt. an. et script. hist. dom., Conf. NN., Cons. an. 4 P. McCloskey, Joannes J., Oper., Excurr. ad eccl. S. Ignatii et S. Petri Claver, Praef. schol. nigrit. S. Petri Claver, Mod. sod. B. V. M. et faed. SS. Cord. Sac. 4 Univ. 4 RESIDENTIA SANCTI THOMAE ST. THOMAS' MANOR, BEL ALTON P. O., MARYLAND Telegraph Station, Cox P. Jacobus B. Matthews, Sup. a die 27 Dec. 1919, Proc., Oper., Excurr. ad SS. Cord. La Platol, Mod. faed. SS. Cord. et schol. domin., Coll. pp. litt. an. et script. hist. dom. P. Causey, Josephus G., Oper., Conf. NN. P. Kreis, Franciscus H., Oper., Excurr. ad S. Josephi Pom fret , S. Cath. Alexand. McConchie et St. Ignatii Hill Top , Mod. faed. SS. Cord., schol. domin. et sod. B. V. M., Conf. NN., Cons. an. 4 Sac. 3 Univ. 3"
    },
    {
        "text": "COLLEGIUM WASHINGTONIENSE SANCTI ALOISII GONZAGAE GONZAGA COLLEGE, 19 EYE ST. N. W., WASHINGTON, D. C P. Paulus R. Conniff, Rect. a die 7 Jul. 1916, Mod. faed. SS Cord. vir. et juv., confr. bon. mort., Conf. et conc in T., Exam. candid. P. Georgius E. Kelly, Min., Praef. val., Mod. schol. paroch. et domin., faed. SS. Cord., sod B. V M. puer. et puell., Conf. et conc. in T., Exam. candid., Cons. an. 7 P. Brooks, Gulielmus J., Praef. eccl., Submin., Oper., Mod soc. sanct., Conf. et conc. in T., Cons. an. 12 P. Condon, Joannes E., Oper., Praes. coll. cas. consc., Conf. NN. et alumn., Conc. in T. P. Davey, J. Carolus, Praef. stud. et lect. ad mens., Cat. alumn. Mod. sod. B. V. M. alumn., soc. ad verit. prop., coet. litt. mul. Cath., Conf. et conc. in T., Exam. candid., Cons. an. 4 P. Fink, Josephus I., Proc., Oper., Mod. sod. B. V. M. vir et matr., Cur. ger. paup. in dom. sor. paup., Instr conv., Conf. et conc. in T. P. Gallagher, Eduardus F., Oper., Expl. pp. et cat. FF., Cat. fam., Conf. et conc. in T., Cons. an. 2 P. Hagen, Henricus J., Doc. inf. gram. ord. infer. et ling. hisp. an. 11 mag., Praef. bibl. dom., Coll. pp. litt. an et script. hist. dom., Conf. NN. et in T., Conc. in T. P. Pittar, Joannes B., Oper., Mod. soc. schol. sustent., Conf NN. et in T., Conc. in T. P. Roche, David J., Praef. disc., Oper., Conf. NN. et in T. Conc. in T."
    },
    {
        "text": "P. Sweeney, Eduardus J., Doc. sup. gram. an. 17 mag., Mod. sod. B. V. M. virg. et juv., soc. Phocion et coet. S. Alois., Red. CHURCH BULLETIN, Conf. et conc. in T. P. Tynan, Gulielmus J., Praef. spir., Adm., Oper., Mod. sod. B. V. M. nigrit. et soc. S. V. P., Conf. NN. et in T., Conc. in T., Exam. candid. Kenna, Eduardus J., Doc. inf. gram. ord. infer. et math., Mod. soc. S. Joan. Berch., An. 1 Ryan, Robertus L., Doc. med. gram. et ling. gall., Mod. faed. SS. Cord. alumn., An. 1 Smith, Robertus T., Doc. inf. gram. ord. super. et ling. gall., Mod. soc. dram. et athlet., Bid., An. 3 Treubig, Joannes F., Doc. inf. gram. ord. super. et math., Praef. bibl. alumn., Mod. music., An. 1 COADJUTORES Flaherty, Jeremias, Cust. sac. B. V. M. et vest., Ad dom. Habermann, Michael, Empt., Aedit., Sart. McShea, Joannes J., Cust. tricl. O'Connell, Joannes J., Ratioc., Cust. cell. vin., Excit., Vis. med., exam. et noct. Sac. 12 Schol. 4 Coadj. 4 Univ. 20"
    },
    {
        "text": "COLLEGIUM MAXIMUM WOODSTOCKIENSE SACRATISSIMI CORDIS JESI WOODSTOCK COLLEGE, WOODSTOCK, MARYLAND P. Petrus Lutz, Rect. a die 3 Oct. 1921, Lect. theol. fund mat. et hist. dogm., Cens. libr., Exam. candid. P. Thomas F. White, Min., Praef. val., Cat. FF., Cons. an. 3 P. Aigner, Franciscus X., Praef. bibl. dom., Conf. NN. P. Barrett, Timotheus B., Praef. spir., Adm., Conf. NN., Cens. libr., Exam. candid. P. Brock, Henricus M., Lect. phys., Exam. NN., Cens. libr. P. Brosnan, Gulielmus J., Lect. metaph. spec. an. 3, Conf. et exam. NN., Cens. libr., Cons. an. 1 P. Brosnan, Joannes A., Lect. chim., geol., biol. et psych. empir., Cust. mus., Conf. et exam. NN. P. Cahill, Jacobus A., Lect. metaph. spec. an. 2, paedag. et hum., Exam. NN., Cens. libr., Adj. red. TEACHERS REVIEW P. Callahan, Daniel J. M., Lect. metaph. spec. an. 2 et hist. phil., Conf. et exam. NN., Cens. libr. P. Casten, Henricus T., Lect. theol. schol. pomer., Praef. ton. theol., Exam. NN., Cens. libr. P. Dawson, Jacobus F., Lect. theol. dogm. curs. min., Conf. et exam. NN., Cens. libr. P. Drum, Gualterus, Lect. S. Script., Doc. ling. syri., Conf et exam. NN., Cens. libr. P. Duane, Gulielmus J., Praef. stud., Lect. theol. schol. mat., Exam. NN., Cens. libr., Exam. candid., Cons. an. 10 P. Lamb, Carolus V., Lect. eth. et jur. nat., Exam. NN., Cens. libr."
    },
    {
        "text": "P. Langan, Joannes T., Lect. theol. fund. vesp., Exam. NN., Cens. libr. P. Lunny, Joannes J., Lect. theol. mor. scholast. et pract., Praes. coll. cas. consc. dom. et mod. coll. theol. archidiaec. Neo Ebor., Doc. rhet. sacr., Praef. ton. phil., Conf. et exam. NN., Cens. libr., Exam. candid., Cons. an. 13 P. McClellan, Gulielmus H., Doc. ling. hebr., Stud. S. Script. P. O'Shea, Michael J., Proc., Cur. ger. paroch. P. Papi, Hector, Lect. jur. can., Praef. sac., Mod. acad. rit., Exam. NN., Cens. libr. P. Phillips, Eduardus C., Lect. math. subl. et astrom., Conf. et exam. NN., Cens. libr. P. Woods, Josephus M., Lect. hist. eccles. patrol. et archaeol. sacr., Red. WOODSTOCK LETTERS et TEACHERS' REVIEW Conf. et exam. NN., Cens. libr. AUDITORES THEOL. CURSUS MAJORIS ANNO QUARTO P. Bulman, Cornelius L. P. Colligan, Joannes J. P. Dougherty, Josephus A. P. Downey, Franciscus X P. Hessel, Carolus H. P. Koen, Stephanus A. P. Logue, Gulielmus G. P. McCarthy, Dionysius L. P. McQuade, Franciscus A. P. Mulry, Josephus A., Cat. fam. P. Schmitt, Martinus A. P. Schmitt, Ricardus B. P. Talbot, Franciscus X. P. Zillig, Martinus L."
    },
    {
        "text": "ANNO TERTIO P. Archdeacon, Franciscus L. P. Creeden, Daniel F. P. Gorayeb, Josephus P. P. Hannas, Gulielmus H. A P. Hayes, Jacobus T. P. Leavey, Jacobus M. P. O'Hara, Franciscus W., Adj. red. WOODSTOCK LETTERS P. Strohaver, Georgius F. P. Summers, Gualterus G. P. Torre, Aloisius M. Becker, Jacobus J., Cat. ad Marriottsville Bernhardt, Carolus L., Adj. praef. bibl. dom., Vis. mat. et noct., Cat. ad Woodstock Keelan, Vincentius L., Vis. med. et exam Kempel, Franciscus G., Cat. ad Harrisonville MacDonnell, Josephus F., Cat. ad Woodstock Mack, Aloisius R., Vis. med. et exam., Cat. ad Woodstock Sheehan, Arthurus J., Bid. schol. S. Script., Praes. acad theol. ANNO SECUNDO P. Keenan, Franciscus E. Bull, Georgius D Catalano, Sanctus J., Bid. schol. jur. can., Vis. mat. et noct. Connolly, Terentius L. Daly, Jacobus G., Cat. ad Harrisonville Devereux, Atlee F. X., Cat. ad Marriottsville Frisch, Joannes A Gampp, Joannes H. Healy, Hugo S., Expl. pp. FF., Cat. ad Cherry Hill Hofmann, Andreas A., Praef. bibl. theol., Vis. mat. et noct., Cat. ad Woodstock Hogan, Aloisius G., Praes. acad. graec., Cat. ad Alberton Holland, Robertus E., Cat. ad Cherry Hill"
    },
    {
        "text": "Langguth, Aloisius B., Bid. schol. Love, Thomas J., Cat. ad Harrisonville Lucas, Josephus L. Lucey, Franciscus E. Martin, Eugenius A. Masterson, Petrus H. McGowan, Josephus J., Bid. schol. mor. McHale, Gulielmus F. McInnis, Raymundus J., Expl. pp. FF., Cat. ad Woodstock McKay, Ludovicus E. Mulry, Aloisius J., Expl. pp. FF. Murphy, Franciscus Fay, Cat. ad Woodstock O'Connell, Joannes C. Parsons, Robertus A., Praef. odei Risacher, Joannes A., Bid. theol. Rudtke, Stephanus J. Sullivan, Eduardus A., Vis. med. et exam., Praef. cant. greg., Cat. ad Marriottsville Watson, Vincentius Zema, Demetrius, Bid. schol. hist. eccl., Cat. ad Woodstock ANNO PRIMO Bowen, Franciscus E., Cat. ad Woodstock Brown, Vachel J., Vis. mat. et noct Countie, Josephus K., Vis. med. et exam. Daly, David A., Cat. ad Marriottsville Daly, Joannes A. Eichhorn, Rudolphus J. Gallagher, Thomas F. Greely, Jacobus Kienle, Alfredus F. Low, Franciscus E. Lyons, Joannes E., Praes. acad. graec. Mahoney, Daniel P. Matthews, Joannes V., Vis. med. et exam., Cat. ad Woodstock McGrory, Joannes T."
    },
    {
        "text": "Monaghan, Josephus Moran, Joannes G., Praes. acad. graec. Murphy, Josephus T. O'Malley, Thomas I. O'Neill, Jacobus V. Patterson, Laurentius K. Roddy, Carolus M., Cat. ad Woodstock Ruggeri, Gulielmus Shea, Joannes F., Bid schol. Smith, Joannes P. Sullivan, Josephus J. AUDITORES THEOL. CURSUS MINORIS ANNO QUARTO P. Brown, Joannes J. P. Crawford, Gulielmus R., Adj. praef. sac P. Knight, Josephus S P. Morning, Josephus B. P. Repetti, Gulielmus C. P. Ward, Thomas A. ANNO TERTIO P. Andries, Franciscus L. P. Avery, Henricus C. P. Boyton, Neil J. P. Quigley, Daniel J. Wiesel, Henricus J. ANNO SECUNDO Corliss, Gulielmus V., Adj. bid. theol., Cat. ad Woodstock Glose, Josephus C., Bid schol., Vis. mat. et noct McLaughlin, Hugo J., Vis. med. et exam., Cat. ad Alberton Mudd, Mauritius A Sullivan, Daniel H."
    },
    {
        "text": "ANNO PRIMO Cerrute, Edmundus P., Cat. ad Woodstock Donoghue, Thomas A., Cat. ad Harrisonville Dougherty, Franciscus X. Fuller, Aloisius E., Vis. mat. et noct. Greenwell, Hezekias C., Cat. ad Harrisonville O'Neill, Jacobus L., Cat. ad Woodstock O'Shaughnessy, Martinus J. Whalen, Gulielmus A. AUDITORES PHILOSOPHIAE ANNO TERTIO Amy, Ernestus P. Barrett, Thomas F., Adj. bid. phil. Brennan, Thomas A., Adj. praef. bibl. dom Carpenter, Earl J., Vis. mat. et noct Clarke, Philippus J., Cust. sac. S. Stanisl. Doyle, Thomas A Dugan, Joannes J. Flaherty, E. Franciscus, Vis. med. et exam Flanagan, Joannes P., Praes. acad. phil., Cust. sac. S. Cathar. Toley, Daniel J. Friary, Gualterus F. Higgins, Thomas J., Bid. schol Keegan, Joannes J. Kennally, Vincentius I., Mag. caer. Leckie, Thomas F. X., Vis. mat. et noct., Cust. sac. mort. Logue, Ludovicus R. Martin, Mauritius S. McNally, Herbertus P., Cus. sac. S. Thom. Meagher, Gualterus J., Vis. med. et exam. Moriarty, Joannes J. Murphy, Joannes J. O'Beirne, Stephanus L. O'Brien, Petrus A."
    },
    {
        "text": "O'Connell, Joannes R. Quilty, Gulielmus X., Cust. sac. S. Joan. Berch. Rudtke, Alfredus M., Cust. sac. S. Josephi Smith, Sidney J., Praef. bibl. phil. Stanley, Laurentius E., Vis. med. et exam., Cust. sac. B. V. M. a Strat. Sullivan, Raymundus R. Sullivan, Russell M. Voelkl, Michael G., Bid. phil. Whall, Arthurus E. Willmann, Georgius J. ANNO SECUNDO P. Hanrahan, Eduardus J. Ahearn, Josephus D. Blatchford, Joannes A. Bunn, Eduardus B. Carney, Jacobus G., Vis. mat. et noct. Coffey, J. Eduardus Conway, Paulus G. Cummings, Patritius J., Bid schol. Donnelly, Eduardus McT. Donovan, Matthaeus Duffy, Jacobus F., Cust. sac. S. Joan. Franc. Regis Dullea, Mauritius V. Flanagan, Robertus P. Gookin, Vincentius A Harding, Michael J., Cus. sac. SS. Angel Harney, Martinus P. Herne, Laurentius F. Hisken, Josephus L., Cust. sac. S. Michael Horgan, David W. Kennedy, Gulielmus W. Krim, Josephus M., Vis. med. et exam. Leisner, Antonius L. Maher, Joannes M."
    },
    {
        "text": "McCadden, Jacobus J. McDonald, Gulielmus F. McDonald, Jacobus A. McFarland, Ellwood F. McGrath, Joannes J. McKenna, Horatius B., Vis. med. et exam. McLaughlin, Thomas L., Vis. mat. et noct. McLean, Eduardus J. McManamy, Ludovicus H. Meszlis, Antonius B. Moore, Thomas H. Moran, Jacobus P., Adj. lect. phys., Vis. mat. et noct O'Conor, Joannes S. Perrot, Josephus E. Reardon, Franciscus X. Reinhard, Eduardus G. Roth, Albertus C. Roth, Carolus A. Scanlon, Joannes J. Schoberg, Ferdinandus H. Shanahan, Thomas A., Cust. sac. S. Franc. Hieron. Shortell, Thomas E. Sohon, Fridericus W. Sullivan, Franciscus A. Sullivan, Raymundus P. COADJUTORES Abram, Carolus, Empt., Coq. Clarke, Joannes, Adj. praef. bibl., Hortul. Coffey, Gulielmus J., Arment. Fitzpatrick, Martinus, Cust. cell. vin., Disp., Ad dom. Flinn, Josephus J., Sart Gibbons, Joannes, Adj. sart Himmelreicher, Joannes P., Pistor, Excit. Hughes, Gulielmus, Adj. cust. vest."
    },
    {
        "text": "Kilmartin, Jacobus L., Cust. vest. McAviney, Eduardus F., Infirm. McElaney, Gulielmus, Ad dom., Excit. McMullan, Joannes, Cust. calor. Murphy, Petrus J., Adj. cust. tricl. Ondus, Josephus, Ad dom., Adj. cust. calor. O'Connell, Joannes, Ad dom. O'Leary, Aloisius, Typogr. O'Reilly, Andreas, Ad dom., Excit. Pinamonti, Orestes, Aedit. Reppert, Emmanuel S., Villic. Schapertons, Petrus, Cust. tricl. Siczko, Stanislaus, Ad dom. Steimer, Ferdinandus, Adj. cust. tricl. Sac. 57 Schol. 156 Coadj. 22 Univ. 235"
    },
    {
        "text": "DOMUS PROBATIONIS YONKERSENSIS SANCTI STANISLAI WOODSTOCK ON HUDSON, 615 NORTH BROADWAY, YONEERS, N. Y. P. Laurentius J. Kelly, Sup. a die 25 Aug. 1917, Mag. nov. Exam. candid. P. Geraldus A. Dillon, Min., Soc. mag. nov., Doc. gram. nov., Praef. val. et lect. ad mens., Exam. candid., Cons. an. 5 P. Coyle, Gulielmus H. A., Proc., Trad. exer. spir., Conf. NN., Exam. candid., Cons. an. 4 P. Hill, Michael P., Praef. spir., Adm., Praes. coll. cas. consc., Coll. pp. litt. an. et script. hist. dom., Praef. bibl., Conf NN., Exam. candid. NOVITII SCHOLASTICI"
    },
    {
        "text": "Cadigan, Joannes J. Lynch, Joannes G. Sheehan, David J. Bellwoar, Joannes F. X. Burke, Jacobus L. Dolan, Jacobus J. Douglas, Eduardus T. Durkin, Josephus T. Flanagan, Josephus S. Fox, Thomas A. Hyland, Gualterus F. Murphy, Eduardus L. O'Connor, Leo A. Rooney, Franciscus X. Harley, Jacobus L. McKeon, Ricardus M. Reiser, Eduardus J. Williams, Joannes J."
    },
    {
        "text": "Priestner, Josephus A. O'Connor, Joannes J. Smith, Gulielmus J. D'Invilliers, Josephus A. P. Dolin, Petrus J. Reilly, Thomas H. Risk, Jacobus E Carroll, Joannes P. Rohleder, Carolus H. Rooney, Josephus J. Schlaerth, Gulielmus J. Stokes, Thomas J. Welch, Joannes J. Bradley, Franciscus J. Dansereau, Theodorus M. Haggerty, Jacobus E. Kelly, Gulielmus D. Martin, Jacobus A. Murray, Joannes B. Reynolds, Thomas F. Tribble, Arthurus B. Washila, Leo J. Muollo, Henricus B."
    },
    {
        "text": "COADJUTORES VETERANI Biniakiewicz, Franciscus A., Infirm., Cust. vest. et cell. vin. et gallin., Excit., Ad dom. Gale, Antonius J., Cust. tricl., Adj. coq. Glennon, Thomas B., Villic., Arment. Goergen, Michael J., Jan., Sart., Aedit., Vis. med. et exam. Meehan, Thomas J., Coq., Cust. calor., Empt. NOVITIUS COADJUTOR Casey, Joannes Sac. 5 Schol. 40 Coadj. 6 Univ. 51"
    },
    {
        "text": "Regio Novae Angliae R. P. PATRITIUS F. O'GORMAN VICE PROVINCIALIS A DIE 31 JUL., 1821 BOSTON COLLEGE, CHESTNUT HILL, MASS. CONSULTORES REGIONIS NOVAE ANGLIAE P. Jacobus J. Carlin, Rector Coll. S. Crucis, a die 26 Sept. 1921 P. Gulielmus Devlin, Rector Coll. Bostoniensis, a die 26 Sept. 1921 P. Joannes J. Geoghan, Superior Scholae Alt., Boston., a die 26 Sept. 1921"
    },
    {
        "text": "COLLEGIUM BOSTONIENSE BOSTON COLLEGE, CHESTNUT HILL, MASS. P. Gulielmus Devlin, Rect. a die 20 Jul. 1919, Cons. Vice Prov., Exam. candid. P. Jacobus T. McCormick, Min., Praef. val., Doc. math. et evid. rel., Exam. candid., Cons. an. 4 P. Becker, Thomas A., Doc. rhet. et ling. hisp. an. 20 mag., Conf. et exhort. NN P. Beglan, Josephus F., Lect. metaph. spec. et hist. phil. P. Boehm, Fridericus G., Lect. log, metaph. gen., cosmol. et evid. rel., Praes. coll. cas. consc. P. Byrne, Michael F., Praef. spir., Adm., Cat. fam., Expl. pp. et cat. FF., Conf. NN P. Corrigan, Jones I. J., Lect. eth., leg. fund. et evid. rel. P. Crowley, Daniel P. A., Lect. log, metaph. gen., cosmol. et evid. rel., Conf. NN. P. Donnelly, Franciscus P., Doc. rhet. et evid. rel. an. 20 mag., Mod. sod. B. V. M. alumn. jun. P. Dore, Leo A., Lect. hist., Mod. sod. B. V. M. alumn. rhet. P. Fitzpatrick, Joannes P., Praef. disc., Doc. ling. graec. jun. et evid. rel. an. 7 mag., Coll. pp. litt. an. et script. hist. dom. P. Hanlon, Georgius E., Doc. hum., evid. rel. et ling. gall. an. 6 mag. P. Keating, Joannes S., Doc. rhet. an. 22 mag., Mod. soc. S. Rad., Cons. an. 5 P. Klocke, Albertus H., Doc. rhet. et evid. rel. an. 7 mag. P. Lynch, Daniel J., Lect. phys. P. McCluskey, Thomas J., Lect. log, metaph. gen., cosmol. et evid. rel., Mod. faed. SS. Cord., Conf. NN."
    },
    {
        "text": "P. McHugh, Patritius J., Praef. stud., Doc. math. et evid. rel., Exam. candid., Cons. an. 2 P. McQuade, Joannes E., Doc. rhet. et evid. rel. an. 15 mag P. Mellyn, Jacobus F., Proc., Lect. paedag. et evid. rel., Exam. candid., Cons. an. 2 P. Murphy, Gulielmus E., Doc. hum. et evid. rel. an. 13 mag., Mod. soc. dram. P. O'Brien, Ricardus A., Doc. hum. et evid. rel. an. 12 mag., Mod. sod. B. V. M. alumn. hum. P. Reynolds, Robertus F. X., Doc. rhet. et evid. rel. an. 17 mag P. Shaffrey, Clarentius E., Lect. biol. et evid. rel. P. Stinson, Gulielmus M., Doc. hum. et evid. rel. an. 7 mag., Praef. lect. ad mens., Mod. sod. B. V. M. alumn. sen., Praef. bibl. dom. et alumn. P. Sullivan, Josephus F., Doc. hum. an. 6 mag Dwyer, Joannes J., Doc. hum., Red. STYLUS, An. 3 Gillis, Florentius M., Doc. hum., Red. THE HEIGHTS, Mod soc. disp. Marquette, An. 4 Kelly, Josephus P., Doc. math., Mod. soc. disp. Fulton, An. 2 McCullough, Henricus B., Lect. chim. gen., An. 2 Tobin, Joannes A., Lect. mech. et math., Mod. music., An. 4 Walsh, Josephus B., Doc. hum. et ling. gall., An. 3 COADJUTORES Conroy, David J., Ad dom., Excit. Leddy, Jacobus A., Cust. vest. et cell. vin., Vis. med., exam. et noct. Sac. 25 Schol. 6 Coadj. 2 Univ. 33"
    },
    {
        "text": "SCHOLA ALTA BOSTONIENSIS BOSTON COLLEGE HIGH SCHOOL. 761 HARRISON AVENUE BOSTON, 18, MASS Joannes J. Geoghan, Sup. a die 20 Jul. 1919, Dir. apost. orat. pro archidiaec. Boston., Mod. faed. Eucharist. vir. coet. juv. Cath. et soc. S. Cath., Conf. et conc. in T., Exam. candid., Cons. Vice Prov. Carolus E. Lane, Min., Praef. val. et eccl., Coll. pp. litt. an. et script. hist. dom., Conf. et conc. in T., Exam. candid., Cons. an. 7 Bric, Jacobus J., Conf. NN. Conway, Gulielmus J., Praef. spir., Adm., Proc., Mod. sod. B. V. M. vir. et soc. Loyol., Expl. pp. er cat. FF., Conf. NN. et in T., Conc. in T., Cons. an. 2 Hurley, Josephus R., Praef. disc., Mod. schol. domin., Conc. in T. Keelan, Georgius A., Oper., Mod. sod. B. V. M. matr. et confr. bon. mort., Cur. ger. surd. et mut., Instr. conv., Conf. NN. et in T., Exam. candid., Cons. an. 3 Kirchmyer, Josephus G., Doc. med. gram. et ling. gall. an. 15 mag., Cat. alumn. sen., Praes. coll. cas. consc., Praef lect. ad mens., Mod. sod. B. V. M. juv., Conc. in T. McGovern, Jacobus L., Praef. stud., Mod. sod. B. V. M. virg. et soc. A Kempis, Mod. soc. dram. in schol. alt., Conf. et conc. in T., Exam. candid., Cons. an. 4 Murphy, Cornelius A., Doc. inf. gram. ord. infer. et math. an. 15 mag., Mod. soc. prop. fid., Praef. bibl. dom., Conf. NN. et in T., Conc. in T. Rache, Henricus J., Oper., Conf. poenit. Bon. Past., Mod. sod. B. V. M. puell. et soc. sanct., Conf. NN. et in T."
    },
    {
        "text": "P. Scott, Martinus J., Oper., Mod. faed. SS. Cord., caet music., soc. S. V. P. et sod. B. V. M. alumn. vet., Conf. NN. et in T., Conc. in T. P. Swift, Eduardus S., Doc. inf. gram. ord. infer. et math. an. 3 mag., Conc. in T. P. Welch, Joannes E., Doc. med. gram. et ling. gall. an. 4 mag., Cat. alumn. jun., Mod. sod. B. V. M. puer., Conf. et conc. in T. P. Wessling, Henricus J., Oper., Conf. NN. et in T. et in orphanotrop. St. Vincent et Harr. Ave P. Voung, Ludovicus J., Cur. ger. nosoc. municip. Barter, Ricardus J., Doc. med. gram. et hist., An. 5 Berry, Eduardus B., Doc. phys. et math., An. 1 Bouwhuis, Andreas L., Doc. inf. gram. ord. super. et math., Mag. caer., An. 1 Butcher, Joannes M., Doc. sup. gram. et geom., Mod. sod. B. V. M. alumn. jun., An. 3 Comey, Dionysius J., Doc. med. gram. et ling. hisp., Mod. soc. athlet., An. Dougherty, Michael J., Doc. inf. gram. ord. infer. et math., Mod. coet. music., An. 1 English, A. Linton, Doc. med. gram. et math., Mod. faed. SS. Cord. alumn., An. 2 Fennell, Jacobus A., Doc. sup. gram. et geom., Mod. soc. disp. McElroy, An. 3 Foley, Carolus J., Doc. sup. gram. et ling. gall., Mod. soc. disp. Bapst, An. 4 Gampp., Antonius L., Doc. inf. gram. ord. super, math. et ling. germ., Praef. bibl. alumn., An. 1"
    },
    {
        "text": "Glaser, Gulielmus A., Doc. inf. gram. ord. infer. et math., Mod. sod. B. V. M. alumn. jun., An. 1 Lamb, Eduardus P., Cur. val. extra dom. Matthews, Thomas L., Doc. inf. gram. ord. infer., ling. hisp. et graec., Adj. red. BOTOLPHIAN, An. 1 McCarthy, Eugenius E., Doc. math., Adj. praef. disc., Adj. mod. soc. dram., An. 3 O'Shaughnessy, Gulielmus B., Doc. sup. gram. et ling. gall., Red. BOTOLPHIAN, An. 4 Slattery, Josephus A., Doc. sup. gram. et geom., Bid., An. 4 Sweeney, Jacobus P., Doc. inf. gram. ord. super. et hist., Mod. sod. B. V. M. alumn. sen., An. 2 COADJUTORES Erhard, Josephus, Aedit., Cur. mund. in schol. alt. Nestor, Martinus, Ad dom. O'Donnell, Thomas P., Infirm., Ad dom., Excit., Vis. med., exam. et noct. Ponholzer, Eduardus E., Cust. cell. vin. et vest., Ad dom Sac. 15 Schol. 17 Coadj. 4 Univ. 36"
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS S. Mariae ST. MARY'S RECTORY, 45 COOPER ST., BOSTON, MASS. P. Augustus J. Duarte, Sup. a die 31 Jul. 1920, Proc., Praef. eccl., Cur. ger. paroch., alumn. S. Mariae et soc. dram., Praef. odei, Conf. et conc. in T. P. Carolus F. Arnold, Min., Praef. val., Oper., Cur. ger. nosoc. municip., Mod. sod. B. V. M. juv., soc. S. V. P., schol. domin., coet. S. Mariae juv. et coet. puell. sen., Instr. conv., Conf. et conc. in T., Cons. an. 2 P. Coughlan, Joannes M., Oper., Mod. faed. SS. Cord., sod. B. V. M. puer. et puell. et soc. ad sust. schol. et eccl., Conf. NN. et in T., Conc. in T. P. Coveney, Joannes G., Miss. excurr. P. Cunningham, Gulielmus F., Praef. spir., Oper. in Ins. Deer et paroch., Mod. sod. B. V. M. vir., confr. bon. mort et soc. Lourdes., Conf. NN. et in T., Conc. in T. P. Emmet, Thomas A., Miss. excurr. P. Goeding, Franciscus B., Miss. excurr. P. Green, Josephus P., Miss. excurr. P. Leary, Henricus A., Oper., Mod. sod. B. V. M. virg., soc. S. Joan. Berch., soc. prop. fid., coet puell. jun., Conf. NN. et in T., Conc. in T., Cons. an. 1 P. McCarthy, Joannes D., Miss. excurr. P. McLoughlin, Milesius A., Oper., Mod. sod. B. V. M. matr., Praef. bibl. dom., Coll. pp. litt. an. et script. hist. dom., Conf. NN. et in T., Conc. in T., Cons. an. 5 P. Quigley, Gulielmus J., In Ins. Long Oper. Sac. 12 Univ. 12"
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS SS. Trinitatii HOLY TRINITY RECTORY, 14 COBB ST., BOSTON, MASS. P. Carolus P. Gisler, Sup. a die 21 Jul. 1921, Proc., Cur. ger paroch., Praef. eccl., Mod. schol. paroch., confr. SS. Rosar. vir. et mul., soc. S. Antonii et S. V. P., soc. sanct., Praes. coll. cas. consc., Conf. et conc. in T. Red. MONATS BOTE P. Keller, Josephus A., Praef. spir., Adm., Mod. confr. bon. mort. et faed. SS. Cord., Cat., Conf. NN. et in T., Conc. in T. P. Nelles, Henricus J., Oper., Mod. sod. B. V. M. virg., soc. prop. fid., Cat., Conf. NN. et in T., Coet. music., Cons. an. 4 P. Pohlmann, Bernardus H., Oper., Submin., Mod. sod B. V. M. juv., Coll. pp. litt. an. et script. hist. dom., Conf. NN. et in T., Conc. in T., Cons. an. 3 Sac. 4 Univ. 4 RESIDENTIA IN INSULA MANRESA Domus Exercit. Manresana MANRESA ISLAND, SOUTH NORWALK, CONN. P. Josephus H. Richards, Sup. a die 18 Apr. 1919 P. Hacker, Joannes G. P. Himmel, Josephus J., Conf. NN. P. Kouba, Emmanuel S., Cur. val. COADJUTORES Mansell, Georgius H., Ad dom. Spiess, Joannes N., Hortul., Ad dom. Sac. 4 Coadj. 2 Univ. 6"
    },
    {
        "text": "COLLEGIUM VIGORNIENSE ET CONVICTUS SANCTAE CRUCIS HOLY CROSS COLLEGE, WORCESTER, MASS P. Jacobus J. Carlin, Rect. a die 25 Jul. 1918, Conc. in sac. Cons. Vice Prov., Exam. candid. P. Marcus J. Smith, Min., Praef. sac. et val. NN., Conf. alumn., Conc. in sac., Cons. an. 1 P. Barrett, Thomas J., Lect. log, metaph. gen., cosmol. et evid. rel. in schol. phil., Conc. in sac P. Coyle, Georgius L., Lect. chim. anal. et organ., Praes. coll. cas. consc., Conc. in sac P. Cullen, Gulielmus R., Lect. phys. et geol., Mod. circ. scientif., Conc. in sac., Praef. cub. P. Earls, Michael, Doc. rhet. an. 13 mag., Conc. in sac. P. Fox, Joannes M., Lect. eth. et evid. rel. in schol. phil., Doc. ling. lat. et eloc. in schol. phil., Praef. bibl. phil. Mod. circ. Aquinas et soc. dram., Conf. NN., Conc. in sac., Praef. cub. P. Haberstroh, Ferdinandus G., Lect. log., metaph. gen., cos mol. et evid. rel. in schol. phil., Conc. in sac., Praef cub. P. Heredia, Carolus M., Script., Doc. ling. hisp. an. 13 mag. P. Kaspar, Godfridus A., Doc. rhet. et evid. rel. in schol. het. an. 6 mag., Mod. sod. B. V. M. alumn. extern. Conc. in sac., Praef. cub. P. Keyes, Jacobus G., Lect. log, metaph. gen., cosmol. et paedag. in schol. phil., Mod. faed. SS. Cord., Conc. in sac., Conf. NN. P. Kimball, Carolus L., Doc. hum. an. 12 mag., Mod. sod. B. V. M. alumn., Conc. in sac., Praef. cub., Exam. can did., Cons. an. 1"
    },
    {
        "text": "P. Levain, Paulus V., Doc. math. et ling. gall. in schol. hum an. 11 mag., Lect. astron. P. Mahan, Carolus H., Lect. hist. in schol. phil., Doc. rhet et hum., Praef. bibl. dom., Conc. in sac., Praef. cub. P. Mahoney, Joannes G., Doc. hum. et evid. rel. in schol. hum. an. 9 mag., Conc. in sac., Praef. cub. P. Mullen, Jacobus A., Praef. stud., Mod. soc. athlet., Conc. in sac., Exam. candid., Cons. an. 14 P. Peters, Albertus, Conf. NN. P. Prendergast, Josephus J., Praef. spir., Adm., Conf. NN. et alumn., Expl. pp. FF., Coll. pp. litt. an. et script. hist. dom., Conc. in sac. P. Pyne, Joannes X., Lect. metaph. spec. et aecon. polit. in schol. phil., Mod. soc. Nexus, Praef. lect. ad mens. Conc. in sac. P. Scanlan, Timotheus F., Doc. ling. gall., Conf. alumn., Praef. cub. P. Wennerberg, Henricus P., Lect. log., metaph. gen., cosmol. et evid. rel. in schol. phil., Doc. eloc. in schol. phil., Conc. in sac., Praef. cub. P. Wheeler, Joannes D., Praef. disc. et val. alumn., Exam candid. P. Williams, Josephus J., Proc., Conf. alumn., Conc. in sac. Cons. an. 4 Crowley, Joannes J., Lect. phys. et mech., Doc. math., Dir observ. seismol., Praef. cub., An. 1 Dinneen, Josephus S., Doc. ling. graec. et lect. hist. phil. in schol. phil., Mod. soc. B. J. F., Adj. praef. disc. et stud., An. 4 Dolan, Franciscus J., Doc. hum. et ling. hisp., Adj. red. THE PURPLE, Praef. cub., An. 3 Dyson, Robertus A., Doc. rhet., Praef. cub., An. 2 Kelley, Jacobus J., Doc. hum. et ling. gall., Adj. praef. disc., An. 4"
    },
    {
        "text": "McLaughlin, Joannes J., Doc. hum., ling. gall. et ling. angl. in schol. phil., Praef. cub., An. 2 McWilliams, Raymundus J., Lect. biol., Doc. ling. gall., Mod. soc. Mendel, Praef. cub., An. 3 Michaud, Arthurus M., Lect. chim. gen., Praef. cub., An. 1 Mulligan, Franciscus A., Doc. rhet. et ling. gall., Mod. soc. Philomath., Praef. cub., An. 2 Murphy, Gulielmus J., Doc. hum. et ling. gall., Red. THE PURPLE, Praef. cub., An. 2 Reinhalter, Oswald A., Doc. hum., ling. gall. et ling. angl. in schol. phil., Mod. soc. S. Joan. Berch., Adj. mod. faed. SS. Cord., Adj. praef. disc., An. 2 Smith, Joannes J., Doc. rhet., Mod. soc. music. instrum., soc. cant. et cant. in sac., Bid., Praef. cub., An. 4 Sullivan, Ludovicus E., Doc. eloc. in schol. rhet. et hum., Praef. bibl. alumn., Adj. praef. disc., An. 1 COADJUTORES Carroll, Jacobus F., Cust. tricl. et sac. dom. Daly, Franciscus X., Mod. fam Freeman, Fridericus W. A., Ad dom. Hagerty, Patritius, Infirm Horwedel, Franciscus X., Villic. Mahony, Joannes V., Cust. sac. alumn. et vest. McCarthy, Patritius, Cust. tricl. alumn. Probst, Henricus J., Disp. Smith, Paulus, Empt Sac. 23 Schol. 13 Coadj. 9 Univ. 45"
    },
    {
        "text": "MISSIO JAMAICENSIS COLIEGIUM EINGSTONENSE ET RESIDENIIA SANCTI GEORGII WINCHESTER PARK, KINGSTON, JAMAICA, BRITISH WEST INDIES RR. DD. Gulielmus F. O'Hare, Episcopus Maximianopolis et Vic. Apost. Jamaic P. Franciscus X. Delany, Sup. Reg. NN. a die 9 Aug. 1920, Prosvicarius, Praef. eccl., Mod. sod. B. V. M. mul., Conf. et conc. in T., Cens. libr., Exam. candid. P. Kelly, Josephus M. A., Min., Proc., Praef. val., Oper., Mod sod. B. V. M. vir., puell. et faed. SS. Cord., Cur. ger. schol. elem., Conf. et conc. in T., Cons. an. 1 P. Butler, Leo T., Doc. sup. gram., math., ling. gall. et eloc. an. 10 mag., Mod. soc. dram., Parat alumn. ad exam. pub., Capell. ad Sanit. S. Josephi, Conc. in T. P. Canning, Josephus A., Doc. med. gram., math., ling. hisp an. 10 mag., Cat. alumn., Parat alumn. ad exam. pub., Mod. soc. athlet., Praef. cant., Capell. ad conv. Soror. Miser., Excurr. ad Port Royal, Conf. NN. et in T., Conc. in T. P. Cronin, Daniel I., Oper., Submin., Cur. ger. schol. indust puer. et puell., schol. elem. et miss. Holy Rosary, Seven Miles et Morant Bay, Vis. xenod. et carc., Mod. sod. B. V. M. puer. et Catholic Club, Praef. bibl. paroch., Red. CATHOLIC OPINION, Conf. NN., alumn. ad Alpha et in T., Conc. in T., Cons. an. 2 P. Higgins, Aloisius T., Oper., Cur. ger. miss. S. Annae et schol. elem. S. Annae et S. Anton., Vis. nosoc., Excurr. ad Leader's Lane"
    },
    {
        "text": "P. Howle, Franciscus de S., Adm., Oper., Mod. schol. domin. et confr. doctr. Christ., Capell. ad caemet. et ad Up Park Camp., Cur. ger. miss. Alvernia, Adj. red CATH OLIC OPINION, Conf. NN. et in T., Conc. in T., Exam. candid. P. Kelly, Jacobus V., Praef. spir., Oper., Instr. conv., Vis. dom. paup., Conf. NN., monial. et in T., Conc. in T., Cur. ger. hisp., Acad. Immac. Concep., Schola Alta ac Alpha et miss. excurr. ad Whitehall, Expl. pp. et cat FF., Adj. red. CATHOLIC OPINION, Cens. libr., Exam. candid. P. Kleinmeyer, Carolus A., Doc. inf. gram. ord. sup., math. ling. hisp., Cat. alumn., Mod. sod. B. V. M. alumn. an 6 mag., Mag. caer., Conf. alumn. ad Alpha, Praef. bibl dom. et alumn., Conf. et conc. in T. P. Lowry, Josephus T., Doc. inf. gram. ord. super., math., ling. gall. et eloc. an. 6 mag., Mod. faed. SS. Cord. alumn., Capell. ad conv. Immac. Concep., Conf. alumn. ad Alpha, Conc. in T. P. Mulry, Patritius F. X., Oper., Mod. soc. equit. S. Joan., matr. auxil., confr. bon. mort., SS. Rosar. et soc. S. V. P., Cur. ger. miss. ad Toll Gate et Gordon Town, Praes. coll. cas. consc., Conf. NN., alumn. ad Alpha et in T., Conc. in T., Cens. libr., Exam. candid., Cons. an. 12 P. Wheeler, Ferdinandus C., Praef. stud. et disc., Doc. hum. et ling. hisp. an. 7 mag., Cat. alumn., Mod. equit. SS. Sacr., Boy Scouts et Men’s Brigade, Parat alumn. ad exam. pub., Capell. ad conv. Soror. Miser., Coll. pp litt. an. et script. hist. dom., Conf. et conc. in T., Cons an. 1 COADJUTORES Culkin, Daniel J. R., Aedit. in T., Adj. proc., Cust. cell. vin., Excit., Vis. mat. et noct. Quattrocchi, Rochus, Ad dom., Empt., Fab. lign., Vis. med. et exam."
    },
    {
        "text": "MISSIO S. JACOBI Prospect Hill, Montego Bay P. O. P. Chetwood, Thomas B., Cur. ger. miss. Montego Bay, Sea ford Town, Pisgah et Lucea MISSIO S. ANTONII Port Antonio P. O. P. Ford, Josephus F., Cur. ger. miss. Port Antonio, Buff Bay Avocat, May River et Mt. St. Joseph MISSIO S. JOSEPHI Spanish Town P. O. P. Grewen, Fridericus J., Cur. ger. miss. Spanish Town, Old Harbour, Port Henderson et Gregory Park, Vis. dom. lepros., nosoc., dom. paup. et carc. ad Spanish Town MISSIO S. JOSEPHI Savanna la Mar P. O. P. Halliwell, Ludovicus, Cur. ger. miss. Savanna la Mar, Tof Hill, Black River, Orange Hill et Brighton MISSIO S. IGNATII Brown's Town P. O. P. Healy, Josephus L., Cur. ger. miss. Brown's Town, Alva, Murray Mountain, Linton Park, Refuge, Carnie, Fal mouth, St. Ann’s Bay et Ocho Rios MISSIO S. FAMILIAE Cassava River, Glengoffe P. O. P. Kelly, Franciscus J., Cur. ger. miss. Above Rocks, Cassava River, Tom’'s River, Friendship, King Weston et Devon Pen, Vis. schol. industr. ad Stony Hill, Exhort. monial. MISSIO B. V. M. AUXIL. CHRISTIAN Richmond P. O. P. Semmes, M. Oliverius, Cur. ger. miss. Richmond, Port Maria, Preston Hill, Donnington, Linstead. et May Pen Episc. 1 Sac. 19 Coadj. 2 Univ. 22"
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana R. P. Hanselman, Josephus F., Assist. Americ. Via S. Nicola Da Tolentino, 8, Rome, 30, Italy P. O'Rourke, Joannes J., Lect. ling. graec. bibl., Script., Cens libr. P. Sanders, Eduinus D., Agit biennium S. Script. an. 2 Colleg. Profess. Pont. Institut. Bibl. SS. Cord. Jesu Piazzo della Pilotta, 3S, Rome, 1, Italy P. Herzog, Carolus G. I., Agit biennium theol. an. 2 Via S. Nicola Da Tolentino, 8, Rome, 30, Italy In Austriae P. Swickerath, Robertus, Oper. Canisiusgasse 16, Wien IXJA, Austria In Canadensi P. McCaffray, Arthurus J., Mag. nov St. Stanislaus Novitiate, Guelph, Ont., Canada Purcell, Raymundus I., Audit. phil. an. 2 College de VImmaculee Conception, rue Rachel, Montrcal, Canada In Castellana Kearney, Jacobus H., Audit. theol. curs. maj. an. 1 Murray, Thomas J., Audit. theol. curs. maj. an. 1 Weber, Leo M., Audit. theol. curs. maj. an. 1 Colegio de San Francisco Javier, Ona, Burgos, Spain In Lugdunensi P. Walsh, Edmundus A., Agit. an. 3 prob Maison La Colombiere, Paray le Monial, Sabne et Loire, France "
    },
    {
        "text": "In Missouriana P. Bueno, Stephanus, Oper. Catholic Church, Conejos, Colo. Wheeler, Ludovicus A., Audit. theol. curs. min. an. 2 St. Louis University, St. Louis, Mo., In Missione Bombayensi P. Lynch, Dionysius, Paroch. ad S. Anna St. Mary's High School, Mazagon, Bombay, East India P. Parker, Herbertus J., Praef. stud. St. Stanislaus' Institution, Bandra, via Bombay, East India In Missione Japonica P. McNeal, Marcus J., Lect. in Universitate Kojimachi, Kioischo 7, Tokio, Japan In Missione Philippina Ateneo de Manila, Apartado 1S4, Manila, Philippine Islands P. Franciscus A. Byrne, Vice Rector P. Patritius Rafferty, Min P. Connor, Carolus F. P. Duffy, Eduardus P. P. Hohman, Arthurus J. P. Ott, Ludovicus P. Prendergast, Jeremias M. Claffey, Gualterus W. Downey, Morgan A. Gallagher, Carolus J. Goggin, Raymundus R. Hurley, Joannes F. Irwin, Henricus L. Pollock, Joannes A. Sac. 7 Schol. 7 Univ. 14"
    },
    {
        "text": " The Seminary, Vigan, Ilocos Sur, Philippine Islands P. Joannes J. Thompkins, Vice Rector P. Eduardus J. Moran, Min. P. Coffey, Henricus A. P. McNulty, Hugo J. P. Morning, Joannes A. Feeney, Thomas J. Hamilton, Gualterus J. Merrick, Josephus P. Sac. 5 Schol. 3 Univ. 8 Sac. 23 Schol. 15 Univ. 38"
    },
    {
        "text": "EX ALIIS PROVINCIIS IN NOSTRA DEGENTES Ex Angliae Watson, Vincentius, Schol. Ex Aragoniae P. Portas, Franciscus X. Ex Californiae P. Torre, Aloisius M. Ex Canadensi P. Downes, Franciscus J. Monaghan, Josephus, Schol P. Plante, Joannes B. Pieper, Carolus P., Schol Smith, Eric C., Schol. Ex Mexicana P. Caballero, Gustavus P. Heredia, Carolus P. Levain, Paulus V. Ex Missouriana P. Blakely, Paulus L. P. Joliat, Josephus S. P. Gerst, Franciscus J. P. Shyne, Cornelius A. P. Husslein, Josephus C. Shiple, Georgius J., Schol. Ex Neo Aurelianensi P. Francis, Georgius A. Greely, Jacobus, Schol P. Reville, Joannes C. Mulry, Aloisius J. Schol. P. Semmes, M. Oliverius Ruggeri, Gulielmus, Schol. Dougherty, Franciscus X., Schol."
    },
    {
        "text": "Ex Poloniae P. Warol, Aloisius P. Bielecki, Victor Malecki, Paulus, Coadj Ex Sicula P. Palermo, Stanislaus P. Bertolero, Cajetanus Biazzo, Augustinus, Coadj P. Longo, Henricus Quattrocchi, Rochus, Coadj Sac. 20 Schol. 9 Coadj. 3 Univ. 32"
    }
]