[
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana P. Boursaud, Eduardus V. Subst. secr. San Girolamo, Fiesole, Ituly In Austriaco Hungarica P. Brett, Gulielmus P. Ag. 3 an. prob. P. Conway, Joannes A. Haupstrusse Iu, Lainz, bei Wien, Austrid. Barrett, Timotheus B. Gasson, Thomas J. Universitatsstrasse S, Innsbruck, Tyrol In Neapolitana P. Bueno, Stephanus Oper. Islela, Tex. P Gunn, Franciscus P. P. Holland, Jacobus F. O'Connor, Gulielmus P."
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana P. Boursaud, Eduardus V. Subst. secr. Fesulis In Austriaco Hungarica P. Brett, Gulielmus P. Bien. recol. theol. scholast. P. Conway, Joannes A. Universitatsstrasse S. Innabruck, Tyrol In Taurinensi P. Holland, Jacobus F Oper Doc. rhet. angl. NN. Conf. in T. P. Voung, Edmundus J. Doc. rhet. in coll. S. Clarae Wall, Bernardus L. Schol. Cur. val. Santa Clara College, Santa Clara, Cal. In Veneta P. Muller, Augustus Doc. ling. lat., angl. et hist. in coll. S. Aloisii, Mangalore"
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana P. Brett, Gulielmus P. Bien. recol. theol. scholast. P. Conway, Joannes A. In Neapolitana P. Holland, Jacobus F. Oper. in resid. Isletensi Isleto, El Paso Co., Texas Deane, Ignatius P. Doc. elem., etc. in Coll. inchoat. SS. Cor dis An. 6 Morrison, Jefferson Co., Colo. Galligan, Joannes F. Doc. supr. gram. in Coll. Las Vegas An. 4 Las Vegas College, Las Vegas, N. M. In Taurinensi"
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana R. P. Hanselman, Josephus F., Assist. Americ. Via S. Nicola da Tolentino, 8, Rome, 30, Italy P. O'Rourke, Joannes J., Lect. ling. graec. bibl. et exeg. N. T., Script., Cens. libr. P. Sanders, Eduinus D., Agit biennium S. Script. an. 3 Colleg. Profess. Pont. Institut. Bibl. SS. Cord. Jesu Piazza della Pilotta, 35, Rome, 1, Italy "
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana R. P. Hanselman, Josephus F., Assist. Americ. Via S. Nicola Da Tolentino, 8, Rome, 30, Italy P. O'Rourke, Joannes J., Lect. ling. graec. bibl., Script., Cens libr. P. Sanders, Eduinus D., Agit biennium S. Script. an. 2 Colleg. Profess. Pont. Institut. Bibl. SS. Cord. Jesu Piazzo della Pilotta, 3S, Rome, 1, Italy "
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana R. P. Hanselman, Josephus F., Assist. Americ. Via S. Nicola Da Tolentino, 8, Rome, 30, Italy P. O'Rourke, Joannes J., Lect. ling. graec. bibl., Script., Cons. an. 3 Colleg. Profess. Pont. Institut. Bibl. SS. Cord. Jesu Piazza della Pilotta, 35, Rome, 1, Italy P. McCormick, Vincentius A., Agit biennium theol. an. 2 P. Parsons, Josephus W., Agit biennium theol. an 2 Via S. Nicola Da Tolentino, 8, Rome, 30, Italy P. Herzog, Carolus G. I., Agit biennium theol. an. 1 P. Sanders, Eduinus D., Agit biennium S. Script. in Institut. Bibl. SS. Cord. Jesu. an. 1"
    }
]