[
    {
        "text": "1881"
    },
    {
        "text": "R. P. ROBERTUS W. BRADY PRAEPOSITUS PROVINCIALIS A Die 8 Maii, 1877. College of St. Francis Xavier 49 W. 15th St., New York City. P. JACOBUS A. WARD Socius Adm. Cons. Prov. CONSULTORES PROVINCIAE P. SOCIUS R. P. PROVINCIALIS a die 21 Nov. 1877 P. RECTOR COLL. S. JOANNIS Fordham 6 1879 P. RECTOR COLL. SS. CORD. Woodstock "
    },
    {
        "text": "IN STATU NEO EBORACENSI COLLEGIUM NEO EBORACENSE et Residentia ad S. Francisci Xaverii COLLEGE OF ST. FRANCIS XAVIER, 49 W. 15th STREET, NEW YORK CITY. P. Samuel Frisbee Rect. a die 28 Augusti, 1880 Proc. coll. Praef. stud. P. Joannes B. Jungck Min. Praef. eccl. et val. Dirigit mu sicam Cons. dom. an. 1. P. Augustinus Regnier Oper. in xenod. et carcer. in insula Blackwell. P. Augustus Thebaud Oper Praef. bibl. Conf. NN. Scriptor Cons. dom. an. 3. P. Carolus H. Denny Oper Conc. et conf. in T. Cur. ger. schol. paroch Praes. sod. filiar. Mariae Conf. monial. SS. Cordis. P. Carolus O'Connor Praef. stud. inf. et disciplinae Praef. confrat. bonae mortis Praef. lect. ad mens Cons. dom. an. 2. P. Franciscus Michel Oper. in xenod. et carc. in insula Hart Adj. in aliis ins Conf. in T. Conf. sor. praesent. P. Hector Glackmeyer Oper Conf. et conc. in T. Praes. sod. SS. Sitis et Consol. Mariae P. Henricus Duranquet Cur. ger. miss. insul Oper. in carc. et xenod."
    },
    {
        "text": "P. Isidorus Daubresse Oper Conf. NN. et in T. et soror Carit. Praes. coll. cas. consc. pro NN. et sac. saecul Praes. archisod. SS. Cordis, Apost. prec., et mut. aux. pro faeminis. P. Joannes Holzer Oper. in xenod. P. Josephus Jerge Submin Lect. ethic Adj. praef. pro curs. comm. et praepar Conf. in T. Explic. cat. FF. Doc. ling. germ Praes. sod. S. Aloys Cat. et conf. puell. in acad. SS. Cordis. P. Josephus Prachensky Oper. in carc. et xenod. in insula Ward. P. Josephus Shea Lect. log, metaph. et evid. religionis Conf. NN. et in T. Conc Praes. coll. cas. pro sacerd. saecul. P. Josephus Vetter Oper. in xenod. et carcer. in insula Black well. P. Mauritius Ronayne Adm. Praef. spir. et conf. NN. Lect. hist. P. Patritius Dealy Cur. paroch. ger Praes. sod. vet. alumn. Moder. Union. Cathol. et Xav. Socior Praes. sod. S. Rosarii Conf. et conc. in T. Cons. dom. an. 1. P. Patritius McQuaid Oper Adj. praef. biblioth. P. Raphael Gelinas Oper. in insul. Randall et Ward Conf. sor. Carit. et Praesent. P. Theodorus Thiry Oper Praes. sod. viror. et mut. auxil. viror Mod. acad. et sod. jun. opific., sodal. pueror. paroch. et soc. S. Inf. et sod. Infantis Jesu Conf. NN. MAGISTRI ET PRAEFECTI P. Gulielmus Pardow Doc. rhet. an 1. mag. Mod. acad. phil. et rhet. Doc. evid. relig. Mod. sod. 1 alumn. Exhort. et conc. alumn."
    },
    {
        "text": "Raphael O'Connell Doc. human. an. 2 mag. Mod. 2 sod. alumn. Coll. pp. pro litt. ann. Script. hist. dom. Michael O'Brien Doc. supr. gram. an. 3 mag. Praef. bibl. alumn. Gulielmus F. Gregory Doc. med. gram. an. 3. mag. Bid. Patritius J. McGinney Doc. inf. gram. 1 cl. an. 1 mag. P. Hugo Langlois Doc. special. lat. curs. an 11 mag. Daniel McGoldrick Lect. chym. et scient. nat. Gulielmus Walsh Adj. praef. et direct. music. Praef. minis. ad altare. Joannes Whitney Adj. praef Lect. math. sublim. P. Petrus Kerr Expectat destinationem. COADJUTORES Aemilius Risler Doc. callig. Vis. exam. vesp. Ad dom. Conradus Meyer Cust. vest. Franciscus McCloskey Adj. arcul Ad dom. Gulielmus Rache Pictor Ad dom. Joannes Dowdle Adj. proc Praef. quaest Aedit. sac. dom. Vis. orat Ad dom. Joannes Flood Ad omnia. Joannes Welsh Praes. fam Coement. Cur. forn. Josephus Koerner Adj. proc. Ad dom. Matthaeus O'Connor Adj. inf. Ad omnia. Michael Rogers Arcul. Ad dom. Nicolaus Litique Sartor Infirm. Ad dom. Onesymus Thibault Aedit. Adj. disp. Patritius Souren Coq. Senanus Mangan Empt. Disp. Manud. Thomas Gormley Fab. plumb Excit. Visit. exam. merid. Ad dom. Thomas McShane Cust. tricl. Timotheus McNamara Ad dom. PP. 23. Schol. 7. Coadj. 17. Univ. 47."
    },
    {
        "text": "COLLEGIUM FORDHAMENSE AD S. JOANNIS Convictus et Residentia ST. JOHN'S COLLEGE, FORDHAM, NEW YORK. P. Frid. Gulielmus Gockeln Rector a die 25 Junii, 1874. P. Henricus Kavanagh Min Praef. eccles. et val. NN. Cur. ger. eccl. paroch Conf. alumn Cons. dom. an. 1. P. Blasius Schiffini Lect. log. et metaph Supp. lect. ethic. Conf. NN. Mod. 2 sod Praes. coll. cas. consc. P. Ludovicus Jouin Adm. Praef. spir. et conf. NN. Lect. ethic. Praef. biblioth. Conf. alumn. P. Michael P. Costin Lect. math. subl. Conf. NN. Exhort. et conf. alumn. Praef. lect. ad mens Catech. et conf. surd. et mut. Neo Eborac. P. Nicolaus Hanrahan Proc. Conf. NN. et filiar. S. Cord. Mariae Cons. dom. an. 6. P. Patritius A. Halpin Praef. stud., discip. et val. alumn. Exhort. alumn Submin Cons. dom. an. 1. P. Thomas J. Freeman Lect. scient. nat. et evid. relig. Conf. puell. in acad. Ursulin. MAGISTRI P. Michael J. Byrnes Doc. rhet. an. 12 mag. Mod. acad. phil. et rhet Expl. catech. FF. Exhort. et conf. alumn. P. Patritius O'Reilly Doc. hum. et geom. an. 6 mag. Mod. 1 Sod Conf. NN. Exhort. et conf. alumn. Script. hist. dom."
    },
    {
        "text": "Franciscus W. Gunn Doc. super. gram. an. 3 mag. Doc. ling. gall Coll. pp. pro litt. ann. Expl. med. FF. Josephus Zwinge Doc. med. gram. et ling. germ. an. 2 mag. Adj. praef. alumn. Carolus S. Williams Doc. inf. gram. 1 cl. an. 3 mag. Praef. minist. ad altare Adj. praef. alumn. Georgius Lucas Doc. inf. gram. 2. cl. an. 3 mag Adj. praef. alumn. Joannes C. Keveney Doc. hum. in curs. comm. et algebr. Leg. com. et comp. lib Praef. musicae. Joannes Scully Doc. spec. lat. schol. an. 1 mag. Lect. hist. phil. et rhet Mod. soc. hist. et soc. dram. Mod. 3 sodal. PRAEFECTI Daniel M. McElhinney Doc. arith. Supp. mag. Georgius E. Quin Doc. callig. Stud philos. Gulielmus J. Richley Doc. in curs. comm. Jeremias F. A. Coleman Doc. ling. gall. et in curs. comm Suppl. mag. Thomas W. Wallace Stud. priv. Et praeterea DD. auxiliares 5. COADJUTORES Antonius Dooher Pistor. Dionysius Hogan Arcul. 2 Visit. orat. Ad dom. Fridericus de Pooter Hortul. botan Ad dom. Fridolinus Haefele Arcul 1 Ad dom. Gulielmus Hennen Ad dom. Henricus McCabe Adj. inf. Pictor Ad omn. Jacobus Early Coq. Praes. hort. Jacobus Egan Adj. coq."
    },
    {
        "text": "Jacobus Mallen Cust. tricl. Joannes Sheerin Aedit. Sartor Vis. exam. merid. Josephus Bradley Aedit. in eccl. Praef. quaest. Josephus Byrne Adj. cust. tricl. Ad omn. Julius Mace Doc. music. Excit. Ad dom. Leo Kutter Cust. vest. NN. Adj. cust. vest. alumn. et disp. Vis. noct. Ludovicus Kaiser Cust. vest alumn Adj. cust. vest. NN. Matthaeus Gilshannen Disp. Mauritius Roach Infirm. Nicholaus Paradise Sutor Empt. Patritius Corrigan Caement. Ad omn. Patritius Muldoon Villicus. Patritius Smith Cur. forn . Ad dom. Philippus Ledore Cur. valet. Thomas Hallahan Adj. villici Vis. exam. vesp. Ad omn. PP. 10. Schol. 11. Coadj. 23. Univ. 44. RESIDENTIA AD S. LAURENTII NEO EBORACENSIS ST. LAURENCE'S CHURCH, EAST 84th STREET, NEW YORK. P. Carolus Petitdemange Min. Oper. Cur. ger. paroch. Conf. puell. acad. sor. de Merced Praes. sod. ma tron., SS. Cordis et Ros Mod. sod. puell. P. David Walker Submin Oper Praes. conf. bon. mort., sod. puer. et Soc. Temp Expl. cat. FF Cur. ger. schol Cons. dom. an. 2."
    },
    {
        "text": "P. Allanus McDonell Oper Catech. puer. et puell. schol. Conf. monial. de Merc. et Carit. Expl. med. FF Cons. dom. an. 2. P. Gulielmus Moylan Oper Adm. Praes. coll. cas. consc. Praef. spir. et bibl. P. Joannes H. Finnegan Oper Mod. sod. et soc. Cathol. juv. Coll. pp. pro. litt. ann. Script. hist. dom. Cons. dom. COADJUTORES Carolus Brendle Vis. or. et exam. Excit. Ad dom. Joel Miville Aedit Cust. vest. Ad dom. Michael Kays Jan. Ad dom. Patritius Farrell Coq. Empt. Disp. Ad dom. PP. 5. Coadj. 4. Univ. 9. RESIDENTIA AD S. JOSEPHI NEO EBORACENSIS ST. JOSEPH'S GERMAN CHURCH, EAST 87th STREET, NEW YORK CITY. P. Josephus Durthaller Sup. a die 31 Julii, 1874 Cur. ger paroch. Conf. monial. bon. past Proc Oper. P. Jacobus Simeon Oper Conf. poenit. et puell. bon. past. P. Joannes Hackspiel Oper Conf. poenit. et puell. bon. past. PP. 3."
    },
    {
        "text": "DOMUS PROBATIONIS S. P. IGNATII ad West Park MANRESA, WEST PARK, ESOPUS P. O., ULSTER COUNTY, N. Y. P. Patritius Gleason Rect. a die 8 Sept., 1880 Mag. nov. P. Paulus Mignard Cur. val. Conf. NN. P. Raphael Dewey Min Proc. Soc. mag. nov. Praef. lect. ad mens. Conf. NN. Stud. priv. COADJUTORES VETERANI Dominicus Leischner Disp. Hortul. Gulielmus Donovan Adj. villic. Ad dom. Jacobus McCloskey Manud. nov. coadj. Villic Empt. Infirm. Vis. noct. Joannes Langan Arcul. Ad omnia. Joannes O'Connell Adj. villic. Excit. Joannes Paffe Cust. vest. Sart. Excit. Ricardus Purcell Adj. villic. Ad dom. NOVITII SCHOLASTICI Cornelius Clifford, Eduardus Kane, Gulielmus Cunningham, Gulielmus Ennis, Gulielmus McDonough, Gulielmus Richmond, Jacobus Mugan, Patritius J. Casey, Ricardus Ryan, Thomas Cryan, Joannes Brosnan,"
    },
    {
        "text": "Rufus Duff, Eduardus Reynaud P. Joannes Harpes, P. Franciscus Tolle P. Aloysius Bradley, Alexius J. Myers. Franciscus X. Aigner, David Hearn, Georgius Mulry, Georgius Pettit, Henricus Judge, Jacobus Deck, Jeremias O'Connor, Thomas Burke, Michael Donar, Eduardus Corbett Edmundus Burke, Joannes Simmons, Patritius Cormican, Franciscus Lubbe, Jacobus R. Gray, Carolus Mackin, COADJUTORES NOVITII Geraldus Barry, Thomas Murray, Jacobus O'Brien Josephus Mooney, Petrus Tansey, Jacobus Dwyer, Petrus Hayes, Joannes Hilbers"
    },
    {
        "text": "Patritius Fitzgerald, Jacobus McNulty, Patritius McCann, PP. 6. Schol. 29. Coadj. 18. Univ. 53. RESIDENTIA TROJANA AD S. JOSEPHI ST. JOSEPH’S CHURCH, TROY, N. Y. P. Josephus Loyzance Super. a die 30 Julii, 1876 Cur. ger. utriusque paroch. Praes. soc. S. Vinc. et S. Jos. Proc. Oper. P. Franciscus Marechal Oper Cur. vicesger. annex. S. Michael Praes. conf. bon. mort., Ros, et sod. puer. Cons. dom. P. Josephus Delabays Oper Praes. coll. cas. consc. Conf. sor. S. Jos. ac in xenod. et orphan Cons. dom. P. Michael Nash Oper Praes. sod. juv., soc. Ros. et sod. SS. Cordis Cons. dom. COADJUTORES Franciscus X. Brady Aedit. in eccl. S. Michael Hortul Vis. orat. et exam Ad dom. Martinus Ealy Coq. Cust. tricl. Ad dom. Thomas Hogue Aedit Empt Disp. Cust. vest. Vis. noct Janit. Excit. PP. 4. Coadj. 3. Univ. 7."
    },
    {
        "text": "IN DISTRICTU COLUMBIAE COLLEGIUM GEORGIOPOLITANUM et Convictus GEORGETOWN COLLEGE, D. C. P. Patritius F. Healy Rect. a die 31 Julii, 1874 Cens. libr. Praes. con. mod. Miss. Ind. Cath. P. Gulielmus T. Whiteford Min Praef. stud., schol. et val. Catech. conv. maj Cons. dom. an. 1. P. Benedictus Guldner Lect. log, metaph. et eth. Conf. NN. Conf. et conc. in sac. P. Jacobus Clark Cur. val. P. Jacobus Curley Adm Dir. Spec. astr Cust. virid. hot. Conf. NN. P. Joannes B. Mullaly Proc. Script. hist. dom. Doc. ling. gall. 3. cl. Cons. dom. an. 6. P. Petrus J. Blenkinsop Praef. spir. et conf. NN., ord. mon. Visit. et in sac. Praes. coll. cas. consc. Henricus T. B. Tarr Lect. chym. et math. 1 cl. Josephus H. Richards Lect. phys. et math. Catech. FF. MAGISTRI P. Jacobus A. Doonan Doc. rhet. an. 14 mag. Conf. NN. Conf. et conc. in sac. et in eccl. mon. Visit. Praef."
    },
    {
        "text": "lect. ad mens Praef. odei Mod. soc. Philod. Conf. extraord. ad mon. Visit Exhort. NN. Cons. dom. an. 2. Joannes F. X. O'Conor Doc. hum. an. 3 mag. Praef. bibl. Praes. sod. B. V. M. alumn. min. Franciscus B. Goeding Doc. sup. gram. an. 2 mag. et ling. germ. P. Samuel Cahili Doc. med. gram. an. 3 mag. et math. 3 el Submin Coll. pp. pro litt. ann. Jacobus T. Gardiner Doc. inf. gram. an. 2 mag. et 1 cl. arith. P. Carolus P. Bahan Doc. rud. 1 cl. an. 7 mag. et math. 2 cl. Conf. in sac Cons. dom. an. 2. Joannes M. Colgan Doc. rud. 2 cl. an. 1 mag. P. Michael Flynn Doc. ling. gall. 1 cl. et arith. 3 cl. Praes. sod. B. V. M. conv. maj. David C. Daly Doc. alg. et ling. gall. 2 cl. PRAEFECTI P. Gulielmus R. Cowardin Praef. 1. conv. maj. Catech. conv. min Doc. arith. 2 cl. P. Michael Flynn, Jacobus T. Gardiner Joannes M. Colgan, P. Carolus P. Bahan Praef. 1. conv. min. David C. Daly. COADJUTORES Aloysius Roth Cust. vest. alumn. min. Cur. baln. et lavacr. Antonius McNerney Infirm Ad dom. Bartholomaeus Doyle Cur. val. Daniel Clarke Cur. val. Georgius F. Schaffner Dispens. Coq. Gulielmus Dugan Ratioc. Soc. proc."
    },
    {
        "text": "Gulielmus McElaney Cust. tricl. alumn. Excit. Jacobus Marley Aedit. Soc. cust. tricl. NN. Jacobus O'Sullivan Faber lign. Jacobus T. O'Sullivan Faber ferr. Ad dom. Joannes Daly Cur. val. Patritius Sears Cust. tricl. NN. et cell. vin. Ricardus Dugan Cust. vest. et lavac Vis. med. et exam. Ad dom Excit. Thaddaeus McKenna Adj. cust. vest. et lavac. Ad dom. Thomas Dougherty Sut. Comp. libr Empt. Ad dom. Thomas Gavan Pistor Ad dom. Thomas Shanahan Ad dom. PP. 12. Schol. 7. Coadj. 17. Univ. 36. RESIDENTIA GEORGIOPOLITANA AD SS. TRINITATIS TRINITY CHURCH, GEORGETOWN, D. C. P. Antonius F. Ciampi Min Proc. Praef. eccl Oper. Praes. schol. puer. ad SS. Trin Praes. sod. bon. mort. confr. B. P. Claver et S. Caeciliae. P. Aloysius Rocoffort Oper Praes. schol. dom. Conf. soror. pauper. et mon. Visit. Washington Praes. sod. B. V. M. Martinus Whelan Coadj. Aedit. Ludim Ad dom. PP. 2. Coadj. 1. Univ. 3."
    },
    {
        "text": "COLLEGIUM WASHINGTONIENSE GONZAGA COLLEGE, WASHINGTON, D. C. P. Carolus K. Jenkins Rect. a die 2 Feb. 1875 Proc. Praef. stud Conf. disc. et in T. Conf. extra. mon. Visit. Praes. sod. B. V. M. puell. Praes. schol. dom. P. Joannes S. Sumner Oper. P. Patritius Forhan Oper Praes. sod. B. V. M. vir. et ma tron Cons. dom. an. 4. P. Robertus F. Byrne Oper Praes. schol. paroch. P. Stephanus A. Kelly Oper. Praef. eccl. Praes. sod. bon. mort., apost. orat., B. V. M. juv. vir. et mul Catech. puell. in schol. paroch. Conf. NN. et discip. Cons. dom. an. 3. MAGISTRI P. Daniel Lynch Adm. Doc. supr. gram. Conf. NN. puell. in acad. Visit. et in T. Praef. spir. et bibl. Cons. dom. an. 19. Arthurus J. MacAvoy Praef. schol Doc. med. gram. an. 2. mag., alg. et ling. gall. 1. cl Mod. soc. Phocion Catech. discip. Cornelius Gillespie Doc. inf. gram. an. 2. mag. et arith. 3 cl. Praes. sod. B. V. M. juv. Gulielmus H. Judge Doc. rud. an. 4 mag., arith. 1 el. et ra tioc Cust. sac. Franciscus W. McGurk Doc. rud. an. 3 mag. et arith. 2 cl. Bidellus. Franciscus X. A. Brady Doc. rud. 1 cl. an. 2 mag., math. 2 et 3 cl. et ling. gall. 2 cl. Script. hist. dom Coll. pp. pro litt. ann Mag. caerem Praef. min Mod. acad. jun. Gonz."
    },
    {
        "text": "PRAEFECTI Cornelius Gillespie. Franciscus W. McGurk, COADJUTORES Joannes Quin Aedit Ad dom. Thomas Kelly Coq Cust. tricl. et cell. vin. Excit. PP. 6. Schol. 5 Coadj. 2. Univ. 13. RESIDENTIA AD S. JOSEPHI ST. JOSEPH'S CHURCH, C 2d N. E., WASHINGTON, D. C. P. Joannes P. M. Schleuter Min Proc. Praf. eccl. Oper Praes. sod. B. V. M. puell. et viror, confr. bon. mort. et S. Vincent Conf. NN. Praes. et catech. schol. paroch. P. Josephus Busam Oper. Praes. sod. B. V. M. juv. et ma tron Conf. NN Catech. in T. et schol. paroch. Henricus Rimbaugh Coadj Ad omnia. PP. 2. Coadj. 1. Univ. 3."
    },
    {
        "text": "IN STATU MARYLANDIAE COLLEGIUM BALTIMORENSE LOYOLA COLLEGE, BALTIMORE, MD. P. Eduardus A. McGurk Rect. a die 10 Oct. 1877 Praef. stud. et schol Proc. coll. Conf. et conc. in T. P. Augustus Langcake Min Asst. proc. coll. Praef. val. et lect. ad mens. Cons. et conc. in T. Praef. sod. B. V. M. in T. Cons. dom. an. 1. P. Antonius Van de Heuvel Cur. val. P. Eduardus J. Sourin Oper. Conf. NN. et in T Vis. in carc. P. Gulielmus F. Clarke Praef. spir Oper. Conf. et conc. in T. Conf. NN. Catech. discip Praes. coll. cas. consc. P. Thomas M. Sheerin Praef. eccl Oper. Conf. et conc. in T. Praes. sod. bon. mort. et conf. SS. Cord. et Apost. Orat. Conf. NN. Cons. dom. an. 6. Carolus C. Lancaster Proc. prov Admin. bon. Theobaldus M. McNamara Lect. phys. et chym. Doc. math. 1 cl. Praef. odei. Thomas W. Hayes Soc. proc. prov."
    },
    {
        "text": "MAGISTRI P. Henricus Shandelle Doc. rhet. an. 7 mag., algeb., ling. germ. et eloc. 1 cl. Praef. soc lit Praef. schol. domi nic. et Sod. juven Cons. dom. an. 1. Patritius J. Dooley Doc. hum. an. 4. mag., arith. 1 cl. et ling. ang. 1 cl Praef. atrii Vis. med. et. exam. Joannes O'Rourke Doc. supr. et med. gram. an. 1 mag., ling. gall. 1. cl. et math. 2 cl Asst. praef. atrii Praef. sod. discip. Gulielmus Quigley Doc. inf. gram. an. 1 mag., ling. gall. 2 cl., math. 3cl. et ling. angl. 2 cl. Praef. bibl Asst. praef. odei. Michael A. Noel Doc. rud. 1. cl. an. 1 mag., arith. 3 cl. Script. hist. dom Asst. praef. bibl. Carolus C. Jones Doc. rud. 2 cl. an. 3 mag., arith. 2 cl., ling. ang. 3cl. et eloc. 2 cl. Magist. caerem. et praef. min. COADJUTORES Daniel McLaughlin Ad dom. Edmundus Shanahan Cog. Joannes Fortescue Soc. proc. coll. Empt. Ratioc. Laurentius Gutting Sart. Cust. vest Aedit. sac. dom Excit. Ricardus O'Connell Fab. lign. Aedit. Timotheus Sullivan Cust. cell. vin. Ad dom. Vis. noct. PP. 7. Schol. 8. Coadj. 6. Univ. 21."
    },
    {
        "text": "DOMUS PROBATIONIS FRIDERICOPOLITANA NOVITIATE, FREDERICK, MD. P. Archibaldus J. Tisdall Rect. a die 1 Oct. 1877 Mag. nov. P. Josephus M. Colle de Vita Inst. PP. tert. prob. Praef. Spir Conf. NN. Praes. coll. cas. consc Adm. P. Gulielmus H. Sumner Min. Soc. mag. nov Proc. Praef. val. et bibl. Conf. puell. in acad. Visit. Cons. dom. an. 2. P. Albertus Peters Praef. eccl Oper. Praes. schol. S. Joan. et sod. SS. Angel. Conf. NN Cons. dom. an. 1 P. Bernardus Toale Oper Coll. pp. pro litt. ann. P. Eduardus V. Boursaud Doc. rhet. Praef. schol. et stud. Sup. jun Praef. lect. ad mens. et ton Praes. sod. B. V. M. ad S. Joan. Exhort. puell. in acad. Cons. dom. an. 1. P. Joannes B. de Wolf Oper Excur. ad S. Jos., Middle town et Urbana Conf. NN. Michael P. Hill Doc. hum. PATRES TERTIAE PROBATIONIS. P. Andreas P. Keating. P. Dionysius A. Kelley. P. Franciscus Casey, P. Franciscus Ryan. P. Gulielmus H. Carroll Praef. P. Jacobus A. McHugh, P. Joachim Pont, P. Josephus Winkelried."
    },
    {
        "text": "AUDITORES RHETORICAE Anno Secundo Daniel A. Doherty, Josephus J. Prendergast, Josephus Renaud, Eduardus Magrath, Gulielmus Duffy, Josephus Stadelman, Henricus Rache, Josephus V. Schmidt, Jacobus Mulvaney Ludovicus Weber, Joannes Pittar Patritius Mulry, Josephus A. Gorman Bid. Thomas Callanan, Josephus A. Mattson Cust. sac. B. V. M. Thomas J. Walsh. Anno Primo Carolus Murray, Joannes Greene, Florentius J. Crowley, Joannes Griffin, Franciscus H. McGovern, Joannes Nicholson, Gulielmus Coyle, Joannes T. Hedrick Gulielmus Curley, Josephus Hanselman Subbid. Ignatius G. Bergan, Michael Cunningham, Ignatius P. Deane, Milesius A. McLaughlin, Jacobus V. Kelly, Petrus A. Roche, Petrus Kayser, Joannes B. Lamb Mag. caer. Joannes Condon, Stephanus Bueno, Thomas Harlin. Joannes F. Mahan, COADJUTORES VETERANI Blasius Walch Fab. horol. Franciscus Bausenwein Sartor Excit. Franciscus F. Bowes Infirm. Franciscus X. Scheuren Dispens Aedit."
    },
    {
        "text": "Jacobus Doyle Adj. sut Vis. mat. Joannes Derks Cur. val. Joannes Hogan Coq. Joannes O'Sullivan Cur. val. Joannes Rowley Ad dom. Joannes Sheehy Ludim. ad S. Joan. Martinus O'Neill Hortul. Ad dom. Michael Carroll Cur. val. Michael Ryan Sutor Vis. noct. Ricardus Barrett Ludim. ad S. Joan. Thaddaeus Begley Janit. Ad dom. Thomas Carberry Adj. hortul Ad dom. Thomas Kennedy Empt Cust. vest Ad dom. Virgilius S. Gouldin Manud. coadj Fab. lign. Vis. med. et exam Soc. aedit. NOVITII SCHOLASTICI Joannes C. Downs, Joannes S. Coyle, V. Howard Brown, P. Jacobus Holland. Eugenius L. French Jacobus J. O'Connor, Joannes B. O'Leary, Thomas P. Kernan, Patritius J. O'Sullivan, P. Joannes A. Jansen, P. Dominicus P. Coppens ad Woodstock P. Joannes F. Baxter, Franciscus Barnum, Audenus A. Hill, Gulielmus P. O'Connor,"
    },
    {
        "text": "Jacobus J. Byrne, Joannes S. Hollohan, Michael P Nolan, Thomas G. Salter, Carolus B. Macksey, Daniel R. Campbell, Eduardus M. Kelly, Gualterus S. Clarke Jacobus A. Gillespie Joannes W. Kolb, Eduardus P. Lamb, Joannes A. Moore COADJUTORES NOVITII Joannes F. Harkins, Michael P. Hogan G. Aloysius Fortier, Josephus E. Clocker, Joannes O'Sullivan Josephus A. Vigeant, PP. 18. Schol. 62. Coadj. 24. Univ. 104."
    },
    {
        "text": "COLLEGIUM SACRATISSIMI CORDIS JESU WOODSTOCK COLLEGE, HOWARD CO., MD. 1 P. Jacobus Perron Rector a die 22 Aprilis, 1875 Cons. prov. P. Patritius H. Toner Min Proc Praef. val. Cons. dom. an. 2. P. Aemilius M. de Augustinis Lect. theol. dogm. pomer Conf. et exam. NN. Cens. lib. Excurr. ad Elysville Cons. dom. an. 3. P. Aloysius Sabetti Lect. theol. mor. et jur. canon Praes. coll. cas. consc. et acad. sac. rit Cens. libr. Conf. NN. Praef. sac. dom. P. Benedictus Sestini Lect. astr., math. elem. et sublim. et hist. nat. Conf. NN. Direct. gen. Apost. Orat Red. MESSENGER. P. Carmelus Polino Lect. log. et metaph. gen Cens. libr. P. Carolus Piccirillo Praef. stud. et bibl. Lect. S. Script. Cens. libr. Exam. NN. Praes. acad. lat. pro phi los Cons. dom. an. 2. P. Dominicus Pantanella Lect. theol. dogm. mat. Conf. et exam. NN Praef. spir. FF. coadj Cens. libr. Cons. dom. an. 3. P. Eduardus I. Devitt Lect. metaph. spec. 2 an Exam. NN. Praef. lect. ad mens Red. WOODSTOCK LET TERS Scrip. hist. dom Coll. pp pro. litt. ann. P. Gulielmus Loague Oper. Conf. et conc. in sac Excurr. ad Sykesville. P. Hugo L. Magevney Lect. hist. eccl. et eloq. sacr. pro"
    },
    {
        "text": "theol Praef. ton. et conc. Praes. acad. elocut. pro philos P. Januarius Degni Lect. phys., chym. et phys. math. P. Joan. Bapt. Miege Adm. Praef. spir. Conf. NN. P. Salvator Brandi Lect. theol. dogm. comp. et ling. hebr Praes. acad. hebr. Exam. NN Excurr. ad Har risonville. AUDITORES THEOLOGIAE Anno Quarto P. Henricus Moeller Expl. pp. med. FF. coadj. P. Hieronymus Daugherty Cat. puer. ad Elysville Mod. acad. cant. eccl. P. Jacobus A. Dowling Expl. catech. FF. coadj. P. Jacobus B. Becker Cat. puer. ad Marriotsville. P. Joannes Brislan, P. Joannes Frieden Mod. 1 acad. cant. eccl. P. Patritius Murphy P. Timotheus O'Leary. Anno Tertio Joannes Hogan, Thomas H. Stack Bid. sch. script. sac. et jur. can. Cat. puer. ad Elysville. Anno Secundo Aloysius Robaut Vis. med. et exam. Daniel McErlane, Eduardus Connolly, Hermannus Blumensaat Vis mat. et noct. Jacobus Hoeffer Vis. med. et exam. Joannes A. Conway,"
    },
    {
        "text": "Michael A. O'Kane Catech. puer. ad Marriotsville. Michael P. Dowling Bid. sch. theol. dogm. Vis. med. et exam. Nicolaus Schlechter Vis mat. et noct. Thomas Fitzgerald, Thomas O'Callaghan. Anno Primo Alexander Freund, Dominicus Giacobbi, Jacobus O'Sullivan. Joannes J. Becket Bid. sch. hist. eccl. et ling. hebr. Michael O'Neil, Sanctes Filippi. AUDITORES THEOL. DOGM. COMPENDIOSAE Anno Tertio P. Dominicus Coppens, Fabianus S. Noel P. Gulielmus Treacy Ludovicus Leblanc, Patritius O'Connell, Petrus Cooney Explic. catech. famul. Thomas Flynn. Anno Secundo Carolus Klein Adj. praef. sac. dom. Eduardus McTammany Bid. theol. Franc. Sales. Fullerton, Jeremias Driscoll, Joannes Fox."
    },
    {
        "text": "Anno Primo Aloysius Garceau Praef. bibl. theol. Aloysius Jacquet Praef. bibl. ad jan. Andreas Rapp Bid. sch. theol. dogm. comp. Angelus Coltelli, Henricus Rigues, Hubertus Heidenreich, J. Rodericus Roy, Michael Mulry Robertus Pardow Bid. sch. theol. mor. AUDITORES PHILOSOPHIAE Anno Secundo Alfredus Blatter, Augustinus Effinger Cat. puer. ad Woodstock Vis. mat. et exam. Augustinus K. Meyer, Cornelius B. Sullivan, Eduardus Gaffney, Franciscus J. Cummings, Franciscus Klocker, Franciscus Powers Praef. odei. Fridericus Tourtelot Cust. coll. miner. Gulielmus Clark Adj. cust. sac. mort. Gulielmus Power Bid. sch. metaph. Gulielmus Rogers Cat. puer. nig. Vis. med. et exam. Henricus de Laak Bid. schol. chym. Jacobus Corbley Cat. puer. ad Harrisonville. Jacobus Power Jacobus V. O'Connell. Joannes Clarke, Joannes Hart Cat. puer. ad Woodstock."
    },
    {
        "text": "Joannes Rodock, Joannes Wynne Cust. sac. mort. Cat. puer. nig. Nicolaus Davis Subbid. phil. Patritius Casey, Patritius Kelly Adj. praef. bibl. dom. Philippus Cappel, Thomas Murphy Bid. phil Cat. puer. ad Woodstock. Anno Primo Abraham Emerick Cust. sac. SS. Cordis. Alexius de Stockalper, Aloysius Brosnan Cust. sac. S. Josephi. Aloysius Rotter. Antonius Maas Praes. 1 acad. graec. Dionysius McCarthy Cat. puer. ad Harrisonville Vis. mat. et noct. Dionysius O'Sullivan Cat. puer. ad Harrisonville Vis. mat. et noct. Eduardus Spillane Praef. bibl. phil. Emmanuel de la Moriniere Praes. 2. acad. graec. Franciscus Berberich Vis. med. et exam. Georgius Hoeffer, Gulielmus Cornell, Gulielmus Gannon, Gulielmus Hayes Gulielmus Hoffend Gulielmus Mullan, Gulielmus Stanton Praef. off. ad comp. libr. Vis. med. et exam. Gulielmus Tyrrell, Henricus Van Rensselaer. Joannes B. Kokenge, Joannes Collins, Joannes D. Mathery,"
    },
    {
        "text": "Joannes F. Quirk, Joannes Galligan, Joannes O'Gorman, Josephus F. Weber Bid. schol. Josephus Hann Josephus Woods Martinus Hollohan Cust. sac. Im. Conc. Michael Conway, Michael O'Connor Patritius Boyle, Patritius Kernan, Patritius McQuillan, Patritius Murphy. Patritius O'Leary, Thomas Gasson, Thomas Haggerty, Thomas E. Sherman, Thomas McLoughlin, Timotheus Barrett Cust. sac. SS. Ang. COADJUTORES Alexander Walsh Cust. vest Jan. 2 Ad dom. Antonius Romano Cur. val. Bernardus Gaffney Adj. hortul. Cajetanus Campone Praef. tricl. Excit. Cornelius Reardon Adj. proc. Daniel Fortescue Adj. red. MESSENGER Ad dom. Daniel Mason Aedit. Pict. Eduardus Green Adj. aedit. Ad dom. Elias Cote Adj. infirm. Gulielmus Hill Fab. fer Vis. med., exam. et noct. Excit. Henricus Dugan Ad dom."
    },
    {
        "text": "Jacobus O'Kane Typogr. Jeremias Flaherty Coq. Joannes Cunningham Infirm. Joannes Mattingly Adj. villic. Joannes Siebers Hortul. Michael Foley Cur. val. Michael Keenan Ad dom. Patritius Cassidy Ad dom. Patritius Gilmore Arment. Patritius McGlone Cust. cell. vin Jan. 1 Adj. lect. phys. Comp. libr. Raphael Vezza Arcul. Theodorus Vorbrinck Villic Empt. Excit. Thomas Crowley Sutor. Thomas Ekins Sartor. PP. 24. Schol. 104. Coadj. 25. Univ. 153. MISSIONES PAROCHIALES in Statu Marylandiae RESIDENTIA AD BOHEMIAM WARWICK P. O., CECIL CO., MD. P. Carolus H. Heichemer Oper Excur. ad Middletown, etc. RESIDENTIA AD S. IGNATII ST. INIGOES, ST. MARY'S CO., MD. P. Livius Vigilante Sup. Oper. P. Jacobus P. Neale Proc. Oper Excurr. ad S. Nicolaum et S. Georgium."
    },
    {
        "text": "RESIDENTIA AD LEONARDTOWN LEONARDTOWN, ST. MARY'S CO., MD. P. Joannes B. Gaffney Sup. Oper Excurr. ad Newtown Praes. sod. B. V. M. in Leonardtown. P. Basilius Pacciarini Oper Excurr. ad S. Jos. et S. Joan. et Imm. Concept. P. Cemens S. Lancaster Oper Excurr. ad Sacred Heart et Lady's chapel. Jacobus McDonnell Coadj Aedit. Ad dom. RESIDENTIA AD S. THOMAE COX’S STATION, CHARLES CO., MD. P. Bernardinus F. Wiget Sup. Oper Praes. sod. B. V. M. viror, pueror. et mulierum. P. Antonius M. Mandalari Oper Excurr. ad Newport, Cobbneck et ad varias stationes Praes. sod. B. V. M. alb. et nigrit. et sod. benevol. nigrit. P. Eugenius McSwyney Adj. sup. ad S. Thoma Excurr. ad stat. Port Tobacco, La Plata et Newtown. P. Gulielmus Scanlan Oper. Excurr. ad Pomfret, Corn wallis' Neck, Hill Top ad hospitium pauperum et Ce dar Neck Point. RESIDENTIA AD WHITEMARSH COLLINGTON P. O., PRINCE GEORGE'S CO., MD. P. Jacobus Major Sup. Oper. Excurr. P. Jacobus Cotting Oper. Excurr. Mauritius Cavanagh Coadj. Coq Aedit. Ad omn. IN MISSIONIBUS IN STATU MARYLANDIAE PP. 12. Coadj. 2. Univ. 14."
    },
    {
        "text": "IN STATU MASSACHUSETTS COLLEGIUM BOSTONIENSE BOSTON COLLEGE, 761 HARRISON AVENUE, BOSTON, MASS. P. Jeremias O'Connor Rect. a die 18 Dec. 1879 Proc. Praef. stud. et schol Praes. coet. juv. cathol., sodal. B. V. M. puell. et confrat. bon. mort. Conf. et conc. in T. P. Alphonsus Charlier Min Adm Praef. eccl. et val Script. hist. dom Coll. pp. pro litt. ann Praes. conf. SS. Cordis et S. Vinc Conf. in T. Doc. ling. gall. 1 cl. Cons. dom. an. 14. P. Alexius L. Jamison Oper Conf. in T. et monial. Bon. Past. P. Eduardus H. Welch Oper Praes. sod. filiar. Mar. apud monial. SS. Cord. et N. D. Praes. coll. cas. consc. et lect. ad mens Doc. ling. germ. 1 cl. Conf. et conc. in T. Cens. libr. Cons. dom. an. 1. P. Joannes Bapst Praef. spir Conf. monial. SS. Cord. et N. D. Conf. in T. et oper. P. Nicolaus Russo Lect. log., metaph. et eth. Praef. bibl. Praes. sodal. matron Catech. discip. Conf. et conc. in T. Cons. dom. an. 3. P. Petrus P. Fitzpatrick Oper Conf. et conc. in T. Praes. schol. dom. et sod. viror Conf. NN. Cons. dom. an. 1. P. Simon P. Dompieri Oper Cur. ger. nosoc. municip. Conf. NN. et in T. Josephus I. Ziegler Lect. phys. et chym."
    },
    {
        "text": "MAGISTRI P. Petrus Cassidy Doc. rhet. an. 6. mag. et ling. gall. 5 cl. Praes. sod. juv. et adj. praes. coet. juv. cathol. Joannes A. Buckley Doc. hum. an. 5. mag. et ling. germ. 2 cl. Praef. odei. Timotheus Brosnahan Doc. supr. gram. an. 2. mag., math. 1 cl. et ling. gall. 3 cl. Moder. soc. liter. discip. senior. Eduardus X. Fink Doc. med. gram. an. 2. mag., math. 2 cl. et ling. gall. 4 cl. Praes. sodal. B. V. M. discip. et soc. liter. jun. Michael C. Dolan Doc. inf. gram. an. 4 mag. et algeb. 2 cl. Adj. praes. soc. dramat. Franciscus B. Moyer Doc. elem. 1 cl. an. 3 mag. et algeb. 1 cl. Adj. praef. bibl Praes. soc. cadets milit. discip. P. Hugo A. Quin Doc. elem. 2 cl. an. 5 mag. et math. 3 cl. Dirig. spirit. asyl. municip. puer Oper. D. Leo Brand Submin Doc. math. 3 cl. Praef. atrii Mag. caerem Bid. Praeterea scholarum Magistri externi duo. COADJUTORES Eduardus B. O'Kelly Cust. calorif. Jan. coll. Vis. noct. Ad dom. Jacobus McCloskey Jan. Ad dom. Joannes Curran Cust. tricl. Vis. med. et exam. Ad dom. Robertus Dockrey Pict Aedit. sac. dom Infirm Ad dom. Joannes Moriarty Coq. Cust. cell. vin Excit. Theodulus Vachon Empt Cust. vest. Soc. aedit. Ad dom. Timotheus Fealy Aedit. Ad dom. PP. 10. Schol. 7. Coadj. 7. Univ. 24."
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS AD S. MARIAE CHURCH OF ST. MARY OF THE SACRED HEART, 45 COOPER STREET, BOSTON, MASS. P. Gulielmus H. Duncan Min. Proc. Oper Praes. schol. paroch. pro puellis, sod. B. V. M. matron., conf. bon. mort., Scap. et conf. S. Vinc. Conf. NN. P. Bernardus A. Maguire Mission. excurr. Conf. NN. P. Franciscus McAtee Mission. excurr. P. Fridericus J. Holland Oper. in ins. Deer et Rainsford, in xenod. et carc. Conf. NN. Cons. dom. an. 1. P. Georgius I. Strong Mission. excurr. P. Gulielmus F. Hamilton Adm. Oper. Praef. eccl. Praes. sod. B. V. M. pro viris. et junior. faem. et confr. SS. Cordis Conf. NN. Cons. dom. an. 2. P. Joannes Fitzpatrick Oper Conf. et conc. in T. P. Joannes B. Nagle Oper Praes. schol. dom. et paroch. pro puer. et sod. B. V. M. pro iisdem Cons. dom. an. 1. P. Joannes A. Morgan Mission. excurr. P. Michael F. Byrne Oper Praes. sod. B. V. M. pro puell. in schol. paroch. et juv. in eccl. COADJUTORES Joannes Lynch Aedit. Empt Ad dom. Joannes McElroy Cur. val. Ad dom. Patritius F. Quinn Cust. tricl. Excit Ad dom. PP. 10. Coadj. 3. Univ. 13."
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS AD SS. TRINITATIS TRINITY CHURCH, 21 LUCAS STREET, BOSTON, MASS. P. Franciscus X. Nopper Min. Proc. Praef. eccl Oper. Praes. schol. paroch., conf. SS. Cordis, SS. Rosarii vir et sod. B. V. M. juven. P. Ignatius Bellwalder Praef. spir Conf. NN. Oper Praes. confr. SS. Rosarii matron., sod. B. V. M. puell. et bon. mort Excurr. ad Lawrence et Manchester. Caspar Menke Aedit. Sart Ad dom. PP. 2. Coadj. 1. Univ. 3. COLLEGIUM VIGORNIENSE ET CONVICTUS HOLY CROSS COLLEGE, WORCESTER, MASS. P. Eduardus D. Boone Rector a die 9 April., 1879 Proc. Praef. stud. P. Joannes J. Murphy Min Praef. schol. et. sac. Conf. et conc. in sac Script. hist. dom. Coll. pp. pro litt. ann. Cons. dom. an. 3. P. Carolus H. Stonestreet Praef. spir Conf. NN. et in sac. Conc. in sac Praes. coll. cas. consc. Exhort. dom. Catech. FF. coadj Adm. P. Joannes J. Ryan Lect. log., metaph. et eth. Catech alumn. Praef. bibl. Conc. in sac. Conf. NN. et in sac Cons dom. an. 2. Gulielmus P. Brett Lect. astron., phys. et chym. Praef. odei."
    },
    {
        "text": "MAGISTRI P. Joannes J. McAuley Doc. rhet. an. 11 mag. Conf. NN. et in sac Conc. in sac Praef. lect. ad mens Praes. sod. alumn. Cons. dom. an. 1. Thomas J. Gannon Doc. hum. an. 3 mag. et algeb. Patritius Quill Doc. supr. gram. an. 4 mag. et math. 3 cl. Praes. sod. SS. Ang. Gulielmus J. Tynan Doc. med. gram. an. 3 mag. et math. 2 cl. Jacobus N. Collins Doc. inf. gram. an. 2 mag. et arith. 2 cl. Franciscus X. Sadlier Doc. rud. an. 2 mag., arith. 3 cl. et ling. gall. 1 cl. Joannes F. Lehy Doc. math. 1 cl. et ling. gall. 2 cl. an. 2 mag. Josephus J. Himmelheber Doc. arith. 1 cl., ratioc. et calig. an. 4 mag. Praef. atrii phil Adj. praef. bibl. Mag. caerem. et praef. min. ad altare. PRAEFECTI P. Patritius H. Brennan Praef. val. Doc. ling. gall. 3 cl. Cons. dom. an. 1. Gulielmus J. Tynan Jacobus W. Collins, Joannes F. Lehy, Thomas J. Gannon. COADJUTORES Antonius Beckmann Fab. lign. Aedit. Jacobus O'Neill Pistor. Jacobus Strain Soc. proc Ratioc. Empt Infirm. Joannes Farrell Cur. val. Ad dom. Joannes H. Hammill Ad dom. Joannes J. O'Neill Cust. vest. Soc. infirm. Ad dom. Michael Hogan Adj. coq."
    },
    {
        "text": "Michael Loftus Cust. tricl. NN. et cell. vin. Excit. Michael O'Sullivan Hortul. Patritius Gallagher Coq. PP. 6. Schol. 8. Coadj. 10. Univ. 24. IN STATU NEO CAESARIENSI RESIDENTIA CAESARIENSIS AD S. PETRI et Collegium Inchoatum ST. PETER'S COLLEGE, GRAND STREET, JERSEY CITY, N. J. P. Joannes McQuaid Rect. a die 31 Julii, 1874 Cur. ger. paroch. et schol. paroch Proc. P. Thomas A. Reid Min Oper Catech. schol. dom Mod. soc. Temp. et S. Vinc Cons. dom. an. 1. P. Eduardus Doucet Adm. Praef. spir. et conf. NN. Praef. bibl Oper Praes. coll. cas. consc., sod. SS. Cordis et Ros. Viv Coll. pp. pro litt. an Script. hist. dom. P. Nilus N. McKinnon Praef. stud., discip. et lect. ad mens. Submin Mod. sod. B. V. M. Conf. et conc. in T. Cons. dom. an. 1."
    },
    {
        "text": "MAGISTRI ET PRAEFECTI P. Franciscus Smith Doc. hum. an. 6 mag. Conc. in T. Conf. alumn Mod. 1. Sod Cons. dom. an. 2. P. Ignatius Renaud Doc. sup. gram. an. 12 mag. Doc. ling. gall. Conc. in T. Conf. NN. et alumn., Mo nial. et poenit. Bon. Past. Jacobus Fagan Doc. med. gram. an. 2 mag. Expl. med. FF. Gulielmus B. Brownrigg Doc. inf. gram. 1 cl. an. 2 mag. Jacobus Wellworth Doc. inf. gram. 2 cl. an. 2 mag. Georgius Fargis Doc. ling. angl. 1 cl. et geom. an. 2 mag. Lect. chym Direct. music. Henricus J. Sandaal Doc. ling. angl. 2 et 3 cl., ling. germ. et algeb. an. 6 mag. Jacobus Smith Doc. ling. angl. 4 cl. et rud. an. 2 mag. P. Joannes Cunningham Doc. spec. lat. curs. an. 26 mag. COADJUTORES Joannes Cullin Cust. vest Adj. sart. Ad dom. Joannes Freeth Aedit. Vis. orat., exam. et noct. Ad dom. Josephus Kain Cust. tricl. Excit Ad dom. Nicholaus Schu Janit. Sart. Ad dom. Patritius Brady Cur. forn Ad omnia. Patritius Ranahan Coq. Disp. Empt. Ad dom. PP. 7. Schol. 6. Coadj. 6. Univ. 19."
    },
    {
        "text": "IN STATU PENNSYLVANIAE RESIDENTIA CONEWAGINENSIS P. O. MCSHERRYSTOWN, ADAMS CO., PENN. P. Josephus Enders Sup. Proc. Oper Praes. sod. SS. Sacram., confr. SS. Cordis et Rosarii. P. Georgius Villiger Oper Excurr. ad Littlestown Praes. sod. B. V M. P. Joannes B. Archambault Oper. Praes. sod. B. V. M. Excurr. ad Oxford et Paradise. P. Joannes B. Emig Oper. Excurr. ad Hanover Praes. sod. B. V. M. P. Petrus Flanagan Oper. Conf. et Conc. in T. P. Petrus Manns Oper. Excurr. ad McSherrystown et Irishtown Conf. in T. Praes. sod. bon. mort. P. Thomas Finnegan Cur. val. Hugo McGunegle Coadj. Hortul. Michael Donohue Coadj. Ad dom. PP. 7. Coadj. 2. Univ. 9."
    },
    {
        "text": "RESIDENTIA GOSHENHOPPENSIS CHURCHVILLE, COLEBROOKDALE P. O., BERKS CO., PENN. P. Augustinus Bally Sup. Oper. Praes. sod. B. V. M. P. Joannes B. Meurer Oper Excurr. ad vicinas stationes. Josephus Brembacher Coadj Aedit Ad dom. PP. 2. Coadj. 1. Univ. 3. RESIDENTIA PHILADELPHIENSIS SS. NOMINIS JESU CHURCH OF THE GESU, 18th STILES STS., PHILADELPHIA, PENN. P. Burchardus Villiger Sup. Proc. Praef. eccl Oper Praes. sod. bon. mort., confr. SS. Cordis, Rosarii et ani mar. defunct. P. Alphonsus Coppens Oper Conf. sen. apud sor. paup. Conf. et conc. in T. Praes. sod. B. V. M. Cons. dom. an. 3. P. Carolus Cicaterri Adm. Oper Praef. spir. et conf. NN. et in T. Coll. pp. pro litt. ann Praes. coll. cas. consc. Cust. bibl. Cons. dom. an. 2. P. David A. Merrick Oper Conf. NN. et in T. Conc. in T. Praes. schol. elem. et dom Cons. dom. an. 1. P. L. Hippolytus Gache Oper Conf. NN. et in T. Vis. nosoc. Conc. in T. P. Robertus Fulton Oper. Conf. et conc. in T Cons. dom. an. 1. COADJUTORES Arthurus Gormley Cust. cell. vin Ad dom. Franciscus Vachon Cust. tricl. Cust. vest. Ad dom. PP. 6. Coadj. 2. Univ. 8."
    },
    {
        "text": "RESIDENTIA PHILADELPHIENSIS AD S. JOSEPHI ST. JOSEPH'S CHURCH, WILLING'S ALLEY, PHILA., PENN. P. Josephus M. Ardia Sup. Proc Oper. Praef. eccl Praes. confr. SS. Cordis et schol. paroch. P. Aloysius Romano Oper Conf. et conc. in T Praes. sod. B. V. M. jun Praef. bibl. P. Franciscus O'Neill Oper. Conf. et conc. in T. Conf. NN. Coll. pp. pro litt. ann. Script. hist. dom. P. Patritius A. Jordan Oper. Conf. et conc. in T. Praes. achol. dom. et aod. B. V. M. sen Cons. dom. an. 11. P. Patritius Duddy Oper Conf. NN. et in T Cons. dom. an. 6. Joannes Dowling Coadj. Excit Cust. tricl. et vest Ad dom. PP. 5. Coadj. 1. Univ. 6. IN STATU RHODE ISLAND RESIDENTIA AD S. JOSEPHI IN CIVITATE PROVIDENCE ST. JOSEPH'S CHURCH, 92 HOPE ST., PROVIDENCE, R. I. P. Gulielmus B. Cleary Sup. Proc. Praef. eccl Oper. Praes. schol. paroch., sod. B. V. M. puell., confr. SS. Ros. et soc. sanct. Mod. soc. S. Vincentii Conf. mon. Ursulin."
    },
    {
        "text": "P. Jacobus J. Bric Oper Praes. schol. dom. et sod. B. V. M. viror. juven. et puer Conf. NN. et soror. Misericord. P. Jacobus Noonan Oper Praes. sod. B. V. M. viror. sen. et matron. et sod. bon. mort. Coll. pp. pro litt. ann Conf. NN. et soror. Misericord. COADJUTORES Eduardus Donnelly Aedit. Ratioc Ad dom. Michael Cashman Coq. Cust. tricl. Excit. PP. 3. Coadj. 2. Univ. 5. IN STATU VIRGINIAE RESIDENTIA ALEXANDRINA ST. MARY'S CHURCH, ALEXANDRIA, VA. P. Dionysius O'Kane Sup. Proc. Oper. Praes. schol. domin., confr. SS. Cordis et sod. bon. mort. Excurr. ad Fall's church. P. Ricardus J. Whyte Oper Praes. sod. B. V. M., schol. domin. et sod. nigrit Excurr. ad Fairfax, etc. Michael Nash Coadj Empt Aedit. Ad dom. PP. 2. Coadj. 1. Univ. 3."
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM IN BELGICA P. Campbell, Thomas Aud. theol. an. 3. Lovan. P. Casey, Jacobus, . Claven, Patritius, comp. 2 Broderick, Joannes, philos. 3 IN FRANCIAE P. Prendergast, Joannes Repet. theol. IN MEXICANA P. McLaughlin, Franciscus W. Miss. Oper. in Cuero, Texas. IN NEAPOLITANA P. Haugh, Daniel Miss. Oper. Chester, Joannes Schol. in coll. Las Vegas, N. Mexico. Hughes, Michael J. Schol. in coll. Las Vegas, N. Mexico. IN TAURINENSI P. Voung, Edmundus J. Doc. in Coll. S. Clarae in Cal. Hamilton, Robertus Coadj. in miss. ad Montes Saxos. IN VENETA P. Muller, Augustus Miss. in Mangalor. PP. 7. Schol. 4. Coadj. 1. Univ. 12."
    },
    {
        "text": "EX ALIIS PROVINCIIS IN NOSTRA DEGENTES EX ANGLIAE P. Ryan, Franciscus, Garceau, Aloysius Sch. Heidenreich, Hubertus Sch. Leblanc, Ludovicus, Roy, J. Rodericus Sch. Ex AUSTRIACA P. Holzer, Joannes, P. Prachensky, Josephus. EX BELGICA De Pooter, Fridericus Coadj. EX FRANCIAE P. Daubresse, Isidorus, P. Perron, Jacobus, P. Loyzance, Josephus, P Thebaud, Augustus, P. Marechal, Franciscus, Ledore, Philippus Coadj. Mace, Julius Coadj. P. Mignard, Paulus, EX GERMANICA P. Nopper, Franciscus X. P. Simeon, Jacobus, P. Tolle, Franciscus Nov. P. Schleuter, Joannes P. M."
    },
    {
        "text": "EX LUGDUNENSI P. Brislan, Joannes, P. Gache, L. Hippolytus, P. Pont, Joachim P. Rocoffort, Aloysius, P Winkelried, Josephus, Blatter, Alfredus Sch. Clarke, Joannes, Davis, Nicolaus, De la Moriniere, E. De Stockalper, Aloy. Freund, Alexander Sch. Gaffney, Eduardus Hogan, Joannes, Klein, Carolus, O'Callaghan, Thomas, O'Leary, Patritius, Power, Gulielmus, Power, Jacobus, Rigues, Henricus, Tyrrell, Gulielmus, Flynn, Thomas Sch. EX MISSOURIANA P. Dowling, Jacobus A. P. Frieden, Joannes P. P. Magevney, Hugo L. P Miege, Joan. Bapt. P. Moeller, Henricus J. P. Murphy. Patritius A. Berberich, Francis Sch. Boyle, Patritius, Cappel, Philippus, Corbley, Jacobus, De Laak, Henricus, Dowling, Michael, Effinger, Augustinus, Fitzgerald, Thomas, Hoeffer, Georgius A. Hoeffer, Jacobus Sch. Hoffend, Gulielmus, Klocker, Franciscus, Kokenge, Joannes B. Mathery, Joannes, McErlane, Daniel, Meyer, Augustinus M. O'Connell, Jacobus, O'Connor, Michael, O'Neil, Michael, Rogers, Gulielmus B. Rotter, Aloysius, Schlechter, Nicolaus, Sherman, Thomas E. Sullivan, Cornelius B. Weber, Josephus Sch."
    },
    {
        "text": "EX NEAPOLITANA P. Brandi, Salvator M. P Polino, Carmelus, P Colle de Vita, Josephus M. P. Romano, Aloysius, P de Augustinis, Aemilius M. P. Russo, Nicolaus, P. Sabetti, Aloysius, P. Degni, Januarius, P. Mandalari, Antonius M. P. Schiffini, Blasius, P. Pantanella, Dominicus Campone, Cajetanus Coadj. Vezza, Raphael. P. Piccirillo, Carolus, EX TAURINENSI Coltelli, Angelus Sch. Driscoll, Jeremias, Filippi, Sanctes, Giacobbi, Dominicus, Jacquet, Aloysius Sch O'Gorman, Joannes, O'Sullivan, Jacobus, Robaut, Aloysius, EX VENETA P. Cicaterri, Carolus. PP. 37. Schol. 53. Coadj. 5. Univ. 95."
    },
    {
        "text": "MUTANDA IN CATALOGO CONSULTOR PROVINCIAE ADDENDUS P. Rector, Coll. S. Franc. Xav., Neo Ebor., a die 28 Oct. 1880. IN COLL. S. FRANC. XAVER, NEO EBOR. Addendus P. Paulus Mignard Cur. val. Tollendus Patritius Souren Coadj., missus ad Woodstock Coll. IN RESID. AD S. LAURENT, NEO EBOR. Addendus P. Robertus Fulton Sup. a die 1 Nov. 1880, Cur ger. paroch., Praes. sod. matr. SS. Cord. et Ros., Mod. sod. et soc. cathol. juven, Mod. sod. puell. Tollendus P. Allanus McDonell Missus ad Troj. Res. IN DOMO. PROB. AD WEST PARK Addendi duo novitii. schol. Joannes Griffin Aud. rhet. Frideric 27 Febr. 1879 Ignatius G. Bergan, id. 6 Sept. 1879 IN RESID. TROJANA Addendus P. Allanus McDonell Oper. IN COLLEGIO WASHINGTON. Addendus P. Franciscus Casey Oper., Praes. schol. paroch. Tollendus P. Robertus F. Byrne Missus ad Res. S. N. J., Philad. IN COLLEGIO BALTIMOR. Addendus Joannes Paffe Sart., Cust. vest., Aedit. sac. dom., Excit. Tollendus Laurentius Guthing Missus ad Res. ad Bohem IN DOMO PROBAT. FRIDERICOP. Tollendi duo P. P. tertiae prob. P. Franciscus Casey Missus ad Coll. Washington. P. Gulielmus H. Carroll Missus ad Res. ad S. Thomae. IN COLLEGIO WOODSTOCK. Addendi P. Joannes Harpes Ann. 1 Phil. aud. Patritius Souren Coq."
    },
    {
        "text": "IN RESID. AD BOHEMIAM Addendus Laurentius Guthing Coadj., Ad omn. IN RESID. AD S. THOMAE Addendus P. Gulielmus H. Carroll Oper., Excurr. ad Pomfret, Cornwallis' Neck, Hill Top ad hospit. pauper. et Cedar Neck Point. Tollendus P. Gulielmus Scanlan Missus ad S. Mar., Boston. IN RESID. AD S. MARIAE, BOSTON. Addendus P. Gulielmus Scanlan Oper., Conf. et conc. in T. Tollendus P. Joannes Fitzpatrick Defunctus. IN RESID. SS. NOM. JESU, PHILADELPH. Addendus P. Robertus F. Byrne Oper., Conf. et conc. in T. Tollendus P. Robertus Fulton Missus ad S. Laur., Neo Ebor DEGENS IN PROV. ANGLIAE Alfredus Brosnan Doc. in Coll. S. Dunstan. P. E. I. Canada. EX PROVINCIA ANGLIAE DEGENTES IN NOSTRA P. O'Reilly, Patritius, P. Archambault, Joan. Bapt., P. Regnier, Augustinus P. Costin, Michael P., P. Doucet, Eduardus, P. Renaud, Ignatius, P. Shea, Josephus, P. Freeman, Thomas J., P. Gelinas, Raphael, P. Glackmeyer, Hector, P. Langlois, Hugo, P. McDonell, Allanus P. McKinnon, Nilus N Kaiser, Ludovicus Coadj. Miville, Joel id. Thibault, Onesymus id. Vachon, Franciscus id. Vaehon, Theodulus id."
    }
]