[
    {
        "text": "1888"
    },
    {
        "text": "R. P. ROBERTUS FULTON PRAEPOSITUS PROVINCIALIS A DIE 28 MAII. 1882. VISIT. PROV. HIBERNIAE A die 5 Dec. 1886. ST. FRANCIS XAVIER'S. UPPER GARDINER ST. DUBLIN. IRELAND R. P. PETRUS O. RACICOT VICE PRAEPOSITUS PROVINCIALIS A die 3 Sep. 1887. 39 W. 15th St., New York City United States of America. P. GULIELMUS PARDOW Soc. a die 31 Julii, 1884 Cons. Prov Adm. Josephus Kain Soc. Coadj. Sac. 2 Coadj. 1 Univ. 3 CONSULTORES PROVINCIAE P. RECTOR COLLEGII MAXIMI a die 8 Jul. 1882 P. RECTOR COLL. S. FRANC. XAVER. . . a die 11 Sep. 1885 P. RECTOR COLL. S. JOANNIS a die 27 Sep. 1887 P. SOCIUS R. P. PROVINCIALIS . a die 31 Jul. 1884"
    },
    {
        "text": "IN STATU NEO EBORACENSI COLLEGIUM S. FRANCISCI XAVERII 39 W. 15th STREET, NEW YORK CITY. P. Joannes J. Murphy Rect. a die 20 Aug. 1885 Praef. stud Praes. coll. cas. consc. sacerd. saec Cons. Prov. P. Gulielmus F. Gregory Min Praef. val. Cat. in T. Cons. an. 2 P. Dionysius A. Kelley Oper. in xenod. et carc. in ins. Hart. P. Harmer C. Denny Oper Conf. et conc. in T. Praes. sod. SS. Cord. et fil. Mar. P. Hermannus Blumensaat In Ins. Blackwell Oper. in xenod. P. Hermannus Richard In Ins. Randall Oper. in xenod. P. Isidorus Daubresse Conf. NN. et in T Cens. libr. P. Jeremias O'Connor Conf. et conc. in T Oper. Conf. NN. et alumn Lect. doctr. christ. alumn. P. Joannes B. Jungck Dir. mus Praef. atr. Conf. in T. P. Joannes C. Keveny Adj. praef. schol. P. Joannes F. X. O'Conor Praef. schol. et discipl. Conf. in T. Cons. an. 1 P. Joannes Prendergast Lect. log., metaph. et phil. relig. Conf. et conc. in T. P. Josephus Desribes In ins. Blackwell Oper. in nosoc. P. Josephus M. Jerge Oper Praes. confr. S. Ros. et bon. mort Cur. ger. schol. paroch. et domin Conf. alumn."
    },
    {
        "text": "P. Josephus Prachensky In Ins. Ward Oper. in nosoc. P. Mauritius Ronayne Adm Praef. spir. et bibl. Conf. in T. Lect. hist. Cens. libr. P. Nilus N. McKinnon Praef. eccl. Conf. et conc. in T. Conf. alumn Dir. arc confr. SS. Cord. Cons. an. 1 P. Patritius F. Dealy Oper Mod. sod. alumn. vet. et Un. Xav. P. Pius Massi Cur. ger. Hisp. Praes. coll. cas. consc. NN. Conf. NN. P. Raphael Gelinas Oper. in carc. etc. in ins. Randall. Cur. ger. miss. Ins. P. Ricardus J. Whyte Oper Praes. confr. S. Sitis. P. Theodorus Thiry Oper Conf. NN., alumn. et in T. Mod. 1 sod. alumn. Praes. sod. B. V. M. vir., acad. jun. opif., soc. S. Inf. et confr. S. V. de Paul. Cons. an. 3 Dionysius T. O'Sullivan Lect. math. subl., phys. et chym. Praef. bibl. alumn. An. 5 MAGISTRI Thomas J. Gasson Doc. rhet. Mod. acad. phil. et rhet Coll. pp. litt. an. Script. hist. dom An. 5 Daniel A. Doherty Doc. hum. et math. 3. Bidel An. 4 Patritius J. Cormican Doc. supr. gram. et alg. 2 sect. An. 2 Jacobus J. O'Connor Doc. med. gram. 1 cl. et alg. Mod. sod. jun An. 2 Gulielmus H. A. Coyle Doc. med. gram. 2 cl. et arith Mag. caer. An. 3 Josephus H. Rockwell Doc. inf. gram. 1 cl. 1 sect., arith. et ling. germ An. 1 Edmundus J. Burke Doc. inf. gram. 1 cl. 2 sect., arith. et ling. germ An. 2"
    },
    {
        "text": "Joannes S. Hollohan Doc. inf. gram. 2 cl. 1 sect. et arith. An. 1 L. Eugenius Ryan Doc. inf. gram. 2 cl. 2 sect. et arith. An. 3 Petrus Kayser Doc. math., ling. germ. et gall Vis med. et exam. vesp. Expl. pp. med. FF. An. 4 Eduardus J. Magrath Praef. curs praep. Mod. 3 sod An. 4 COADJUTORES Aemilius Risler Vis. exam. vesp. Ad dom. Andreas E. O'Reilly Cust. tricl. Audenus Campbell Adj. coq. Conradus Meyer Cust. vest Infirm. Dionysius Hogan Arcul. Ad dom. Hugo Reilly Adj. aedit. Joannes Doran Coq. Vis. med. et noct. Joannes Dowdle Adj. proc Aedit. Ad dom. Joannes Flood Praef. famul Ad dom. Josephus Bradley Adj. cust. tricl. Ad dom. Michael Rogers Arcul. cur. ger. aedif. nov. Patritius Brady Cust. calor. Ad dom. Ricardus Barrett Adj. proc. Senanus Mangan Empt. Disp. Thomas Gormley Fab. plumb Excit Vis. exam. mat. et vesp. Sac. 22 Schol. 12 Coadj. 16 Univ. 49"
    },
    {
        "text": "COLLEGIUM S. JOANNIS ET CONVICTUS ST. JOHN'S COLLEGE, FORDHAM, NEW YORK CITY. P. Thomas J. Campbell Rect. a die 20 Aug. 1885. Praef. stud Exhort. alumn. et conc. in T. Cons. Prov. P. Jacobus B. Becker Min. Praef. val. NN. Lect. math. Cons. an. 3. P. Eduardus Doucet Lect. ethic Oper Conc. et conf. in T. Cens. libr. P. Ludovicus Jouin Praef. Spir Adm. Lect. log. metaph. et eth. Conf. alumn. Praes. coll. cas. consc. sacer. saec. et NN. P. Nicolaus Hanrahan Proc. Conf. NN. Cons. an. 13 P. Patritius S. Murphy Cur. ger. paroch. Praes. confr. S. Ros. et schol. domin. P. Petrus Cassidy Praef. discip. et val. alumn. Exhort. alumn Doc. eloc Cons. an. 1 P. Thomas J. A. Freeman Lect. scient. nat. Praes. min. ad alt. Conf. surd. et mut. et NN Mod. 1 sod. alumn. Subm Cons. an 4 MAGISTRI P. Jacobus Casey Doc. rhet. an. 10 mag. Conf. et exhort. NN. et alumn. Joannes F. Quirk Doc. hum Mod. soc. dram. et acad. phil. et rhet An. 5 Jacobus V. Kelley Doc. supr. gram. Dir. FORDHAM MONTHLY An. 4"
    },
    {
        "text": "Ludovicus A. Weber Doc. med. gram. Adj. praef. alumn. An. 4 P. Gulielmus H. Walsh Doc. inf. gram. 1 cl. Mod. 3. sod. Adj. praef. alumn. Conc. in T. L. Eugenius French Doc. inf. gram. 2 cl. Dir. mus Adj. praef An. 2 P. Michael Flynn Doc. rhet. in curs. comm. et ling. gall Conf. et exhort. alumn. Praef. bibl. Conc. in T. P. Gulielmus J. Kevill Doc. hum. in curs. comm. 1 cl. Adj. praef. alumn. Expl. cat. et pp. med. FF. Josephus J. Prendergast Doc. hum. in curs. comm. 2 cl. Adj. praef. alumn An. 5 Thomas. J. Walsh Doc. gram. in curs. comm Adj. praef. An. 4 Gulielmus F. Gannon Doc. curs. spec Adj. praef. alumn. An. 5 Patritius A. McQuillan Doc. math. Cat. famul An. 5 Joannes S. Coyle Doc. math. Adj. lect. chym An. 2 PRAEFECTI Joannes J. Collins Doc. in curs. comm An. 5 Georgius A. Mulry Mod. 2 sod Stud. theol. mor. priv. COADJUTORES Antonius Dooher Aedit. in sac. Adj. cust. tricl. Dionysius Considine Cust. vest. alumn. Vis. med. Fridericus de Pooter Adj. hortul. et cust. tricl. Fridolinus Haefele Arcul. Gulielmus Donovan Disp. Vis. noct. Gulielmus Hennen Senex Jacobus Early Coq. Jacobus Egan Adj. coq. Ad dom."
    },
    {
        "text": "Jacobus Mallen Cust. tricl. Jeremias Flaherty Pistor Joannes Paffe Sart. Josephus Byrne Ad dom. Julius Mace Doc. mus. Excit. Ad dom. Leo Kutter Infirm. Ludovicus Kaiser Adj. cust. vest. Vis. utr. exam. Matthaeus Devine Villic. Matthaeus O'Connor Aedit. in T. Adj. proc. Nicolaus Paradise Sut Empt. Patritius Corrigan Caement. Patritius Smith Cur. forn. Thomas Hallahan Pict. Praes. famul Adj. infirm. Sac. 12 Schol. 11 Coadj. 21. Univ. 44 RESIDENTIA NEO EBORACENSIS Sancti Laurentii 1480 PARK AVENUE, NEW YORK CITY. P. David A. Merrick Sup. Cur. ger. paroch Oper Mod. sod. puell. Cens. lib. P. Carolus Petitdemange Oper. Praes. coll. cas. consc. Cons. an. 11 P. Eduardus McTammany Oper Praes. confr. bon. mort., sod. juv. et soc. temp Coll. pp. litt. an Script. hist. dom Cons. an. 1"
    },
    {
        "text": "P. Eduardus X. Fink Cur. ger. schol. paroch Praes. sod. puer. Stud. priv. theol. dogm. P. Gulielmus Moylan Oper Adm. Praef. spir. et bibl. Praes. sod. matron., SS. Cord. et Ros Cat. puer. et puell. COADJUTORES Joel Miville Aedit Cust. vest. Excit. Vis. med. Michael Kays Jan. Ad dom. Patritius Farrell Coq. Empt. Ad dom. Sac. 5 Coadj. 3 Univ. 8 RESIDENTIA NEO EBORACENSIS Sancti Joseph 410 E. 87th ST., NEW YORK CITY. P. Josephus Busam Sup. Cur. ger. paroch Oper Proc. Praes. sod. matron. et puell. Cat. puer. et puell. P. Hubertus J. Heidenreich Oper Praes. sod. juv. Cat. puer. et puell. P. Joannes A. Jansen Oper Praes. confr. bon. mort. Cat. puer. et puell. Henricus Rimbaugh Coadj. Coq Ad omn. Sac. 3 Coadj. 1 Univ. 4"
    },
    {
        "text": "RESIDENTIA TROJANA Sancti Joseph THIRD AND JACKSON STS., TROY, N. Y. P. Josephus Loyzance Sup. Cur. ger. utr. eccl. Proc. Oper Praes. confr. bon. mort. Coll. pp. litt. ann Script. hist. dom Cat. puer. et puell. schol. paroch. P. Allanus McDonnell Min. Oper. Cur. ger. schol. paroch Praes. sod. S. Sitis. et soc. temp Praef. bibl. Conc. an. 2 P. Franciscus Barnum Oper. Praes. sod. B. V. M. puer. juv. et vir. P. Franciscus X. McGovern Oper. in eccl. S. Mich. Praes. confr. bon. mort., S. Ros. et sod. puer. et puell. P. Josephus Delabays Conf. NN. et in T. Doc. ling. lat. P. L. Hippolytus Gache Oper Praes. coll. cas. consc. Conf. NN. et orph Expl. cat. FF. Cons. an. 1 P. Michael Nash Oper Praes. confr. S. Ros. et sod. puell. Conf. NN. Cons. an. 6 P. Patritius Gleason Adm. Praef. spir Oper. Conf. in xenod Praes. sod. SS. Cor. Jesu, et apost. prec. COADJUTORES Jacobus O'Brien Vis. med. Ad omn. Joannes Sheerin Aedit. in eccl. S. Mich. Sart. Ad omn. Martinus Ealy Coq Cust. tricl. Excit. Vis. noct. et utr. exam. Thomas Hogue Aedit Empt Disp. Cust. vest Jan. Sac. 8 Coadj. 4 Univ. 12"
    },
    {
        "text": "IN DISTRICTU COLUMBIA COLLEGIUM GEORGIOPOLITANUM et Convictus GEORGETOWN COLLEGE, D. C. P. Jacobus A. Doonan Rect. a die 17 Aug. 1882. Praef. stud. et schol. Conc. in sac Proc. P. Cornelius Gillespie Min Praef. val. Script. hist. dom. Cons. an. 1 P. Eduardus H. Welch Lect. log. metaph. et eth. Cat. conv. maj. Conf. NN. Conf. et conc. in sac. Mod. soc. philod. Cons. an. 2 P. Henricus T. B. Tarr Subm. Adj. praef. schol. Mod. soc. philon. P. Jacobus Curley Cust. virid. bot. Conf. NN. P. Jacobus Perron Praef. spir Adm. Praes. coll. cas. cons. Conf. in sac. P. Joannes Holzer Cur. val. P. Patritius F. Healy Extra dom. Cur. val. P. Samuel H. Frisbee Lect. phys. Dir. spec. astron. Conf. NN. et in sac Conc. in sac Expl. pp. med. FF. Cons. an. 2 Gulielmus M. McDonough Lect. math. Adj. praef. alumn. An. 2 Jacobus J. Deck Lect. chym Doc. ling. germ. An. 1"
    },
    {
        "text": "MAGISTRI Cornelius J. Clifford Doc. rhet Praes. sod. B. V. M. conv. maj. Praef. bibl An. 3 Gulielmus G. R. Mullan Doc. hum. Dir. COLLEGE JOUR NAL An. 5 Gulielmus J. Ennis Doc. sup. gram. et ling. gall. 2 cl. Praes. sod. SS. Ang. Praef. cub. An. 2 Patritius J. Casey Doc. gram. med. et alg. An. 2 Eduardus J. Roche Doc. inf. gram Adj. praef. alumn. An. 3 Joannes J. Greene Doc. elem. 1 cl. Adj. praef. alumn An. 3 Josephus A. Gorman Doc. cl. spec. et alg. Adj. praef. alumn An. 4 P. Gulielmus J. Quigley Doc. ling. gall. 1 cl. et math. 3 cl. Excur. ad Tenallytown Cat. conv. min. David Hearn Doc. math. 2 cl. et ling. gall. 3 cl. Adj. praef. alumn An. 1 PRAEFECTI P. Jacobus W. Collins Praef. 1 conv. maj. Doc. arith. 2 cl. Cons. an. 1 V. Howard Brown Praef. 1 conv. min. Doc. arith. 1 cl. ratioc. et ling. gall. 3 cl. An. 3 P. Gulielmus H. Morrison Praef. cub. COADJUTORES Aloisius Roth Cust. vest. alumn. min. Cur. baln. et lavac. Francis Bausenwein Sart. Vis med. et utr. exam. Georgius F. Schaffner Disp. Coq. Gulielmus Dugan Ratioc. Adj. proc. Vis. exam. Jacobus Marley Aedit. Cust. tricl. NN. Jacobus M. McCloskey Cust. vest. alumn. maj. Jacobus O'Sullivan Fab. lign."
    },
    {
        "text": "Jacobus T. O'Sullivan Fab. fer. Ad dom. Joannes Freeth Fab. lign. Joannes Rowley Pict. Arment. Josephus A. Wilson Adj. ratioc. Excit Aedit Ad dom. Mauritius Roach Infirm. Patritius Devine Cust. tricl. alumn. Patritius Donlan Adj. cust. tricl. NN. Ad dom. Patritius McCann Sut. Ad dom. Patritius Scars Cust. cell. vin. Thomas Dougherty Sut. Comp. libr. Empt. Ad dom. Thomas Gavan Pist. Ad dom. Thomas Shanahan Cur. val. Sac. 12 Schol. 11 Coadj. 19 Univ. 42 RESIDENTIA GEORGIOPOLITANA SS. Trinitatis TRINITY CHURCH, GEORGETOWN, D. C. P. Stephanus A. Kelly Sup. Proc. Praef. eccl. Oper. Praes. schol. puer., confr. bon. mort., apost. orat. et sod. B. V. M. P. Aloisius Roccofort Oper. Praes. schol. domin., confr. B. P. Clav. et S. Caec. Martinus Whelan Coadj. Aedit. Ludim Ad dom. Sac. 2 Coadj. 1 Univ. 3"
    },
    {
        "text": "COLLEGIUM GONZAGENSE 19 I St. N. W., WASHINGTON, D. C. P. Eduardus A. McGurk Rect. a die 21 Aug. 1885 Proc. Praef. stud. et bibl. Praes. confr. SS. Cord. et bon. mort. Conf. et conc. in T. P. Hieronymus Daugherty Min Oper Conf. et conc. in T. Praes. coll. cas. consc. Praef. schol., val. et lect. ad mens Doc. math. 2 cl. et ratioc Cat. alumn. Cur. ger. paup. in dom. sor. paup. Cons. an. 3 P. Eduardus Connolly Redac. lib. Doc. eloc. in coll., dom. prob. et coll. max Conf. NN. Conf. et conc. in T. P. Jacobus Noonan Adm. Praef. spir. Oper. Conf. et conc. in T. Praes. schol. paroch. et sod. B. V. M. puer. et puell. P. Patritius J. O'Connell Oper. Conf. NN. et in T. Praes. sod. B. V. M. sen. Praes. soc. pro. deb. sol. Cons. dom. an. 1 MAGISTRI Eduardus P. Spillane Doc. hum., sup. gram., ling. germ. et ratioc Praef. atr. Adj. praef. bibl An. 5 Milesius A. McLaughlin Doc. med. gram., arith. 2 el. et ling. gall. 1 cl. Bid. Script. hist. dom An. 3 P. Carolus C. Jones Doc. inf. gram., an. 3 mag. Conf. et conc. in T. Coll. pp. litt. an Adj. ad dom. Sor. paup. Jacobus F. X. Mulvaney Doc. rud. 1 cl. et arith. 1 cl Adj. praef. schol Mod. soc. Phocion An. 4"
    },
    {
        "text": "Eduardus Corbett Doc. rud. 2 cl., math. 3 cl. et ling. gall. 2 cl. Mag. caer. Adj. praef. atr An. 1 Georgius A. Pettit Doc. rud. 2 cl., arith. 3 cl., et ratioc. Praef. sod. alumn. Adj. praef. atr. Vis. med. et exam. An. 1 COADJUTORES Gulielmus Grant Sacrist Jan. Joannes J. O'Connell Cust. tricl. et vest. Excit. Ad dom. Thomas Kelly Coq. Thomas Kennedy Adj. proc Empt. Ratioc. Sac. 6 Schol. 5 Coadj. 4. Univ. 15"
    },
    {
        "text": "IN STATU MARYLANDIAE COLLEGIUM LOYOLAEUM CALVERT MADISON STS., BALTIMORE, MD. P. Franciscus A. Smith Rect. a die 31 Aug. 1886 Proc. Conf. et conc. in T. Praes. sod. B. V. M. in T. P. Theobaldus M. McNamara Min. Praef. val. Praes. schol. domin. et sod. B. V. M. puer. et puell. Adj. proc. Conf. et conc. in T. Cons. an 1 P. Antonius Van den Heuvel Extra dom. Cur. val. P. Eduardus J. Sourin Conf. NN. Cur. val. P. Franciscus Ryan Praef. eccl. Conf. et conc. in T. Praes. confr. SS. Cord. et Apost. orat Cons. an. 3 P. Gulielmus F. Clarke Oper Conf. et conc. in T. Conf. NN. Cat. alumn. Praes. coll. cas. consc. P. Jacobus A. McHugh Oper. in carc. et dom. correct. P. J. Henricus Sandaal Praef. stud. et lect. ad mens. Doc. ling. germ Conf. et conc. in T. Cons. an. 1 P. Josephus M. Ardia Praef. spir Adm. Conf. in T. Cat. FF. P. Thomas M. Sheerin Oper. Conf. et conc. in T. Conf. NN. Mod. soc. S. Vinc. P. Thomas W. Hayes Proc. prov. Admin. bon. Cons. an. 1 Joannes A. Moore Lect. chym. et math. 1 et 2 cl. Praef. atr. Mag. caer. An. 2"
    },
    {
        "text": "MAGISTRI Augustinus J. P. O'Malley Doc. hum. et math. 3 el. et eloc. 1 cl. Praes. soc. lit Praes. sod. B. V. M. alumn. Coll. pp. litt. ann. Script. hist. dom An. 2 Josephus H. Hann Doc. sup. gram., ling. germ., arith. 2 cl., ratioc. et eloc. 2 cl. Praef. odei Bid An. 5 Eduardus P. Lamb Doc. med. gram., ling. gall. 3 cl. et alg. Organ An. 2 Geraldus I. Bergan Doc. inf. gram. arith. 1 cl. et ratioc Praef. bibl An. 4 Henricus J. Rache Doc. rud. 1 cl. et ling. gall Adj. praef. atr. An. 5 Gulielmus P. O'Connor Doc. rud. 2 cl. et arith. 3 cl. Adj. praef. bibl Cust. repos. lib. Vis. med. et exam An. 1 COADJUTORES Daniel McLaughlin Aedit. Ad dom. Eduardus Shanahan Coq. Adj. empt. Joannes Fortescue Adj. proc Empt. Ratioc. Paulus Smith Cust. vest. Excit Ad dom. Thomas Murray Aedit. sac. dom Ad dom. Timotheus O'Sullivan Cust. cell. vin. Vis. med., utr. exam. et noct. Ad dom. Sac. 11 Schol. 7 Coadj. 6 Univ. 24"
    },
    {
        "text": "DOMUS PROBATIONIS FRIDERICOPOLITANA S. Joannis Evangelistae NOVITIATE, FREDERICK, MD. P. Michael A. O'Kane Rect. a die 26 Aug. 1887 Mag. nov. P. Philippus Cardella Instr. PP. 3 prob. Adm. Praef. spir Conf. NN. Praes. coll. cas. consc. P. Gulielmus H. Sumner Min. Sup. jun. Soc. mag. nov. Proc Praef. val. Conf. in T. Cons. an. 9 P. Antonius F. Ciampi Praef. eccl Oper Conf. et conc. in T. Praes. schol. S. Joan. et sod. B. V. M. nigrit. Conf. NN. Cons. an. 6 P. Benedictus Sestini Cur. val. P. Bernardus Toale Conf. NN. Cur. val. P. D. Leo Brand Oper. Praes. schol. paroch., domin., sod. B. V. M. et SS. Angel. Coll. pp. litt. ann. Script. hist. dom Conf. et conc. in T. Cons. an. 2 P. Gulielmus F. Hamilton Oper. Excur. ad Petersville et Manor P. Jacobus A. Ward Doc. gram. Conf. NN. Cons. an. 1 P. Joannes A. Buckley Doc. rhet. Praef. stud., schol. et bibl. Praef. lect. ad mens. et ton. P. Joannes Bapst Extra dom. Cur. val. Carolus B. Macksey Doc. hum An. 2 Jacobus F. Dunn Cur. val. PATRES TERTIAE PROBATIONIS P. Andreas Rapp P. Carolus Klein P. Daniel M. McElhinney P. David C. Daly P. Eduardus J. Gleeson P. Franciscus G. Gunn"
    },
    {
        "text": "P. Georgius E. Quin P. Gulielmus J. Tynan P. Jeremias F. X. Coleman P. Joannes A. Chester P. Joannes C. Kelly P. Joannes G. Fox P. Joannes Hogan P. Joannes Scully P. Josephus Grimmelsman P. Josephus H. Richards Praef. P. Josephus I. Ziegler P. Michael H. O'Brien P. Patritius J. Dooley P. Patritius Quill P. Salvator M. Brandi P. Thomas G. Wallace AUDITORES RHETORICAE Alexius C. McLaughlin Carolus F. Bridges Cat. ad S. Joann. Carroll J. Boone Mag. caer. Sub. bid. Cat. ad montes Gulielmus J. Holden Cat. nigrit. ad S. Joan. Jacobus B. Matthews Bid. Jacobus J. Walsh Cat. ad S. Joan. Jacobus S. Downs Bid. schol. Joannes T. Conwell Martinus Scott Patritius J. O'Gorman Praef. odei Patritius M. Collins Cat. ad S. Joan. Petrus J. O'Carroll Praef. cat. ad S. Joan. Thomas E. Scott Thomas M. Connell Organ. Cust. sac. SS. Cord. et SS. Angel Cat. ad S. Joan."
    },
    {
        "text": "AUDITORES HUMANIORUM Arthurus J. O'Leary Franciscus de S. Howle Cat. surd. et mut. Jacobus A. Waters Cat. nigrit. ad S. Joan. Joannes F. O'Donovan Cat. ad S. Joan. Joannes J. Neary Bid. schol. Cat. ad montes. L. Ricardus McLaughlin Cat. ad S. Joan. Philippus M. Finegan Cat. ad S. Joan. AUDITORES GRAMMATICAE Carolus N. Raley Carolus V. Lamb Cat. nigrit. ad S. Joan. David J. Roche Bid. schol. Cat. ad S. Joan. Jacobus A. Kennelly Cat. ad S. Joan. Joannes B. Carroll COADJUTORES VETERANI Blasius Walch Fab. horol. Franciscus F. Bowes Infirm. Franciscus Traynor Arment. Hermannus J. Schmidt Cust. vest. et sac. S. Jos Ad. dom. Vis. med. et exam. Jacobus Doyle Coq. Disp. Cust. cell. vin. Joannes F. Harkins Ludim. ad S. Joan Aedit. in T. Joannes Sheehy Senex Joannes Siebers Hortul. Josephus A. Vigeant Cur. val. Martinus O'Neill Stab. Ad dom. Michael Donohue Cur. val. Adj. janit. Michael Ryan Sut. Patritius Muldoon Janit. Ad dom. Ricardus Power Sart. Vis. mat. Virgilius S. Goulden Fab. lign. Excit. Vis. mat. Manud. Coadj."
    },
    {
        "text": "NOVITII SCHOLASTICI P Henricus Barry Extra dom. Augustus J. Duarte Gulielmus J. Brosnan Fridericus W. Heany Georgius A. Keelan Thomas F. White Aloisius J. Markham Georgius B. Rose Geraldus A. Dillon Joannes C. Harmon Josephus P. Carney Michael J. Mahony Terentius J. Shealy Franciscus C. Dillon Eugenius de L. McDonnell Joannes P. M. Walsh Joannes J. Thompkins Gulielmus J. O'Gorman Joannes J. Lunny Albertus G. Brown Eduardus S. Brock Joannes H. Mulligan Joannes J. McNulty Josephus N. Dinand Laurentius J. Kelly Mauritius E. Prendergast Thomas A. Becker Christophorus J. Donegan Josephus J. McLaughlin Arthurus M. Schmitz"
    },
    {
        "text": "NOVITII COADJUTORES Ferdinandus Steimer in coll. S. Cruce Joannes J. O'Connell in coll. Gonz. Audenus Campbell in coll. S. Franc. Allanus McKinnon Joannes J. O'Keefe Bernardinus B. Ousley Josephus C. Hurley Joannes Bath Gulielmus H. Forbes Casparus Jockel Eduardus F. Carley Antonius J. Paffe Carolus Steimer Franciscus X. Horwedel Audenus Thompson Eduardus O'Brien Thomas G. Costello Joannes J. O'Neill Jr. Sac. 34 Schol. 57 Coadj. 30 Univ. 121"
    },
    {
        "text": "COLLEGIUM MAXIMUM WOODSTOCKIANUM Sacratissimi Cordis Jesu WOODSTOCK COLLEGE, WOODSTOCK, MD. P. Petrus O. Racicot Rect. a die 25 Nov. 1883 Cens. libr. Cons. Prov. P. Gulielmus Pardow Vice Rect. P. Gulielmus H. Judge Min. Proc. Praef. val. Cons. an. 2 P. Aloisius Romano Lect. theol. dogm. comp. Exam. NN. Cens. libr. P. Aloisius Sabetti Lect. theol. mor Praes. coll. cas. consc. Praef. sac. Conf. et exam. NN Cens. libr. Coll. pp. litt. ann Script. hist. dom. Mod. acad. rit. Praes. virid. Exhort. NN. p. v. P. Antonius Maas Lect. ling. hebr. Mod. acad. hebr. Aud. theol. an. 4 P. Benedictus Guldner Lect. log. et metaph. gen. Exam. NN. Praef. ton. phil. Dir. WOODSTOCK LETTERS Cens. libr. Exhort. NN. p. v. Cons. an. 2 P. Carolus Piccirillo Praef. stud., bibl. et ton. theol Exam. NN. et cler. diaec Cens. libr. Cons. an. 9 P. Eduardus I. Devitt Lect. theol. schol. mat. Suppl. praef. stud. pro. libr. angl. Exam. NN Cens. libr. Excur. ad Poplar Springs Exhort. NN. p. v. Cons. an. 1 P. Georgius H. Worpenberg Lect. metaph. spec. 2 an. Exam. NN. Praef. lect. ad meus. Adj. cur. ger. paroch. P. Januarius M. Degni Lect. phys. et mechan. Conf. et exam. NN. Excur. ad Alberton P. Joannes B. Nagle Cur. ger. Woodstock et Harrisonville"
    },
    {
        "text": "P. Joannes S. Verdin Adm. Praef. spir. Conf. NN. Exhort. NN. p. v. P. Joannes T. Hedrick Lect. astron., math. et geol. Aud. theol. an. 2 P. Petrus Finlay Lect. theol. schol. pom. Exam. NN. Exhort. NN. p. v. P. Renatus Holaind Lect. S. Scrip., eth. et jur. nat. Conf. et exam. NN. Excur. ad Sykesville Cens. libr. P. Udalricus Heinzle Lect. metaph. spec. 3 an. Exam. NN. Joannes A. S. Brosnan Lect. chym. et math. Aud. theol. mor. an. 1 Patritius J. O'Sullivan Cur. val. AUDITORES THEOL. SCHOLASTICAE ANNO QUARTO P. Arthurus J. McAvoy P. Georgius A. Fargis P. Gulielmus B. Brownrigg P. Jacobus P. Fagan P. Joannes B. Kokenge P. Josephus Zwinge P. Martinus M. Bronsgeest P. Michael P. Hill P. Paulus Muset P. Raphael V. O'Connell P. Renatus Motte P. Timotheus Brosnahan ANNO TERTIO P. Alexander Freund Augustinus Effinger P. Augustinus Laure P. Daniel J. MacGoldrick Eduardus Allen Bid. schol. S. Script."
    },
    {
        "text": "Florentinus Bechtel Praef. bibl. theol. Gulielmus F. Hoffend Vis. med. et exam. P. Henricus Van Rensselaer Jacobus L. Smith Vis. med. et exam. Cat. FF. Joannes H. O'Rourke Vis. mat. et noct. Joannes M. Colgan Cat. famul. Josephus A. Murphy Expl. pp. med. FF Josephus H. Meuffels Josephus P. de Smedt Laurentius J. Kavanagh Vis. med. et exam. Michael A. McKey Michael Eicher P. Ricardus Gore ANNO SECUNDO Aloisius Maes Cust. mus. zool. Antonius T. Rinck Dionysius Mahony Emmanuel de la Moriniere Franciscus P. Powers Praef. odei Jacobus de Potter Bid. theol. Joannes Broderick Josephus Riordan Bid. schol. dogm. Patritius J. Mulconry Raphael Crimont ANNO PRIMO Abraham J. Emerick Edmundus J. O'Sullivan Franciscus B. Klocker Gulielmus B. Rogers Gulielmus Clark Gulielmus F. Rigge Henricus J. de Laak"
    },
    {
        "text": "Henricus Woods Jacobus J. Corbley Jacobus J. Sullivan Joannes F. Galligan Joannes F. Weir Joannes J. Wynne Adj. praef. bibl. dom. Josephus M. Stadelman Bid. schol. hebr. Josephus O'Reilly Patritius J. Casey Patritius J. Kennedy Patritius T. Kernan Ricardus E. Ryan Thomas E. Sherman Thomas O'Connor AUDITORES THEOL. DOGM. COMPENDIOSAE ANNO TERTIO Gulielmus J. Richley Vis. mat. et noct. Michael A. Noel Stephanus Bueno Vis. mat. et noct. Thomas S. Harlin Bid. schol. theol. dogm. comp. ANNO SECUNDO Augustus Delay Eduardus J. Hanhauser Adj. bid. theol Adj. praef. sac. Jacobus P. Moore Bid. schol. theol. mor Vis. mat. et noct. Joannes J. Rodock Patritius H. Kelly Vis. mat. et noct. Patritius J. McGinney Praef. acad. cant. greg."
    },
    {
        "text": "ANNO PRIMO Ambrosius M. Fontan Vis. med. et exam. Franciscus X. O'Neil Joannes Boschi Joannes B. Pittar Joannes C. Hart Adj. dir. WOODSTOCK LETTERS Josephus A. Mattson Michael J. Cunningham Rufus C. Duff Thomas E. Murphy Adj. dir. WOODSTOCK LETTERS AUDITORES PHILOSOPHIAE ANNO TERTIO A. J. Elder Mullan Praes. 1 acad. graec Vis. mat. et noct. Antonius Taillant Praes. 2 acad. graec. Vis. mat. et noct. Daniel J. Murphy Cat. ad Harrisonville Franciscus J. Finn Georgius C. O'Connell Cat. ad Alberton Vis. mat. et noct. Georgius Rittmeyer Praes. 3 acad. graec. Vis. mat. et noct. Henricus T. Casten Hubertus A. Post Cat. ad Harrisonville Jacobus F. Dawson Bid. schol. Joannes B. Lamb Bid. schol. eloc. Joannes B. Van der Pol Joannes G. Kuhlman Joannes J. O'Hara Joannes M. Coghlan Cat. ad Harrisonville Josephus Gillick Ludovicus E. Nicolet Marcellus Jannin Cat. ad Woodstock Martinus J. Hollohan"
    },
    {
        "text": "Michael A. Higgins Moyses A. Kavanagh Patritius J. Boyle Paulus Faget Philippus J. Murphy Cat. ad Dorsey's Run Thomas F. McLoughlin ANNO SECUNDO Ambrosius J. O'Connell Cat. nigrit. ad Woodstock Augustinus C. Porta Bernardus J. Otting Bid. phil. Bernardus Keany Vis. mat. et noct. Cat. nigrit. ad Wood stock Daniel P. Lawton Franciscus G. Russell Franciscus M. Connell Cat. ad Woodstock Gulielmus F. McGinn Gulielmus H. Fanning Bid. schol. Henricus G. Huermann Praef. bibl. phil. Vis. med. et exam. Jacobus A. McNulty Joannes B. Hemann Cat. ad Harrisonville Joannes H. Meyer Joannes J. Fleming Josephus A. Raby Josephus H. Smith Ludovicus E. Green Adj. lect. phys Cat. ad Alberton Marius Leautier Martinus J. Hussey Adj. lect. chym. Martinus Punghorst Vis. med. et exam. Michael J. Kane Adj. bid. phil. Michael R. McCarthy Robertus A. Henneman Cat. ad Alberton Thomas J. Conners"
    },
    {
        "text": "ANNO PRIMO Albertus Gilbert David H. Buel Praes. 4 acad. graec. Vis. med. et exam. Eduardus W. Raymond Vis. med. et exam. Felix Weis Vis. med. et exam. Franciscus G. Lenahan Cust. sac. mort. Franciscus J. Lamb Bid. schol. Franciscus J. McNiff Cust. sac. S. Joseph Franciscus J. Suter Franciscus P. Sansone Georgius A. Heuisler Adj. praef. bibl. dom. Gulielmus J. Talbot Cust. sac. SS. Angel. Gulielmus S. Singleton Henricus J. Dumbach Hubertus D. Gartland J. Barry Smith Joannes B. Moskopp Cust. sac. mort. Joannes C. Burke Joannes H. Lodenkamper. Laurentius J. Kenny Ludovicus Taelman Cust. sac. SS. Mart. Matthaeus H. McMenamy Michael A. Purtell Cat. ad Dorsey's Run COADJUTORES Alexander Walsh Excit. Ad dom. Bernardus Gaffney Hortul. Excit. Cajetanus Campone Cust. tricl. Cornelius Reardon Ad dom. Daniel Fortescue Cust. vest. Dominicus Leischner Vinit."
    },
    {
        "text": "Geraldus Barry Caement. Excit. Ad omn. Gulielmus Hill Fab. fer. Excit. Henricus Dugan Disp. Ad dom. Jacobus McDonnell Ad omn. Jacobus O'Kane Typogr. Vis. mat. et noct. Joannes B. Mattingly Arment. Joannes Cunningham Senex Joannes H. Hammill Extra dom. Cur. val. Joannes J. Quinn Aedit Ad dom. Joannes Langan Fab. lign. Josephus A. Wolff Comp. libr. Matthaeus McNerny Adj. cust. tricl Jan. Michael Cashman Adj. praef. bibl. Ad dom. Patritius Cassidy Ad omn. Patritius McGlone Cust. cell. vin. Raphael Vezza Fab. lign. Ricardus Dugan Infirm. Pict. Theodorus Vorbrinck Villic. Empt. Excit. Thomas Crowley Sut. Vis. med. et exam. Thomas Ekins Sart. Vis. mat. et noct. Thomas Nestor Coq. Sac. 33 Schol. 135 Coadj. 27 Univ. 195 5"
    },
    {
        "text": "RESIDENTIA BOHEMIENSIS S. Francisci Xaverii WARWICK, CECIL CO., MD. P. Joannes M. Giraud Sup. Coll. pp. litt. ann. Script. hist. dom Mission. excur. P. Joannes B. Archambault Oper. Excur. ad Chesapeake City et Middletown. P. Robertus W. Brady Oper. Joannes Hogan Coadj. Coq. Ad dom. Sac. 3 Coadj. 1 Univ. 4 RESIDENTIA S. IGNATII ST. INIGO'S, ST. MARY'S CO., MD. P. Joannes B. Gaffney Sup. Oper Proc. Excur. ad S. Michaelis Praes. schol. paroch. nigrit. P. Jacobus P. Neale Oper Excur. ad S. Nicolai, S. Georgii et Factory. COADJUTORES Joannes J. Welch Cust. sac. dom Ad dom. Joannes O'Connell Villic. Ad omn. Sac. 2 Coadj. 2 Univ. 4 RESIDENTIA LEONARDOPOLITANA Sancti Aloisii LEONARDTOWN, ST. MARY'S CO., MD. P. Carolus K. Jenkins Sup. Oper. Praes. sod. B. V. M. nigrit. et schol. domin. P. Cemens S. Lancaster Oper. Excur. ad S. Heart et Newtown Cons. an. 3"
    },
    {
        "text": "P. Eugenius McSwyney Oper. Excur. ad S. Joannis et Lady's Chapel Coll. pp. litt. ann Script. hist. dom. Praes. conf. bon. mort. et sod. B. V. M. nigrit. apud Lady's Chapel. P. Patritius Forhan Oper Excur. ad S. Joseph et Mechan icsville Cons. an. 1 Sac. 4 Univ. 4 RESIDENTIA S. THOMAE COX STA., CHARLES CO., MD. P. Ignatius Renaud Sup. Oper Praes. sod. B. V. M. vir. et mulier. P. Jacobus Wellworth Oper. in xenod. et nosoc Excur. ad Pomfret, Glymont et Hilltop Praes. sod. B. V. M. nigrit. apud Pomfret COADJUTORES Eduardus Green Pict. Aedit. Ad dom. Thomas F. McShea Fab. lign. Excit. Ad dom. Sac. 2 Coadj. 2 Univ. 4 RESIDENTIA WHITEMARSHENSIS SS. Cordis Jesu COLLINGTON, PRINCE GEORGE'S CO., MD. P. Carolus H. Heichemer Sup. Oper Excur. ad Brook's Chapel P. Jacobus Cotting Oper. COADJUTORES Daniel McCarthy Villic. Mauritius Cavanagh Aedit. Ad omn. Sac. 2 Coadj. 2 Univ. 4"
    },
    {
        "text": "IN STATU MASSACHUSETTS COLLEGIUM BOSTONIENSE 761 HARRISON AVENUE, BOSTON, MASS. P. Nicolaus Russo V. Rect. a die 1 Sep. 1887 Proc. Praef. stud Praes. coet. juv. cath., sod. B. V. M. puell., confr. bon. mort. et fil. Mar. ad N. D. Conf. et conc. in T. P. Michael J. Hughes Min Praef. val. et atr. Doc. math. 2 cl. Cons. an. 1 P. Alphonsus Charlier Adm. Praef. spir. Praef. eccl. Oper Coll. pp. litt. ann. Script. hist. dom. Praes. confr. SS. Cord. et S. Vinc. P. Archibaldus J. Tisdall Cur. val. P. Franciscus J. O'Neill Cur. ger. nosoc. municip. Conf. in T. P. Michael J. Byrnes Oper Praef. lect. ad mens Conf. et conc. in T. Conf. NN. Cons. an. 7 P. Patritius A. Halpin Oper. Cat. alumn. maj. Praes. coll. cas. consc. Adj. praes. coet. juv. cathol. Praef. spir. asyl. municip. puer. Praes. sod. B. V. M. juv. et fil. Mar. ad SS. Cor. Conf. et conc. in T. Cons. an. 2 P. Simon P. Dompieri Cur. val. Conf. NN. P. Thomas J. Gannon Lect. log., metaph. et eth. Conc. in T. Patritius F. Mulry Lect. phys. et chym. Praef. bibl. Praes. sod. B. V. M. alumn. Dir. STYLUS An. 4"
    },
    {
        "text": "MAGISTRI P. Patritius O'Reilly Doc. rhet. an. 15. mag., et math. 1 cl. Praes. sod. SS. Angel. et B. V. M. matron Praef. schol Conf. NN. et in T. Cons. an. 1 Timotheus B. Barrett Doc. hum. Praes. sod. dram. Bid. Adj. dir. STYLUS An. 5 Gulielmus J. Stanton Doc. supr. gram., ling. gall. 3 cl. et alg. 2 cl. An. 5 Josephus V. Schmidt Doc. med. gram., ling. germ. et alg. 2 cl. Mod. soc. S. Caecl. An. 4 Joannes Condon Doc. inf. gram., ling. gall. 4 cl. et arith. 2 cl. Mag. caer. An. 3 P. Michael C. Dolan Doc. elem. 1 cl. an. 7 mag. Cat. alumn. min Adj. praes. schol. domin Conf. in T. Henricus A. Judge Doc. elem. 2 cl. et alg. 1 cl An. 2 Josephus Renaud Adj. praef. atr Doc. math. 3 cl. et ling. gall. 1 cl. Mod. soc. litt. alumn. jun An. 5 COADJUTORES Jacobus Dwyer Cust. tricl. Ad dom. Joannes Curran Adj. coq. et infirm. Joannes Moriarty Coq. Excit. Petrus Tansey Jan. coll. Vis. med., utr. exam. et noct. Robertus Dockery Pict Infirm Ad dom. Theodolus Vachon Empt. Cust. vest. et cell. vin Adj. jan. Timotheus Fealey Aedit Ad dom Jan. coll. Sac. 11 Schol. 7 Coadj. 7 Univ. 25"
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS Sanctae Mariae 45 COOPER STREET, BOSTON, MASS. P. Gulielmus H. Duncan Sup. Proc. Oper. Praef. eccl. Praes. schol. paroch. puell., sod. B. V. M. matron., confr. SS. Cord., bon. mort., scap. sanct. et confr. S. Vinc Conf. et conc. in T. P. Antonius M. Mandalari Oper. in ins. Deer. et Rainsford in xenod. et carc. Instr. convers Coll. pp. litt. ann. Script. hist. dom. P. Franciscus T. McCarthy Sup. mission. excur. P. Fridericus J. Holland Oper Praes. sod. B. V. M. puell. Conf. et conc. in T. Conf. NN. Cons. an. 2 P. Gulielmus J. Scanlan Oper. Praes. sod. B. V. M. juv. Conf. et conc. in T. Conf. NN. Cons. an. 7 P. Josephus Vetter Adm. Praef. spir Conf. et conc. in T. P. Josephus J. Himmelheber Mission. excur. P. Matthaeus M. McDonald Mission. excur. P. Michael F. Byrne Oper Praes. schol. paroch. puer., schol. domin. et sod. B. V. M. puer. et puell. in schol. paroch. et domin Conf. et conc. in T. Cons. an. 1 P. Ronaldus B. Macdonald Mission. excur. P. Thomas A. Reid Oper Praes. sod. B. V. M. vir Conf. et conc. in T. Conf. NN. Cons. an. 4"
    },
    {
        "text": "COADJUTORES Jacobus Fitzgerald Ad dom. Vis. med. et utr. exam. Joannes McElroy Adj. jan. Cur. val. Patritius F. Quinn Cust. tricl. Excit Ad dom. Thomas Carberry Sacrist. Empt. Sac. 11 Coadj. 4 Univ. 15 RESIDENTIA BOSTONIENSIS SS. Trinitatis 21 LUCAS STREET, BOSTON, MASS. P. Franciscus X. Nopper Sup. Proc. Praef. eccl. Oper. Praes. schol. paroch., confr. SS. Cord. et S. Ros. vir. et matron. P. Ignatius Bellwalder Adm. Praef. spir. Conf. NN. Coll. pp. litt. ann. Script. hist. dom. P. Joannes P. M. Schleuter Oper. Praes. sod. B. V. M. juv. Excur. ad Plymouth et Manchester Cons. an. 2 P. Josephus Krieg Oper. Conf. NN. Praes. sod. B. V. M. puell. et bon. mort. Cons. an. 3 COADJUTORES Casper Menke Jan Aedit. Ad dom. Mathias J. Berchem Cust. tricl. et cell. Ad dom. Sac. 4 Coadj. 2 Univ. 6"
    },
    {
        "text": "COLLEGIUM S. CRUCIS ET CONVICTUS HOLY CROSS COLLEGE, WORCESTER, MASS. P. Samuel Cahill Rect. a die 23 Aug. 1887 Praef. stud. et schol Proc. P. Albertus R. Peters Min Praef. sac. et val. NN. Conf. et conc. in sac Cons. an. 7 P. Eduardus Hamon Miss. Excur. P. Henricus Duranquet Adm. Praef. spir Praes. coll. cas. consc. Exhort. dom Cat. FF. Doc. ling. gall. 1 cl. P. Joannes J. Ryan Extra dom. Cur. val. P. Timotheus O'Leary Lect. log., metaph. et eth. Conf. et cat. alumn. Conc. in sac Conf. NN Praef. lect. ad mens Mod. soc. lit. B. J. F. Cons. an. 3 Petrus A. Roche Lect. phys. et chym An. 4 MAGISTRI Aloisius P. Brosnan Doc. rhet. et eloc. Praef. odei An. 5 P. Henricus J. Shandelle Doc. hum. an. 12 mag. Conc. in sac Praes. sod. B. V. M. alumn. et bibl. Gulielmus S. Hayes Doc. sup. gram. et alg. 2 cl. Adj. praef. alumn An. 5 Audenus A. Hill Doc. med. gram. et math. 2 cl. Adj. praef. alumn An. 1 Albertus A. Ulrich Doc. inf. gram. et math. 3 cl. Adj. praef. alumn An. 1 Jacobus A. Gillespie Doc. rud. et arith. Adj. praef. alumn. An. 1 P. Hugo D. Langlois Doc. curs. spec. lat. an. 18 mag. et ling. gall. 3 cl. Conf. in sac."
    },
    {
        "text": "PRAEFECTI P. Gulielmus R. Cowardin Praef. atr. et val. alumn. Subm Cons. an. 1 P. Joannes F. Lehy Praef. atr. phil Doc. math. 1 cl. et ling. gall. 2 cl. Conc. in sac Script. hist. dom Coll. pp. litt. ann Adj. praef. schol Cons. an. 1. Thomas J. Cryan Adj. praef. atr. Doc. alg. 1 cl. et caligr. Praef. sod. SS. Angel Mod. soc. lit. philomath. An. 2 COADJUTORES Antonius Beckman Fab. lign. Aedit. Georgius H. Mansell Cust. vest. Ad dom. Excit. et vis. exam. Ferdinandus Steimer Infirm. Ad dom. Jacobus Strain Adj. proc. Ratioc Empt. Joannes Farrell Senex Joannes Hilbert Sart. Vis. exam. Joannes J. O'Neil Vis. noct. Ad dom. Michael Hogan Ad dom. Hortul. Michael J. Loftus Cust. tricl. NN. et cell. vin. Patritius Gallagher Coq. Patritius Nestor Adj. coq. Ad dom. Ricardus F. Furlong Cust. tricl. alumn. Excit. Vis. med. Sac. 10 Schol. 7 Coadj. 12 Univ. 29"
    },
    {
        "text": "IN STATU NEO CAESARIENSI COLLEGIUM S. PETRI INCHOATUM 144 GRAND ST., JERSEY CITY, N. J. P. Joannes McQuaid V. Rect. a die 31 Jul. 1880 Cur. ger. paroch Praef. eccl Proc Conf. et conc. in T. P. Carolus J. O'Connor Min Praef. stud., atr., val., lect. ad mens. et bibl. dom. Conf. et conc. in T. Mod. sod. fil. Mar. Cons. an. 1 P. David B. Walker Oper. Conf. NN. et alumn. Mod. sod. puer. et puell. et Imm. Concept. B. V. M. Conf. et conc. in T. Mod. confr. S. Vinc Cons. an. 2 P. Franciscus McAtee Adm. Praef. spir. Oper. Conf. alumn Mod. sod. SS. Cor. juv. Conf. et conc. in T. P. Joannes Cunningham Extra dom. Cur. val. P. Joannes H. Finnegan Oper. Conf. NN. et alumn. Mod. confr. bon. mort. et soc. temp Conf. et conc. in T. MAGISTRI Josephus M. Woods Doc. rhet. et arith. 1 cl. Adj. praef. atr. Mod. sod. B. V. M. Expl. pp. et med. FF. An. 5 Gulielmus F. A. Cunningham Doc. hum., geom., ling. gall. et eloc Mod. acad. curs. univ Adj. praef. atr. An. 3 Josephus F. Hanselman Doc. supr. gram., alg. et ling. germ. Adj. praef. atr. et bibl. alumn. Mod. sod. SS. Angel. Vis. med. et exam. merid An. 4"
    },
    {
        "text": "P. Franciscus B. Goeding Doc. med. gram. an. 6 mag. et alg. 2 cl. et ling. germ Mod. schol. domin. in eccl. inf. Cat. FF. Adj. praef. atr. Conf. alumn. P. Franciscus de S. Fullerton Doc. inf. gram. an. 7 mag. et trig. et geom. anal Mod. schol. domin. in eccl. super. Conf. alumn. et in T. Coll. pp. litt. ann. Script. hist. dom Cons. an. 2 Joannes G. Nicholson Doc. inf. gram. 2 cl. arith. 2 cl. Vis. exam. vesp An. 3 Franciscus X. Aigner Doc. ling. germ., arith. et schol. spec. lat Lect. chym Adj. praef. atr. et bibl. dom An. 2 COADJUTORES Gulielmus McElaney Cur. forn. Ad dom. Jacobus McNulty Aedit. Sart. Adj. cust. vest. Vis. med., utr. exam. et noct. Ad dom. Patritius Ranahan Coq. Ad dom. Thomas P. O'Donnell Cust. tricl. et vest. Disp. Adj. Coq. Excit Infirm Ad omn. Sac. 7 Schol. 5 Coadj. 4 Univ. 16"
    },
    {
        "text": "IN STATU PENNSYLVANIAE RESIDENTIA CONEWAGINENSIS Sacratissimi Cordis MCSHERRYSTOWN, ADAMS CO., PA. P. Joannes B. Mullaly Sup. Oper. Proc. Praes. sod. B. V. M. sen. et schol. paroch Conf. et conc. in T. P. Alphonsus Dufour Oper Excur. ad Oxford et Paradise Praes. sod. B. V. M. Cons. an. 1 P. Daniel A. Haugh Oper Conf. et conc. in T. Praes. confr. SS. Cord. et sod. B. V. M. jun Cons. an. 5 P. Joannes B. Emig Adm. Praef. spir Oper. Excur. ad Hanover Praes. sod. B. V. M. Red. KALEND. P. Petrus Manns Oper Excur. ad McSherrystown Conf. NN. et in T. Praes. confr. bon. mort. Cat. schol. paroch. COADJUTORES Hugo McGunegle Cust. vest Aedit. Excit. Ad dom. Robertus Hamilton Ad dom. Cust. tricl. Vis. med. et utr. exam. Sac. 5 Coadj. 2 Univ. 7"
    },
    {
        "text": "RESIDENTIA GOSHENHOPPENENSIS SS. Sacramenti BALLY, BERKS CO., PA. P. Joannes Harpes Sup. Oper. Praes. sod. B. V. M. et confr. bon. mort. Cat. in T. et ad Boyertown P. Joannes B. Meurer Oper Praes. soc. sanct. Cat. in T. Excur. ad Boyertown Sac. 2 Univ. 2 RESIDENTIA PHILADELPHIENSIS SS. Nominis Jesu THE GESU, 18th STILES STS., PHILADELPHIA, PA. P. Burchardus Villiger Sup. Oper Proc. Praef. eccl. Praes. confr. bon. mort. et animar. defunct. P. Eduardus D. Boone Min Oper. Conf. et conc. in T. Praef. bibl. Coll. pp. litt. ann. Script. hist. dom. Cons. an. 3 P. Alphonsus Coppens Oper Conf. et conc. in T. Praes. sod. B. V. M. Cons. an. 10 P. Carolus Cicaterri Adm. Praef. spir Oper. Conf. in T. Praes. coll. cas. consc. Vis. nosoc. P. Franciscus Casey Oper Conf. et conc. in T. Praes. schol. paroch. et domin Conf. NN. Cons. an. 1 P. Franciscus X. Brady Adj. dir. gen. apost. orat."
    },
    {
        "text": "P. Gulielmus H. Carroll Oper. Conf. in T., in carc. et sen. apud. sor. paup. P. Livius Vigilante Oper. Conf. in T. P. Petrus J. Blenkinsop Oper Conf. NN. et in T Cons. an. 5 P. Raphael S. Dewey Dir. gen. apost. orat. Red. MES SENGER COADJUTORES Arthurus Gormley Excit. Vis. med. et utr. exam Ad dom. Patritius J. Kennedy Aedit. Ad dom. Patritius Souren Jan. Adj. sart. Ad dom. Thomas McShane Cust. tricl. Disp. Sart. Ad dom. Sac. 10 Coadj. 4 Univ. 14 RESIDENTIA PHILADELPHIENSIS Sancti Joseph 317 WILLING'S ALLEY, PHILADELPHIA, PA. P. Joannes A. Morgan Sup. Oper. Proc. Praef. eccl. Praes. sod. SS. Cord. et schol. paroch Cens. libr. P. Jacobus T. Gardiner Min Praef. bibl. Doc. ling. lat Praes. confr. bon. mort. P. Antonius Bodewig Oper. Conf. et conc. in T. Praes. sod. B. V. M. jun Conf. NN. Coll. pp. litt. ann Script. hist. dom Cons. an. 2 P. Augustus Langcake Mission. excur. P. Jacobus J. Bric Oper Conf. et conc. in T. Praes. confr. S. Ros Cons. an. 3"
    },
    {
        "text": "P. Patritius A. Jordan Adm. Praef. spir Oper. Conf. et conc. in T. Praes. schol. domin. et sod. B. V. M. sen. P. Patritius Duddy Oper Conf. NN. et in T. COADJUTORES Joannes Dowling Vis. exam. Cust. vest Ad dom. Michael Nash Ad dom. Vis. exam. et med Infirm. Patritius Traynor Ad dom Excit Cust. tricl. et cell. vin. Sac. 7 Coadj. 3 Univ. 10 IN STATU RHODE ISLAND RESIDENTIA PROVIDENTIANA Sancti Joseph 92 HOPE ST., PROVIDENCE, R. I. P. Patritius H. Brennan Sup. Oper. Proc. Praef. eccl Praes. sod. B. V. M. juv., puer. et puell., et soc. sanct. Mod. soc. S. Vinc. Coll. pp. litt. ann. Script. hist. dom Praes. schol. domin. et paroch. P. Andreas P. Keating Oper. Praes. sod. B. V. M. fem. et confr. bon. mort. Conf. NN. Cons. an. 1 P. Henricus Kavanagh Oper. Praes. sod. B. V. M. vir Conf. NN. Mod. soc. SS. Cord. et confr. S. Ros Cons. an. 1 P. Jacobus Major Adm. Praef. spir Oper. Praes. sod. B. V. M. matron."
    },
    {
        "text": "COADJUTORES Eduardus Donnelly Aedit. Ratioc Ad dom. Vis. med. et utr. exam. Michael Hogan, Jr. Coq. Ad dom. Sac. 4 Coadj. 2. Univ. 6 IN STATU VIRGINIAE RESIDENTIA ALEXANDRINA Sanctae Mariae ST. MARY'S CHURCH, ALEXANDRIA, VA. P. Dionysius O'Kane Sup. Oper. Proc. Praes. schol. paroch. et domin., confr. bon. mort. Excur. ad Fairfax P. Hugo A. Quin Oper Praes. sod. B. V. M. et apost. orat. Praef. bibl Excur. ad Falls Church P. Joannes B. de Wolf Oper Praes. sod. B. V. M. et schol. domin. nigrit Coll. pp. litt. ann. Script. hist. dom. Sac. 3 Univ. 3"
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM In Romana P. Boursaud, Eduardus V. Subst. secr. Fesulis In Austriaco Hungarica P. Brett, Gulielmus P. Bien. recol. theol. scholast. P. Conway, Joannes A. Universitatsstrasse S. Innabruck, Tyrol In Taurinensi P. Holland, Jacobus F Oper Doc. rhet. angl. NN. Conf. in T. P. Voung, Edmundus J. Doc. rhet. in coll. S. Clarae Wall, Bernardus L. Schol. Cur. val. Santa Clara College, Santa Clara, Cal. In Veneta P. Muller, Augustus Doc. ling. lat., angl. et hist. in coll. S. Aloisii, Mangalore St. Aloysius's College, Mangalore, East India In Missione Neo Aurelianensi P. Whitney, Joannes D. Praef. stud. et dicipl. Doc. math. in coll. Spring Hill Spring Hill College, near Mobile, Ala. Sac. 7 Schol. 1. Univ. 8"
    },
    {
        "text": "EX ALIIS PROVINCIIS IN NOSTRA DEGENTES Ex Romana P. Massi, Pius P. Cardella, Philippus Ex Angliae P. Hamon, Eduardus Ex Austriaco Hungarica P. Prachensky, Josephus P. Holzer, Joannes Ex Belgica De Pooter, Fridericus Coadj. Ex Campaniae P. Petitdemange, Carolus Leischner, Dominicus Coadj. P. Thiry, Theodorus Risler, Aemilius P. Vetter, Josephus Ex Franciae P. Daubresse, Isidorus P. Perron, Jacobus Mace, Julius Coadj. P. Loyzance, Josephus Ex Germaniae P. Bodewig, Antonius P. Nopper, Franciscus X. P. Richard, Hermannus P. Heinzle, Udalricus P. Schleuter, Joannes P. M. P. Krieg, Josephus Ex Hiberniae P. Finlay, Petrus"
    },
    {
        "text": "Ex Missouriana P Bronsgeest, Martinus M. Henneman, Robertus A. Sch. P Gleeson, Eduardus J. Hoffend, Gulielmus F Huermann, Henricus G. P. Grimmelsman, Josephus Hussey, Martinus J. P Kelly, Joannes C. Kavanagh, Moyses A. P Kokenge, Joannes B. P. Verdin, Joannes S. Kenny, Laurentius J. Klocker, Franciscus B. P Worpenberg, Georgius H. Bechtel, Florentinus Kuhlman, Joannes G. Boyle, Patritius J. Lodenkamper, Joannes H. Burke, Joannes C. McGinn, Gulielmus F Conners, Thomas J. McMenamy, Matthaeus Corbley, Jacobus J. Meuffels, Josephus H. De Laak, Henricus J. Mulconry, Patritius J. De Smedt, Josephus P. Murphy, Josephus A. Dumbach, Henricus J. O'Neil, Franciscus X. Effinger, Augustinus Otting, Bernardus J. Eicher, Michael Rigge, Gulielmus F. Fanning, Gulielmus H. Rogers, Gulielmus B. Finn, Franciscus J. Sherman, Thomas E. Gartland, Hubertus Sullivan, Jacobus J. Gillick, Josephus Suter, Franciscus J. Hanhauser, Eduardus J. Talbot, Gulielmus J. Weir, Joannes F. Hemann, Joannes B. Ex Neapolitana Gilbert, Albertus Sch. P Brandi, Salvator M. P Degni, Januarius M. Campone, Cajetanus Coadj. P Motte, Renatus Vezza, Raphael P. Romano, Aloisius"
    },
    {
        "text": "Ex Taurinensi P. Laure, Augustinus Moskopp, Joannes B. P Muset, Paulus Post, Hubertus A. P. Van Rensselaer, Henricus Punghorst, Martinus Allen, Eduardus Rinck, Theodorus Boschi, Joannes Riordan, Josephus Sansone, Franciscus P. Crimont, Raphael Taelman, Ludovicus Delay, Augustus Mahony, Dionysius Van der Pol, Joannes B. Weis, Felix McKey, Michael A. Woods, Henricus Sch. Ex Veneta P. Cicaterri, Carolus Ex Missione Neo Aurelianensi P Desribes, Josephus Kennedy, Patritius J. Sch. P. Dufour, Alphonsus Lawton, Daniel P. P. Freund, Alexander Leautier, Marius P Gache, L. Hippolytus Meyer, Joannes H. P. Gore, Ricardus Moore, Jacobus P. P. Holaind, Renatus Moriniere de la, Emman'l P. Hogan, Joannes Murphy, Daniel P. Klein, Carolus Murphy, Philippus De Potter, Jacobus Nicolet, Ludovicus E. Faget, Paulus O'Connor, Thomas Fontan, Ambrosius M. O'Reilly, Josephus Green, Ludovicus E. Porta, Augustinus Higgins, Michael A. Raby, Josephus A. Jannin, Marcellus Rittmeyer, Georgius Taillant, Antonius Sch. Sac. 40 Schol. 78 Coadj. 6 Univ. 124"
    },
    {
        "text": "ADDENDUM IN COLLEGIO GEORGIOPOLITANO Jacobus R. Gray Doc. elem. 2 cl. et arith. 3 cl. Praef. cubic. An. 3"
    }
]