[
    {
        "text": "1886"
    },
    {
        "text": "R. P. ROBERTUS FULTON PRAEPOSITUS PROVINCIALIS A Die 28 Maii, 1882. 39 W. 15th Street, New York City. P. GULIELMUS PARDOW Soc. a die 31 Julii, 1884 Cons. Prov Adm. Josephus Kain Soc. Coadj. CONSULTORES PROVINCIAE P. RECTOR COLLEGII MAXIMI P. RECTOR DOM. PROB. FRIDERIC P. RECTOR COLL. S. FRANC. XAVER P. SOCIUS R. P. PROVINCIALIS"
    },
    {
        "text": "IN STATU NEO EBORACENSI COLLEGIUM S. FRANCISCI XAVERII 39 W. 15th STREET, NEW YORK CITY. P. Joannes J. Murphy Rect. a die 20 Aug. 1885 Praef. eccl. et stud Proc. Cons. prov. P. Gulielmus H. Carroll Min Praef. val. Cons. an. 2 P. Alphonsus Dufour In ins. Blackwell Oper. in xenod. et carc. P. Antonius Bodewig Oper. Conf. in T. P. Augustus J. Thebaud Script. Cens. libr. Conf. NN. et in T. Cons. an. 8 P. Carolus J. O'Connor Oper Conf. in T. Cur. ger. schol. paroch., schol. domin., confr. bon. mort., sod. B. V. M. puer. P. Dionysius A. Kelley Oper. in xenod. et carc. in ins. Hart P. H. Carolus Denny Oper Conf. et conc. in T. Praes. sod. fil. Mar. Exhort. alumn. P. Henricus Duranquet Cur. ger. miss. ins Oper. in xenod. et carc. P. Isidorus Daubresse Conf. NN. et in T. Praes. coll. cas. consc. sacer. saec Cens. libr. P. Jeremias O'Connor Lect. ethic. Oper Conf. et conc. in T. Conf. et exhort. alumn. P. Joannes B. Jungck Dir. mus Praef. atr. P. Joannes Holzer In nosoc. Neo Caes Oper."
    },
    {
        "text": "P. Joannes Prendergast Lect. log., metaph. et phil. relig. Conf. et conc. in T. P. Josephus Desribes In ins. Blackwell Oper. in nosoc. et carc. P. Josephus Prachensky In ins. Ward Oper. in nosoc. P. Mauritius Ronayne Adm. Praef. spir. et bibl. Conf. NN. et in T. Lect. hist. Cens. libr. P. Nilus N. McKinnon Adj. praef. eccl. Conf. et conc. in T. Praes. sod. SS. Cord., S. Ros. et puell. Mar. Conf. alumn. Cons. an. 5 P. Patritius F. Dealy Oper Conf. in T. Mod. sod. alumn. vet et Un. Xav. P. Petrus Cassidy Praef. stud. inf., schol., et lect. ad mens Conc. in T. Cons. an. 2 P. Philippus Cardella Cur. ger. Hisp. Praes. coll. cas. consc. NN. Conf. NN. P. Raphael Gelinas Oper. in xenod., carc. etc. in ins. Randall et Ward P. Ricardus J. Whyte Oper Conf. in T. Praes. sod. SS. Sitis P. Theodorus Thiry Conf. NN., alumn. et in T. Mod. 1 Sod. alumn. Praes. sod. B. V. M. vir., acad. jun. opif. et soc. S. Inf. Dionysius O'Sullivan Lect. math. subl., phys. et chym. Doc. cat. in T. MAGISTRI Joannes J. Wynne Doc. rhet. an. 3 mag. Coll. pp. litt. ann. Dir. XAVIER Mod. acad. phil. et rhet. Bid. Martinus J. Hollohan Doc. hum. an. 5 mag. Gulielmus S. Hayes Doc. supr. gram. an. 3 mag. et arith. Mod. acad. hum. Daniel A. Doherty Doc. med. gram. an. 2 mag. Mod. 2 sod. alumn. et acad. gram. Thomas Haggerty Doc. inf. gram. 1 cl. 1 sect. an. 4 mag. et alg."
    },
    {
        "text": "Eduardus J. Magrath Doc. inf. gram. 1 cl. 2 sect. an. 2 mag. et arith. Expl. pp. med. FF. Gulielmus H. A. Coyle Doc. inf. gram. 2 cl. an. 1 mag. et alg. Petrus Kayser Doc. math. Vis. med. et exam. Gulielmus H. Walsh Praef. curs. praepar. Mod. sod. Inf. Jesu et soc. dram Aud. theol. compend. David H. Buel Adj. praef. atr. Praef. bibl. alumn. COADJUTORES Aemilius Risler Doc. calligr. Aedit. sac. dom Vis. exam. vesp. Ad dom. Conradus Meyer Cust. vest Infirm. Dionysius Hogan Arcul. Ad dom. Hugo Reilly Adj. aedit. Joannes Doran Coq. Vis. med. et noct. Joannes Dowdle Aedit. Praef. quaest. Ad dom. Joannes Flood Praes. famul Adj. infirm Ad dom. Josephus Bradley Adj. cust. tricl. Ad dom. Josephus A. Wilson Cust. tricl. Josephus Koerner Adj. proc. Ad dom. Patritius Brady Cust. calor. Ad dom. Senanus Mangan Empt. Disp. Thomas Gormley Fab. plumb Excit Vis. exam. mat. et vesp. Ad dom. Timotheus McNamara Ad dom. Sac. 24 Schol. 11 Coadj. 14 Univ. 49"
    },
    {
        "text": "COLLEGIUM S. JOANNIS ET CONVICTUS ST. JOHN'S COLLEGE, FORDHAM, NEW YORK CITY. P. Thomas J. Campbell Rect. a die 20 Aug. 1885 Praef. stud Exhort. alumn. P. Jacobus B. Becker Min Praef. eccl. et val. NN. Conf. et exhort. alumn. Doc. math. Cons. an. 1 P. Eduardus Doucet Lect. phil. relig. et hist. phil. et rhet. Mod. soc. hist. Praef. bibl. Conf. NN. et in T. P. Eduardus McTammany Lect. math. subl. Conc. in T. Adj. praef. stud. P. Georgius E. Quin Praef. discip. et val. alumn. Subm. Exhort. alumn. Cons. an. 1 P. Joannes H. Finnegan Oper. Cur. ger. paroch. Praes. sod. S. Ros. et schol. domin. P. L. Hippolytus Gache Praef. spir Adm. Conf. NN Expl. pp. med. FF. P. Ludovicus Jouin Lect. log., metaph. et ethic. Conf. NN. et alumn. Praes. coll. cas. consc. sacer. saec. et NN. P. Nicolaus Hanrahan Proc. Conf. NN. Cons. an. 11 P. Thomas J. A. Freeman Lect. scient. nat. Conc. in T. Cat. et conf. surd. et mut. Cens. libr. Cons. an. 2 MAGISTRI P. Patritius O'Reilly Doc. rhet. an. 11 mag. Conf. et ex hort. alumn. Mod. 3 sod Praef. lect. ad mens Mod. acad. phil. et rhet. Dir. FORDHAM COLLEGE MONTHLY Gulielmus G. R. Mullan Doc. hum. an. 3 mag. Mod. 2 sod Adj. praef. alumn."
    },
    {
        "text": "Joannes F. Quirk Doc. supr. gram. an. 3 mag. Mod. soc. dram Praef. mus Doc. eloc. 1 cl. Adj. praef. alumn. Josephus Renaud Doc. med. gram. an. 2 mag. Adj. praef. alumn. Coll. pp. litt. ann. Script. hist. dom. Ludovicus A. Weber Doc. inf. gram. 1 cl. an. 2 mag. Adj. praef. bibl. et alumn. Josephus J. Prendergast Doc. inf. gram. 2 cl. an. 1 mag. Expl. cat. famul Adj. praef. alumn. P. Michael Flynn Doc. rhet. in curs. comm Conf. et exhort. alumn Doc. ling. gall Expl. cat. FF. Mod. 1 sod. PRAEFECTI Joannes C. Hart Doc. math. et in curs. comm. Joannes G. Nicholson Doc. in curs. comm. Joannes J. Collins Doc. ling. lat. in spec. curs. Patritius A. McQuillan Doc. ling. graec. in spec. curs. Doc. eloc. 2 cl. Thomas J. Walsh COADJUTORES Alexander A. McDonnell Arcul. Ad dom. Antonius Dooher Cur. ger. offic. pist. Ad dom. Dionysius Considine Cust. vest. alumn. Vis. med. Ad dom. Fridericus de Pooter Adj. hortul Ad omn. Fridolinus Hoefele Arcul. Ad dom. Gulielmus Hennen Cur. val. Jacobus Early Coq. Jacobus Egan Adj. coq. Ad dom. Jacobus Mallen Cust. tricl. Jeremias Flaherty Cust. aulae S. Joan. Joannes Paffe Sart. Ad dom. Joannes Sheerin Adj. sart. et cust. vest. Vis. exam. merid. Ad dom. Josephus Byrne Adj. cust. tricl. Ad dom."
    },
    {
        "text": "Julius Mace Doc. mus. Excit. Ad dom. Leo Kutter Cust. vest. NN. et domest Aedit. sac. coll Adj. disp. Vis. noct. Ludovicus Kaiser Aedit. in eccl. Matthaeus Devine Villic. Matthaeus Gilshannen Disp. Vis. exam. vesp. Mauritius Roach Infirm. Michael Rogers Arcul. Ad omn. Nicolaus Paradise Sut Empt. Patritius Corrigan Caement. Ad omn. Patritius Smith Cur. forn. Ad dom. Thomas Hallahan Pict. Praes. famul. Adj. infirm Ad dom. Thomas F. McShea Adj. villic. Ad dom. Sac. 12 Schol. 10 Coadj. 25 Univ. 47 RESIDENTIA NEO EBORACENSIS AD S. LAURENTII 1480 PARK AVENUE, NEW YORK CITY. P. David A. Merrick Sup. Cur. ger. paroch Oper Mod. sod. puell Cens. libr. P. Carolus Petitdemange Oper. Cons. an. 9 P. Gulielmus Moylan Oper Adm. Praef. spir. et bibl. Praes. coll. cas. consc. Praes. sod. matron., SS. Cord. et Ros Cat. puer. et puell. Coll. pp. litt. ann Script. hist. dom. P. Patritius H. Toner Oper. Praes. confr. bon. mort., sod. juv. et puer. et soc. temp. Cur. ger. schol. paroch Cons. an. 4"
    },
    {
        "text": "COADJUTORES Carolus Brendle Vis. med. et utr. exam. Excit. Disp. Ad dom. Joel Miville Aedit. Cust. vest. Ad. dom. Michael Kays Jan. Ad dom. Patritius Farrell Coq. Empt. Ad dom. Sac. 4 Coadj. 4 Univ. 8 RESIDENTIA NEO EBORACENSIS AD S. JOSEPH 408 E. 87th ST., NEW YORK CITY. P. Josephus Busam Sup. Cur. ger. paroch Oper Proc. Praes. sod. matron. et confr. bon. mort. Cat. puer. et puell. P. Hermannus Blumensaat Oper. Praes. sod. puell Cat. puer. et puell. P. Hubertus Heidenreich Oper. Praes. sod. juv. Cat. puer. et puell. Henricus Rimbaugh Coadj. Coq Ad omn. Sac. 3 Coadj. 1 Univ. 4"
    },
    {
        "text": "RESIDENTIA TROJANA AD S. JOSEPH 3RD AND JACKSON STS. TROY, N. Y. P. Josephus Loyzance Sup. Cur. ger. utriusq. eccl. Proc. Oper Praes. sod. fil. Mar., SS. Ros, pur. Cor. Mar., soc. S. Vinc., S. Jos. et prop. fid Coll. pp. litt. ann Script. hist. dom. P. Allanus McDonnell Cur. val. P. Franciscus Casey Oper Praes. sod. B. V. M. juv. et vir. Conf. NN. Cons. an. 3 P. Josephus Delabays Oper Praes. coll. cas. consc. Conf. NN. et orph. P. Michael Nash Oper. in eccl. S. Michael Praes. confr. bon. mort., SS. Ros. et sod. puer. et puell. Conf. NN. Cons. an. 3 P. Patritius Gleason Adm. Praef. spir Oper. Conf. NN Praes. sod. SS. Cor. Jesu et S. Sitis P. Victor Garrand Oper Conf. NN. et in xenod. Expl. cat. et pp. med. FF. Cat. puer. et puell. schol. paroch. Praef. bibl. COADJUTORES Franciscus X. Brady Aedit. in eccl. S. Mich. Ad dom. Jacobus O'Brien Vis. med., utr. exam. et noct. Cur. forn Ad dom. Martinus Ealy Coq Cust. tricl. Excit. Thomas Hogue Aedit Empt. Disp. Cust. vest Jan. Sac. 7 Coadj. 4 Univ. 11"
    },
    {
        "text": "IN DISTRICTU COLUMBIAE COLLEGIUM GEORGIOPOLITANUM et Convictus GEORGETOWN COLLEGE, D. C. P. Jacobus A. Doonan Rect. a die 17 Aug. 1882. Proc. Conc. in sac. P. Michael A. O'Kane Min. Praef. schol. et val. Praes. sod. B. V. M. alumn. maj. Conc. in sac Cons. an. 3 P. Eduardus I. Devitt Praef. stud. Lect. log, metaph. et ethic. Doc. cat. conv. maj. Conf. NN. Conf. et conc. in sac Mod. soc. philod Cons. an. 3 P. Jacobus Curley Dir. Spec. astron. Cust. virid. bot Conf. NN. P. Joannes W. Fox Lect. chym. Submin. Conf. in sac Excur. ad Tennallytown P. Patritius F. Healy Extra dom. Cur. val. P. Pius Massi Praef. spir Conf. NN. et in sac. Praes. coll. cas. consc. Coll. pp. litt. ann. Script. hist. dom. Expl. cat. FF. P. Samuel H. Frisbee Lect. phys. Conf. NN. et in sac Conc. in sac Expl. pp. med. FF."
    },
    {
        "text": "MAGISTRI P. Eduardus Connolly Doc. rhet. an. 11 mag. Praes. cl. eloc. maj Conf. et conc. in sac Praef. lect. ad mens. Cons. an. 2 Gulielmus Clark Doc. hum. an. 4 mag. Praef. cubic. Praef. bibl. Joannes B. Lamb Doc. sup. gram. an. 3 mag. et ling. gall. 1 cl. Mod. soc. philon Praef. cubic. Praes. cl. eloc. min. Gulielmus F. A. Cunningham Doc. gram. med. an. 1 mag. et math. 2 cl. Praef. odei et cubic. Josephus A. Gorman Doc. inf. gram. an. 2 mag. et math. 3 cl. Adj. praef. alumn. Ricardus E. Ryan Doc. elem. 1 cl. an. 1 mag. et arith. 3 cl. Praef. cubic. Eduardus F. Roche Doc. elem. 2 cl. an. 1 mag. Adj. praef. alumn. Thomas E. Murphy Doc. cl. spec. an. 4 mag. et alg. Adj. praef. alumn. Thomas A. McLaughlin Doc. math. 1 cl. et ling. gall. 2 cl. PRAEFECTI P. Gulielmus R. Cowardin Praef. 1 conv. maj. Doc. cat. conv. min Cons. an. 1 Petrus J. O'Carroll Praef. 1 conv. min Doc. arith. 1 cl. V. Howard Brown Adj. praef. alumn. Doc. alg. et ling. gall. 3 cl. Praes. sod. B. V. M. alumn. min. Joannes J. Greene Adj. praef. alumn. Doc. math. 3 cl. et ling. gall. 3 cl. Michael A. Conway Expect. dispos. COADJUTORES Aloisius Roth Cust. vest. alumn. min. Cur. baln. et lavac. Daniel Clarke Cur. val. Franciscus Bausenwein Sartor. Aedit. sac. dom. Vis. med. et utr. exam."
    },
    {
        "text": "Georgius F. Schaffner Disp. Coq. Gulielmus Dugan Ratioc. Adj. proc. Jacobus Marley Aedit. Cust. tricl. NN. Jacobus M. McCloskey Cust. vest. alumn. maj. Jacobus O'Sullivan Fab. lign. Jacobus T. O'Sullivan Fab. ferr. Ad dom. Joannes Daly Ad dom. Joannes J. Quinn Infirm. Joannes Rowley Pict. Arment. Patritius Devine Cust. tricl. alumn. Patritius Donlan Adj. cust. tricl. NN. Ad dom. Patritius McCann Sut. Ad dom. Patritius Sears Cust. cell. vin. Ricardus Barrett Adj. ratioc. Excit. Thaddaeus McKenna Cur. val. Thomas Dougherty Sut. Comp. libr Empt. Ad dom. Thomas Gavan Pist. Ad dom. Thomas Shanahan Cur. val. Sac. 10 Schol. 12 Coadj. 21 Univ. 43 RESIDENTIA GEORGIOPOLITANA AD SS. TRINITATIS TRINITY CHURCH, GEORGETOWN, D. C. P. Stephanus A. Kelly Sup. Proc. Praef. eccl. Oper Praes. schol. puer. ad SS. Trin., sod. bon. mort., apost. orat. et B. V. M. P. Aloisius Roccofort Oper. Praes. schol. domin., confr. B. P. Clav. et S. Caec. Martinus Whelan Coadj. Aedit. Ludim Ad dom. Sac. 2 Coadj. 1 Univ. 3"
    },
    {
        "text": "COLLEGIUM GONZAGENSE 47 I St. N. W., WASHINGTON, D. C. P. Eduardus A. McGurk Rect. a die 21 Aug. 1885 Proc. Praef. stud. et schol Praef. bibl. P. Hieronymus Daugherty Min. Doc. ling. angl. 1 cl Conf. in T. Praes. coll. cas. consc. Praes. sod. jun. et schol. domin Praef. lect. ad mens Coll. pp. litt. ann. Cons. an. 1 P. Bernardus A. Maguire Adm. Praef. spir. Conf. et conc. in T. Cat. alumn. in coll. Conf. NN. P. Daniel J. McGoldrick Conc. in T. Praef. soc. lit. exter. P. Jacobus Noonan Oper Conf. et conc. in T. Praes. sod. juv. et puell. Praes. schol. paroch. Conf. NN. Cons. an. 5 P. Patritius J. O'Connell Oper Conf. et conc. in T. Praes. soc. ad liq. eccl. deb. Conf. NN. MAGISTRI Franciscus P. Powers Doc. hum. et supr. gram. an. 4 mag., math. 2 cl. et calligr. Praef. odei et atr. Josephus A. Mattson Doc. med. gram. an. 4 mag., alg. et ratioc. Script. hist. dom. Praes. soc. milit. discip. Bid. Patritius H. Kelly Doc. inf. gram. an. 4 mag., ling. germ. et arith. 1 cl. Adj. praef. bibl. et atr. Mod. soc. Phocion. Jacobus F. X. Mulvaney Doc. rud. 1 cl. an. 2 mag., arith. 2 cl. et calligr. Adj. praef. schol Praef. 1 sod. alumn. Vis. med. et utr. exam."
    },
    {
        "text": "Eduardus P. Spillane Doc. rud. 2 cl. an. 3 mag., alg. et calligr. Mag. caer. Praef. 2 sod. alumn. Carolus C. Cantillon Doc. ling. angl. 2 cl., ling. gall. et arith. 3 cl Aedit. sac. dom. COADJUTORES Matthaeus O'Connor Sacrist. Ad dom. Thomas Kelley Coq. Excit. Thomas Kennedy Adj. proc Empt. Ratioc Aedit. Sac. 6 Schol. 6 Coadj. 3 Univ. 15 RESIDENTIA WASHINGTONIENSIS AD S. JOSEPH C 2d STS. N. E., WASHINGTON, D. C. P. Joannes P. M. Schleuter Sup. Proc. Praef. eccl. Oper. Praes. sod. B. V. M. puell. et matron., S. Vinc. et schol. paroch Cat. in T. et schol. paroch. Cur. ger. paup. in dom. sor. paup. Conf. NN. P. Joannes A. Jansen Oper. Praes. sod. B. V. M. vir. et juv. et confr. bon. mort. Cat. in schol. paroch. Conf. NN. Michael Hogan, Jr. Coadj. Coq. Ad omn. Sac. 2 Coadj. 1 Univ. 3"
    },
    {
        "text": "IN STATU MARYLANDIAE COLLEGIUM LOYOLAEUM CALVERT MADISON STS., BALTIMORE, MD. P. Franciscus A. Smith Min Proc. Conf. et conc. in T. Praes. sod. B. V. M. in T. Cons. an. 2 P. Antonius Van den Heuvel Extra dom. Cur. val. P. David C. Daly Praef. stud. et val. Submin. Adj. proc. Conf. in T. Cons. an. 2 P. Eduardus J. Sourin Conf. NN. Cur. val. P. Franciscus Ryan Praef. eccl. Conf. et conc. in T. Praes. sod. bon. mort. Mod. sod. B. V. M. puer. et puell Cons. an. 1 P. Gulielmus F. Clarke Oper Conf. et conc. in T. Conf. NN. Cat. alumn. Praes. coll. cas. consc. P. Joseph M. Ardia Praef. spir Conf. NN. et in T. Expl. cat. et pp. med. FF. P. Petrus P. Fitzpatrick Lect. log., metaph. et eth. Conf. et conc. in T. Praes. confr. SS. Cord. et apost. orat Cons. an. 5 P. Thomas W. Hayes Proc. prov Adm. bon. Joannes A. Brosnan Lect. phys., chym. et math. 1 et 2 cl. Mod. sod. Inf. Jesu"
    },
    {
        "text": "MAGISTRI Thomas J. Gasson Doc. rhet. et hum. an. 3 mag. Praef. bibl. alumn., lect. ad mens. et soc. litt. Praes. sod. B. V. M. alumn. Bid. Coll. pp. litt. ann. Script. hist. dom Adj. praef. bibl. Doc. eloc. 1 cl. Josephus M. Stadelman Doc. sup. gram. an. 1 mag., ling. germ. 1 cl. et arith. 2 cl. Cust. repos. lib. Jacobus R. Gray Doc. med. gram. an. 1 mag., math. 3 cl. et ling. gall. 3 cl. Josephus H. Hann Doc. inf. gram. an. 3 mag., ling. germ. 2 cl., arith. 3 cl. et eloc. 2 cl. Praef. odei Adj. praef. bibl. Vis. med. Geraldus I. Bergan Doc. rud. 1 cl. an. 1 mag., arith. 1 cl. et ratioc Praef. atr. Mag. caer. et praef. min. Henricus J. Rache Doc. rud. 2 cl. an. 1 mag. et ling. gall. 1 et 2 cl. Adj. praef. atr. et praef. bibl. Milesius A. McLaughlin Doc. schol. prep. et alg. Vis. exam. COADJUTORES Daniel McLaughlin Aedit. Ad dom. Eduardus Green Pict. Ad dom. Eduardus Shannahan Coq. Adj. empt. Joannes Fortescue Adj. proc Empt. Ratioc. Georgius H. Mansell Cust. cubic. Ad dom. Nicolaus Schu Sart. Cust. vest Aedit. sac. dom. Excit. Timotheus O'Sullivan Cust. cell. vin. Vis. med., utr. exam. et noct Ad dom. Sac. 9 Schol. 8 Coadj. 7 Univ. 24"
    },
    {
        "text": "DOMUS PROBATIONIS FRIDERICOPOLITANA ad S. Joannis Evangelistae NOVITIATE, FREDERICK, MD. P. Archibaldus J. Tisdall Rect. a die 1 Oct. 1877 Mag. Nov. Cons. prov. P. Jacobus Perron Instr. PP. 3 prob. Praef. spir. Conf. NN. Praes. coll. cas. consc. P. Gulielmus H. Sumner Min. Sup. jun. Soc. mag. nov. Proc. Praef. val. Coll. pp. litt. ann. Script. hist. dom Conf. in T. Cons. an. 7 P. Antonius F. Ciampi Adm. Praef. eccl. Oper. Praes. schol. S. Joan., sod. B. V. M. et SS. Angel. Conf. NN. Cons. an. 4 P. Bernardus Toale Oper Conf. NN. et in T. P. Jacobus Casey Doc. rhet. Praef. stud., schol. et bibl. Conf. NN. Cons. an. 1 P. Joannes Bapst Extra dom. Cur. val. P. Josephus J. Himmelheber Oper. Excur. ad Petersville et Manor Cornelius J. Clifford Doc. hum Praef. lect. ad mens. et ton. PATRES TERTIAE PROBATIONIS P. D. Leo Brand P. Franciscus de S. Fullerton P. Georgius H. Worpenberg P. Henricus J. Shandelle P. Henricus J. Votel P. Jacobus Rebmann P. Patritius H. Brennan P. Reinhardus Rosswinkel P. Samuel Cahill Praef. Joannes J. Becket"
    },
    {
        "text": "AUDITORES RHETORICAE Αnno Secundo Ambrosius J. O'Connell Praef. odei Cust. sac. B. V. M. Bernardus Keany Carolus F. Bridges Sub. bid. Franciscus G. Russell Cust. bibl. jun. Franciscus M. Connell Jacobus A. McNulty Bid. schol. Jacobus F. Dunn Bid. Mag. caer. Joannes F. Fleming Josephus H. Smith Cust. sac. SS. Cord. et SS. Angel. Michael R. McCarthy Anno Primo Eduardus W. Raymond Vis. asyl. surd. et mut. Franciscus J. McNiff Georgius A. Heuisler Vis. asyl. surd. et mut. Bid. schol. Georgius C. O'Connell Gulielmus S. Singleton Julianus de Coster Michael A. Purtell Michael J. Kane Paulus Dethoor COADJUTORES VETERANI Blasius Walch Fab. horol. Franciscus F. Bowes Infirm. Franciscus Traynor Arment. Jacobus Doyle Coq. Disp. Cust. cell. vin. Joannes F. Harkins Ludim. ad S. Joan Aedit. in T. Joannes Sheehy Cur. val. Joannes Siebers Hortul."
    },
    {
        "text": "Josephus A. Vigeant Manud. coadj. Empt. Adj. jan Vis. noct. Adj. fab. horol. Martinus O'Neill Stabul. Ad dom. Michael Donohue Cur. val. Michael Ryan Sut. Patritius Muldoon Janit. Patritius Traynor Cust. vest. Vis. med. et exam Ad dom. Virgilius S. Goulden Fab. lign. Excit. Vis. mat. SCHOLASTICI NOVITII David H. Buel in coll. S. Franc. Xaverii P. Jeremias Rossi Franciscus G. Lenahan Thomas M. Connell Eduardus T. Hand Alexius C. McLaughlin Carroll J. Boone Gulielmus J. Holden Jacobus B. Matthew Jacobus S. Downes Martinus Scott Patritius M. Collins Patritius J. O'Gorman Thomas E. Scott Joannes T. Conwell Gulielmus F. Moore Patritius J. Kavanagh Franciscus J. Lamb Joannes B. Smith Fabianus F. Gough Franciscus de S. Howle Joannes B. Carroll Arthurus O'Leary"
    },
    {
        "text": "Carolus N. Raley Carolus V. Lamb David J. Roche Jacobus R. Kennelly Jacobus A. Waters Joannes J. Neary Lalor L. McLaughlin Philippus M. Finegan Jacobus J. Walsh Bernardus L. Wall COADJUTORES NOVITII Alexander A. McDonnell in coll. S. Joannis Thomas Nestor in coll. SS. Cord. Woodst. Hugo Reilly in coll. S. Franc. Xaver. Matthaeus J. Berchem in Res. Bost. SS. Trinit. Thos. P. O'Donnell in coll. S. Petri, Neo Caesar. Matth. J. McInnerney in coll. SS. Cord. Woodst. Paulus A. Smith Hermannus J. Schmidt Ricardus Power Daniel McCarthy Patritius Nestor Audenus J. Neeson Jacobus G. Halloran Patritius J. Kennedy Jacobus E. Murphy Patritius McFarland Sac. 18 Schol. 52 Coadj. 24 Univ. 94"
    },
    {
        "text": "COLLEGIUM MAXIMUM Sacratissimi Cordis Jesu WOODSTOCK COLLEGE, HOWARD CO., MD. 1 P. Petrus O. Racicot Rect. a die 25 Nov. 1883 Cens. libr. Cons. prov. P. Joannes B. Mullaly Min Proc. Praef. val. Cons. an. 4 P. Aemilius M. de Augustinis Lect. theol. dogm. mat. Conf. et exam. NN. Cens. libr. Praef. ton. theol Deleg. ad Commiss. general. de studiis, Fesulis P. Aloisius Sabetti Lect. theol. mor. Praes. coll. cas. consc. Praef. sac Conf. et exam. NN Cens. libr. Coll. pp. litt. ann. Script. hist. dom. Mod. acad. rit. Praes. virid. P. Benedictus Guldner Lect. log. et metaph. gen. Exam. NN. Cens. libr. Excur. ad Poplar Springs P. Carolus Piccirillo Praef. stud. et bibl. Lect. S. Script. Exam. NN. Cens. libr. Cons. an. 7 P. Fridericus Brambring Lect. theol. dogm. pom. Exam. NN. Cens. libr. Cons. an. 3 P. Gulielmus P. Treacy Oper. Cur. ger. paroch. Red. WOODSTOCK LETTERS P. Henricus T. B. Tarr Lect. chym Aud. theol. an. 1 P. Januarius M. Degni Lect. phys. et mechan. Conf. et exam. NN. P. Joannes A. Conway Lect. metaph. spec. 3 an. Exam. NN. Cens. libr. Subm."
    },
    {
        "text": "P. Joannes S. Verdin Adm. Praef. spir Conf. et exhort. NN. P. Raphael Dewey Dir. gen. apost. orat. Red. MESSENGER Praef. lect. ad mens. et ton. phil. P. Raphael Tummolo Lect. theol. dogm. comp. Exam. NN. P. Renatus Holaind Lect. eth. et jur. nat. Conf. et exam. NN. Excur. ad Sykesville P. Salvator M. Brandi Suppl. lect. theol. dogm. mat. Exam. NN. Cens. libr. Excur. ad Harrisonville P. Udalricus Heinzle Lect. metaph. spec. 2 an Exam. NN. Antonius Maas Lect. ling. hebr. Mod. acad. hebr. Aud. theol. an. 2 Joannes T. Hedrick Lect. astron., math. et geol. Aud. theol. mor. an. 2 AUDITORES THEOLOGIAE Anno Quarto P. Eduardus A. Gleeson P. Ferdinandus A. Moeller P. Gulielmus Power P. Gulielmus P. Brett P. Hermannus Meiners P. Joannes A. Buckley P. Joannes Scully P. Nicolaus Davis P. Patritius J. Dooley P. Patritius Quill P. Simon A. Blackmore"
    },
    {
        "text": "Anno Tertio Alexander J. Burrowes Alexius de Stockalper Vis. mat. et noct. P. Alphonsus M. Mandalari Eugenius A. Magevney Bid. schol. S. Script. Franciscus B. Goeding Franciscus G. Gunn Vis. med. et utr. exam. Georgius J. Lucas Gulielmus F. Gregory Vis. mat. et noct. Gulielmus J. Tynan P. Heraclius La Cerda Henricus G. Otting Hieronymus Ricard Vis. med. et utr. exam. Jacobus J. Conway Joannes D. Walshe P. Joannes F. X. O'Conor Expl. pp. med. FF. P. Josephus H. Richards Cat. FF. P. Josephus I. Ziegler Martialis I. Boarman P Michael G. Shallo Michael H. O'Brien Vis. mat. et noct. P. Nicolaus L. Schlechter Cat. famul. Thomas J. Gannon Vincentius Chiappa Vis. med. et utr. exam. P. Vincentius Testamento Αnno Secundo Arthurus J. McAvoy Adj. praef. sac. Balthasar Feusi Cornelius Gillespie Eduardus X. Fink Georgius A. Fargis Praef. odei"
    },
    {
        "text": "Gulielmus B. Brownrigg Jacobus P. Fagan Bid. schol. dogm. Jacobus T. Gardiner Jacobus Wellworth Joannes B. Kokenge Joannes F. Lehy Josephus Zwinge Michael P. Hill Adj. praef. bibl. dom. Raphael V. O'Connell Praef. bibl. theol. Renatus Motte Robertus Smith Theobaldus M. McNamara Timotheus Brosnahan Bid. theol. Anno Primo Augustinus Laure Augustus Effinger Eduardus Allen Florentinus Bechtel Gulielmus F. Hoffend Henricus Van Rensselaer Jacobus L. Smith Joannes H. O'Rourke Bid. schol. hebr. Joannes M. Colgan Josephus A. Murphy Josephus H. Meuffels Josephus P. de Smedt Laurentius Kavanagh Michael A. McKey Michael Eicher"
    },
    {
        "text": "AUDITORES THEOL. DOGM. COMPENDIOSAE Anno Tertio Carolus C. Jones Daniel M. McElhinney Gulielmus H. Judge Joannes A. Chester Adj. bid. theol. Joannes C. Keveney Joannes P. McDonnell Patritius Murphy Patritius O'Leary Thomas G. Wallace Vis. mat. et noct. Anno Secundo Carolus S. Williams Franciscus J. Berberich Franciscus X. Brady Bid. schol. theol. comp. Franciscus X. McGovern Vis. med. et utr. exam. Jacobus WN. Collins Bid. schol. theol. mor. Joannes D. Mathery Praef. acad. cant. Gregor. Anno Primo Carolus Mackin Franciscus Barnum Gulielmus J. Kevill Gulielmus J. Richley Gulielmus Quigley Michael A. Noel Stephanus Bueno Vis. mat. et noct. Thomas S. Harlin Vis. med. et utr. exam."
    },
    {
        "text": "AUDITORES PHILOSOPHIAE Anno Tertio Albertus A. Dierckes Amadeus Guyol Praes. 4 acad. graec. Augustinus J. P. O'Malley Carolus B. Macksey Praes. 3 acad. graec. Carolus B. Moulinier Vis. mat. et noct. Carolus F. Worpenberg Vis. med. et utr. exam. Edmundus J. Burke Vis. med. et utr. exam. Eduardus P. Lamb Organist. Franciscus X. Aigner Franciscus X. Mara Gulielmus J. Ennis Cat. nigrit. ad Woodstock Gulielmus M. McDonough Henricus A. Judge Cat. ad Granite Henricus S. Maring Cat. ad Harrisonville Jacobus de Potter Praes. 2 acad. graec. Jacobus J. Curran Bid. schol. Jacobus J. O'Connor Praef. bibl. phil. Jacobus McCabe Cat. ad Harrisonville Jacobus P. Moore Vis. mat. et noct. Joannes A. Moore Joannes B. O'Leary Joannes S. Coyle L. Eugenius French Modestus Izaguirre Patritius J. Casey Patritius J. Cormican Vis. mat. et noct. Patritius J. McGinney Patritius J. Mulconry"
    },
    {
        "text": "Theodorus Rinck Thomas F. Treacy Praes. 1 acad. graec. Thomas I. Cryan Thomas M. Neate Vis. med. et utr. exam. Anno Secundo Albertus A. Ulrich Adj. lect. chym. Ambrosius M. Fontan Audenus A. Hill Cat. ad Woodstock David Hearn Cat. ad Granite Eduardus Corbett Georgius A. Mulry Georgius A. Pettit Adj. praef. bibl. dom. Gulielmus J. Wallace Gulielmus P. O'Connor Cust. sac. mort. Jacobus A. Gillespie Cust. sac. SS. Angel. Jacobus J. Deck Adj. lect. phys Cat. ad Harrisonville Joannes J. Sennhauser Vis mat. et noct. Joannes Post Vis. med. et utr. exam. Joannes S. Hollohan Josephus F. Banks Josephus H. Rockwell Bid. schol. Josephus P. Gonzalez Mauritius D. Sullivan Adj. bid. phil. Patritius Walsh Bid. phil. Anno Primo A. J. Elder Mullan Cat. nigrit. ad Woodstock Andreas J. Brown Antonius Taillant Daniel Murphy Eduardus Barry"
    },
    {
        "text": "Franciscus B. Cassilly Franciscus Bertels Georgius Rittmeyer Henricus T. Casten Cus. sact. S. Joseph. Hubertus A. Post Jacobus F. Dawson Cat. ad Woodstock Joannes J. Donoher Joannes J. O'Hara Joannes M. Coghlan Cat. ad Woodstock Joannes N. Cordoba Ludovicus E. Nicolet Marcellus Jannin Michael A. Higgins Michael Moynihan Bid. schol. Moyses A. Kavanagh Paulus Faget Philippus Murphy Theophilus S. Herber COADJUTORES Alexander Walsh Cust. vest. Excit. Andreas E. O'Reilly Pist. Bernardus Gaffney Hortul. Excit. Cajetanus Campone Coq. Cornelius Reardon Ad dom. Daniel Fortescue Adj. Red. MESSENGER Adj. typogr. Vis. mat. et noct. Dominicus Leischner Vinit. Adj. praef. virid. Geraldus Barry Caement. Excit. Gulielmus Grant Ratioc Adj. lect. phys. et chym. et praef. bibl. Gulielmus Hill Fab. ferr. Excit. Henricus Dugan Ad dom."
    },
    {
        "text": "Jacobus McDonnell Ad omn. Jacobus O'Kane Typogr. Vis. mat. et noct. Joannes B. Mattingly Arment. Joannes Cunningham Sener Joannes Freeth Fab. lign. Pict. Joannes H. Hammill Extra dom. Cur. val. Joannes Langan Fab. lign. Josephus A. Wolff Comp. libr. Matthaeus J. McInnerney Cust. tricl Jan. Michael Cashman Aedit. Patritius Cassidy Ad omn. Patritius McGlone Cust. cell. vin. Raphael Vezza Fab. lign. Ricardus Dugan Infirm. Theodorus Vorbrinck Villic. Excit. Thomas Crowley Sut. Vis. med. et exam. Thomas Ekins Sart. Thomas Nestor Adj. coq. Sac. 36 Schol. 148 Coadj. 29 Univ. 213"
    },
    {
        "text": "RESIDENTIA BOHEMIENSIS AD S. FRANCISCI XAVERII WARWICK, CECIL CO., MD. P. Joannes B. Gaffney Sup. Oper. Excur. ad Middle town et Chesapeake City Sac. 1 Univ. 1 RESIDENTIA AD S. IGNATII ST. INIGO'S, ST. MARY'S CO., MD. P. David B. Walker Sup. Oper. Proc. Excur. ad S. Michaelis P. Jacobus P. Neale Oper. Excur. ad S. Nicolai, S Georgii et Factory COADJUTORES Jacobus Fitzgerald Coq. Cust. sac. dom Ad dom. Joannes O'Connell Villic. Ad omn. Sac. 2 Coadj. 2 Univ. 4 RESIDENTIA AD LEONARDTOWN S. ALOISII LEONARDTOWN, ST. MARY'S CO., MD. P. Carolus K. Jenkins Sup. Oper. Praes. sod. B. V. M. nigrit. et schol. domin. P. Andreas P. Keating Adm. Praef. spir Oper. Excur. ad S. Joseph et Mechanicsville"
    },
    {
        "text": "P. Cemens S. Lancaster Oper. Excur. ad S. Heart et Lady's Chapel Praes. confr. bon. mort. et sod. B. V. M. nigrit. apud. Lady's Chapel Cons. an. 1 P. Joannes M. Giraud Oper Excur. ad S. Joannis et New town Coll. pp. litt. ann. Script. hist. dom. Cons. an. 1 Sac. 4 Univ. 4 RESIDENTIA AD S. THOMAE COX, CHARLES CO., MD. P. Ignatius Renaud Sup. Oper Praes. sod. B. V. M. vir. et mulier. P. Joannes B. Archambault Cur. val. P. Matthaeus M. McDonald Oper. in xenod. et nosoc. Excur. ad Pomfret, Glymont et Hilltop Sac. 8 Univ. 8 RESIDENTIA AD WHITEMARSH SS. CORDIS JESU COLLINGTON, PRINCE GEORGE'S CO., MD. P. Carolus H. Heichemer Sup. Oper Praes. sod. B. V. M. puell Excur. ad Brook's Chapel P. Jacobus Cotting Oper. Mauritius Cavanagh Coadj Aedit. Ad omn. Sac. 2 Coadj. 1 Univ. 3"
    },
    {
        "text": "IN STATU MASSACHUSETTS COLLEGIUM BOSTONIENSE 761 HARRISON AVENUE, BOSTON, MASS. P. Eduardus V. Boursaud Rect. a die 31 Jul. 1884 Proc. Praef. stud. Praes. coet. juv. cathol., sod. B. V. M. puell. et confr. bon. mort. Conf. et conc. in T. P. J. Henricus Sandaal Min Praef. val., schol. et atr. Cons. an. 1 P. Alphonsus Charlier Adm. Praef. spir. et conf. NN Praef. eccl Oper. Coll. pp. litt. ann. Script. hist. dom Praes. confr. SS. Cord. et S. Vinc. P. Eduardus H. Welch Oper Cat. alumn. min Doc. ling. germ Praes. coll. cas. consc. Praes. sod. fil. Mar. ad N. D. et SS. Cord. Conf. NN. Conf. et conc. in T. Cons. an. 4 P. Eugenius McSwyney Cur. ger. nosoc. municip. P. Jacobus Major Oper. Conf. NN. P. Nicolaus Russo Lect. log., metaph. et eth. Praes. sod. B. V. M. matron. et schol. domin Conf. et conc. in T. Cons. an. 3 P. Patritius Halpin Oper. Cat. alumn. maj. Adj. praes. coet. juv. cathol. Praef. spir. asyl. municip. puer. Praes. sod. B. V. M. juv. Conf. et conc. in T. P. Patritius McQuaid Cur. val."
    },
    {
        "text": "P. Simon P. Dompieri Cur. val. Conf. NN. Patritius F. Mulry Lect. phys. et chym Praes. sod. B. V. M. alumn. Eduardus F. Reynaud Lect. math. subl. Doc. ling. gall Praef. bibl. MAGISTRI P. Michael J. Byrnes Doc. rhet. an. 14 mag. Praes. sod. B. V. M. vir Praef. lect. ad mens Conf. et conc. in T. Cons. an. 5 Timotheus B. Barrett Doc. hum. an. 3 mag. et math. 3 el Praes. sod. dram Bid. Jacobus V. Kelley Doc. supr. gram. an. 2 mag., ling. gall. 3 cl. et math. 2 cl. Praes. sod. SS. Angel. alumn. Gulielmus J. Stanton Doc. med. gram. an. 3 mag. et alg. 2 cl. Mod. soc. litt. alumn. senior Adj. praef. atr. Josephus V. Schmidt Doc. inf. gram. an. 2 mag., ling. germ. et alg. 1 cl Mod. soc. litt. alumn. jun. L. Eugenius Ryan Doc. elem. an. 2 mag. Praef. odei Joannes Condon Doc. elem. an. 1 mag. et arith. 2 cl. Mag. caer. Patritius J. O'Sullivan Cur. val. COADJUTORES Jacobus Dwyer Cust. tricl. Ad dom. Joannes Curran Adj. cust. tricl Infirm. Joannes Moriarty Coq. Excit. Petrus Tansey Jan. coll. Vis. med., utr. exam. et noct. Cust. vest. et cell. vin. Robertus Dockery Pict Infirm Ad dom. Theodulus Vachon Jan Empt. Ad dom. Timotheus Fealey Aedit Ad dom. Sac. 11 Schol. 8 Coadj. 7 Univ. 27"
    },
    {
        "text": "RESIDENTIA BOSTONIENSIS AD S. MARIAE 45 COOPER STREET, BOSTON, MASS. P. Gulielmus H. Duncan Sup. Proc. Oper. Praef. eccl. Praes. schol. paroch. puell., sod. B. V. M. matron., confr. SS. Cord., bon. mort., scap. sanct. et confr. S. Vinc Conf. et conc. in T. P. Antonius M. Mandalari Oper. in ins. Deer, Rainsford et Austin Farm, in xenod. et carc. Instr. convers Lect. philos. ad Un. Cath. Cons. an. 1 P. Augustus Langcake Mission. excur. P. Franciscus J. O'Neil Oper. Conf. NN. et in T. P. Franciscus T. McCarthy Sup. mission. excur. P. Gulielmus J. Scanlon Oper. Praes. sod. B. V. M. juv. et puell. Conf. et conc. in T. Conf. NN. Cons. an. 5 P. Henricus Kavanagh Mission. excur. P. Jeremias F. X. Coleman Oper. Praes. schol. paroch. puer., schol. domin., sod. B. V. M. puell. in schol. paroch. et puer Conf. et conc. in T. P. Josephus Vetter Adm. Praef. spir Conf. NN. Conf. et conc. in T. Coll. pp. litt. ann Script. hist. dom. P. Ronaldus B. Macdonald Mission. excur. P. Thomas A. Reid Oper Praes. sod. B. V. M. vir Conf. et conc. in T. Conf. NN. Cons. an. 2"
    },
    {
        "text": "COADJUTORES Joannes J. Welch Vis. med. et utr. exam Ad dom. Joannes Lynch Aedit. Empt Ad dom. Joannes McElroy Jan. Ad dom. Patritius F. Quinn Cust. tricl. Excit Ad dom. Thomas Carberry Sacrist. Ad dom. Sac. 11 Coadj 5 Univ. 16 RESIDENTIA BOSTONIENSIS AD SS. TRINITATIS 21 LUCAS STREET, BOSTON, MASS. P. Franciscus X. Nopper Sup. Proc. Praef. eccl. Oper. Praes. schol. paroch., confr. SS. Cord. et S. Ros. vir. et matron. P. Andreas Rapp Oper Praes. sod. B. V. M. juv. Excur. ad Lawrence et Manchester Cons. an. 1 P. Ignatius Bellwalder Adm. Praef. spir. Conf. NN Coll. pp. litt. ann. Script. hist. dom. P. Josephus Krieg Oper Conf. NN. Praes. sod. B. V. M. puell. et bon. mort. Cons. an. 1 COADJUTORES Casper Menke Jan Aedit. Ad dom. Matthaeus T. Berchem Cust. tricl. et cell. Ad dom. Sac. 4 Coadj. 2 Univ. 6"
    },
    {
        "text": "COLLEGIUM S. CRUCIS ET CONVICTUS HOLY CROSS COLLEGE, WORCESTER, MASS. P. Robertus W. Brady Rect. a die 28 Jun. 1883 Cat. alumn. P. Albertus R. Peters Min Proc. Praef. sac. Conf. et conc. in sac Coll. pp. litt. ann. Script. hist. dom. Cons. an. 5 P. Jacobus A. Ward Praef. stud. et bibl Adm. Praef. spir. Conf. NN. et in sac. Praes. coll. cas. consc. Ex hort. dom. Cat. FF. P. Joannes J. Ryan Extra dom. Cur. val. P. Timotheus O'Leary Lect. log., metaph. et eth. Conf. et et conc. in sac Conf. NN. Cons. an. 1 Aloisius Maes Lect. phys. et chym. MAGISTRI Patritius J. Casey Doc. rhet. an. 4 mag. Adj. praef. alumn. Aloisius P. Brosnan Doc. hum. an. 3 mag. et alg. 1 et 2 cl. Praef. atr. phil. Patritius T. Kernan Doc. sup. gram. an. 1 mag. et calligr. Adj. praef. alumn. . Abraham J. Emerick Doc. med. gram. an. 3 mag. et arith. 1 et 2 cl. Petrus A. Roche Doc. inf. gram. an. 2 mag. et math. 1 cl. Adj. praef. alumn. P. Joannes J. McAuley Doc. rud. an. 16 mag. et ling. gall. 1 cl. Conf. et conc. in sac Conf. NN. Praef. lect. ad mens Praes. sod. B. V. M. alumn. Cons. an. 6"
    },
    {
        "text": "P. Hugo D. Langlois Doc. spec. lat. an. 16 mag. et ling. gall. 3 cl. Conf. et conc. in sac. P. Franciscus X. Sadlier Suppl. in spec. lat. et alg. Adj. praef. bibl. Praes. sod. SS. Angel. Conf. et conc. in sac. PRAEFECTI P. Michael J. Hughes Praef. discipl. et val. Doc. math. 3 cl. Cons. an. 1 Gulielmus A. Curley Doc. math. 2 cl. et ling. gall. 2 cl. Praef. odei COADJUTORES Antonius Beckman Fab. lign. Aedit. Jacobus Strain Adj. proc. Ratioc Empt. Joannes Farrell Cur. val. Joannes Hilbert Sart. Joannes J. O'Neil Cust. vest. Vis. noct. Ad dom. Josephus E. Clocker Infirm Ad dom. Michael Hogan Adj. coq. Ad dom. Michael J. Loftus Cust. tricl. NN. et cell. vin. Excit. Patritius Gallagher Coq. Ricardus F. Furlong Vis. med. et utr. exam Ad dom. Sac. 9. Schol. 7 Coadj. 10. Univ. 26 6"
    },
    {
        "text": "IN STATU NEO CAESARIENSI COLLEGIUM S. PETRI INCHOATUM 144 GRAND ST., JERSEY CITY, N. J. P. Joannes McQuaid V. Rect. a die 31 Jul. 1880 Cur. ger. paroch Proc Conf. et conc. in T. P. Josephus M. Jerge Min Praef. stud., atr. et val. Conf. et conc. in T. Praes. coll. cas. consc. Mod. sod. fil. Mar. Praef bibl. dom Cons. an. 3 P. Aloisius Ragaru Stud. ling. angl. P. Franciscus McAtee Adm. Praef. spir. Oper. Conf. NN. et alumn Mod. sod. SS. Cord., juv. et soc. temp. Conf. et conc. in T. P. Hugo A. Quin Oper. Cur. ger. schol. paroch. Conf. alumn. Conf. et conc. in T. Mod. sod. Imm. Concept. B. V. M., Un. Cath. et schol. domin. in sac. inf. Doc. arith. et alg. Cons. an. 1 P. Joannes Cunningham Extra dom. Cur. val. P. Thomas M. Sheerin Oper. Conf. NN. et alumn. Mod. schol. domin., sod. puer. et puell., confr. bon. mort. et S. Vinc Conf. et conc. in T. Cons. an. 3 Michael J. Cunningham Lect. chym. Doc. arith. Vis. exam. vesp."
    },
    {
        "text": "MAGISTRI Josephus M. Woods Doc. rhet. et hum. an. 3 mag. et alg. 2 cl. Adj. praef. atr Praef. lect. ad mens. Josephus F. Hanselman Doc. sup. gram. an. 2 mag., geom. et ling. germ Adj. praef. bibl. alumn. Adj. praef. atr. Vis. med. et exam. merid. Gulielmus F. Gannon Doc. med. gram. an. 2 mag. et trigon. Adj. praef. atr. P. Michael C. Dolan Doc. inf. gram. 1 cl. an. 6 mag. Praef. bibl. alumn. Adj. praef. atr. Coll. pp. litt. ann Script. hist. dom Cat. FF. Conc. in T. Joannes J. Rodock Doc. inf. gram. 2 cl. 1 sect. an. 5 mag., arith. et ling. germ Adj. praef. bibl. dom. et atr. Rufus C. Duff Doc. ling. angl., schol. praep., arith. et ling. gall Adj. praef. atr. COADJUTORES Gulielmus McElaney Cur. forn. Vis. med. Ad dom. Jacobus McNulty Aedit Sart. Vis. utr. exam. et noct. Ad dom. Joannes Cullen Adj. cust. vest Adj. sart. Patritius Ranahan Coq. Empt. Ad dom. Patritius Souren Cust. tricl. Disp. Adj. coq. et cust. vest. Excit Infirm Ad omn. Thomas P. O'Donnell Cust. vest. Adj. cur. forn. Ad omn. Sac. 8 Schol. 6 Coadj. 6 Univ. 20"
    },
    {
        "text": "IN STATU PENNNSYLVANIAE RESIDENTIA CONEWAGINENSIS AD SS. CORDIS MCSHERRYSTOWN, ADAMS CO., PA. P. Patritius Forhan Sup. Oper. Proc. Praes. sod. vir., mulier. et juv., confr. SS. Cord., Ros. et schol. paroch. Conf. et conc. in T. P. Daniel A. Haugh Oper Conf. et conc. in T. Cons. an. 3 P. Hermannus Richard Oper Excur. ad Oxford et Para dise Praes. sod. B. V. M. Conf. NN. Cons. an. 1 P. Joannes B. Emig Adm. Praef. spir Oper Excur. ad Hanover Praes. sod. B. V. M. Red. KALEND. P. Petrus Manns Oper Excur. ad McSherrystown Conf. in T. P. Thomas Finnegan Cur. val. COADJUTORES Hugo McGunegle Cust. vest. et trict Aedit. Excit Vis. med. et utr. exam Ad dom. Robertus Hamilton Ad dom. Gulielmus Donovan Ad dom. Sac. 6 Coadj. 3 Univ. 9"
    },
    {
        "text": "RESIDENTIA GOSHENHOPPENENSIS AD SS. SACRAMENTI BALLY, BERKS CO., PA. P. Joannes B. Meurer Sup. Oper Praes. soc. sanct. Cat. in schol. P. Joannes Harpes Oper Praes. sod. B. V. M., confr. bon. mort. et SS. Angel. puer. et puell. Cat. in T. Sac. 2 Univ. 2 RESIDENTIA PHILADELPHIENSIS AD SS. NOMINIS JESU THE GESU, 18th STILES STS., PHILADELPHIA, PA. P. Burchardus Villiger Sup. Oper Proc. Praef. eccl. Praes. confr. bon. mort., SS. Cord., Ros. et animar. defunct. P. Alphonsus Coppens Oper Conf. et conc. in T. Praes. sod. B. V. M. Conf. sen. ap. sor. paup. Cons. an. 8 P. Benedictus Sestini Oper. Conf. in T. Exhort. NN. P. Carolus Cicaterri Adm. Praef. spir Oper. Conf. NN. et in T. Praes. coll. cas. consc. Vis. nosoc. P. Eduardus D. Boone Oper Conf. et conc. in T. Praef. bibl. Coll. pp. litt. ann. Script. hist. dom Cons. an. 1 P. Jacobus McHugh Oper Conf. in T. Praes. schol. pa roch et domin Cons. an. 4 P. Livius Vigilante Oper. Conf. in T. P. Petrus J. Blenkinsop Oper Conf. NN. Conf. et conc. in T. Cons. an. 3"
    },
    {
        "text": "COADJUTORES Arthurus Gormley Excit. Vis. med. et utr. exam. Cust. vest Ad dom. Thomas McShane Jan. Sart. Ad dom. Thomas Murray Aedit. Cust. cell. vin Ad dom. Sac. 8 Coadj. 3 Univ. 11 RESIDENTIA PHILADELPHIENSIS AD S. JOSEPH 317 WILLING'S ALLEY, PHILADELPHIA, PA. P. Joannes A. Morgan Sup. Oper. Proc. Praef. eccl. Praes. sod. SS. Cord. et schol. paroch. P. Alexius L. Jamison Cur. val. P. Aloisius Romano Oper Conf. et conc. in T. Praes. sod. B. V. M. jun Conf. NN. Coll. pp. litt. ann. Script. hist. dom Cons. an. 3 P. Jacobus J. Bric Oper Conf. et conc. in T. Praes. confr. S. Ros. et bon. mort Praef. bibl. Cons. an. 1 P. Patritius A. Jordan Adm. Praef. spir Oper. Conf. et conc. in T. Praes. schol. domin. et sod. B. V. M. sen. P. Patritius Duddy Oper Conf. NN. et in T. COADJUTORES Joannes Dowling Excit. Vis. med. et utr. exam. Cust. tricl. et vest Ad dom. Michael Nash Infirm Aedit. Ad dom. Sac. 6 Coadj. 2 Univ. 8"
    },
    {
        "text": "IN STATU RHODE ISLAND RESIDENTIA PROVIDENTIANA AD S. JOSEPH 92 HOPE ST., PROVIDENCE, R. I. P. Fridericus G. Gockeln Sup. Oper Proc. Praef. eccl. Praes. sod. B. V. M. puell., confr. S. Ros. et soc. sanct. Mod. soc. S. Vinc Coll. pp. litt. ann. P. Gulielmus F. Hamilton Oper. Praes. sod. B. V. M. ma tron. et confr. bon. mort. Conf. NN. P. Joannes B. Nagle Oper Praes. schol. domin. et paroch. et sod. B. V. M. sen., vir., juv. et puer Conf. NN. COADJUTORES Eduardus Donnelly Aedit. Ratioc Ad dom. Joannes Hogan Coq. Ad dom. Sac. 3 Coadj. 2 Univ. 5 IN STATU VIRGINIAE RESIDENTIA ALEXANDRINA AD S. MARIAE ST. MARY'S CHURCH, ALEXANDRIA, VA. P. Dionysius O'Kane Sup. Oper. Proc. Praes. schol. paroch. et domin., confr. SS. Cord. et bon. mort. Ex cur. ad Fairfax P. Joannes B. de Wolf Oper Praes. sod. B. V. M. et schol. domin. nigrit. P. Thomas H. Stack Oper. Praes. sod. B. V. M. Excur. ad Falls Church. Sac. 3 Univ. 3"
    },
    {
        "text": "DEGENTES EXTRA PROVINCIAM IN ANGLIAE P. Byrne, Michael F. Ag. 3 prob. an. Manresae Manresa House, Roehampton, London, S. W. IN GERMANIAE Pittar, Joannes Doc. in coll. B. P. Canisii 681 Washington St., Buffalo, N. Y. IN NEAPOLITANA P. Holland, Jacobus F Oper. in resid. Denveriana Larimer 28th Sts., Denver, Colo. P. Holland, Fridericus J. Oper. in resid. Populana Catholic Church, Pueblo, Colo. Broderick, Joannes Doc. inf. gram. in Coll. Las Vegas Las Vegas College, Las Vegas, N. M. Deane, Ignatius P. Doc. elem., etc. in Coll. inchoat. SS. Cordis Morrison, Jefferson Co., Colo. Galligan, Joannes F. Doc. supr. gram. in Coll. Las Vegas Morrison, Gulielmus H. In Coll. Las Vegas Cur. val. Noel, Fabianus S. Doc. in Coll. Las Vegas"
    },
    {
        "text": "IN TAURINENSI P. Young, Edmundus J. Doc. rhet. in Coll. S. Clarae Santa Clara College, Santa Clara, Cal. IN VENETA P. Muller, Augustus Doc. ling. lat. in Coll. S. Aloisii, Mangalore St. Aloysius' College, Mangalore, East India IN MISSIONE NEO AURELIANENSI P. Whitney, Joannes D. Doc. hum et math. in Coll. Spring Hill Spring Hill College, near Mobile, Ala. Sac. 6 Schol. 6 Univ. 12"
    },
    {
        "text": "EX ALIIS PROVINCIIS IN NOSTRA DEGENTES EX ROMANA P. Massi, Pius P. Cardella, Philippus EX AUSTRIACO HUNGARICO P. Holzer, Joannes P. Prachensky, Josephus EX BELGICA De Pooter, Fridericus Coadj. EX CAMPANIAE Maes, Aloisius Schol. P. Petitdemange, Carolus P. Thiry, Theodorus Leischner, Dominicus Coadj. Risler, Aemilius P. Vetter, Josephus EX FRANCIAE P. Perron, Jacobus P. Daubresse, Isidorus P. Thebaud, Augustus J. P. Loyzance, Josephus Mace, Julius Coadj. EX GERMANIAE P. Bodewig, Antonius P Krieg, Josephus P. Nopper, Franciscus X. P. Brambring, Fridericus P. Richard, Hermannus P. Heinzle, Udalricus P. Schleuter, Joannes P. M. EX MEXICANA P. La Cerda, Heraclius"
    },
    {
        "text": "EX MISSOURIANA P. Blackmore, Simon A. Effinger, Augustus P. Gleeson, Eduardus J. Eicher, Michael P. Meiners, Hermannus Hoffend, Gulielmus F. Kavanagh, Moyses A. P. Moeller, Ferdinandus A. Kokenge, Joannes B. P. Rosswinkel, Reinhardus Magevney, Eugenius A. P. Schlechter, Nicolaus L. Mara, Franciscus X. P. Verdin, Joannes S. P. Votel, Henricus J. Mathery, Joannes D. P. Worpenberg, Georgius H. McCabe, Jacobus Bechtel, Florentinus Sch. Meuffels, Josephus H. Berberich, Franciscus J. Moulinier, Carolus B. Boarman, Martialis I. Mulconry, Patritius J. Burrowes, Alexander J. Murphy, Josephus A. Neate, Thomas M. Cassilly, Franciscus B. Conway, Jacobus J. Otting, Henricus G. Sennhauser, Joannes J. Curran, Jacobus J. De Smedt, Josephus P. Sullivan, Mauritius D Dierckes, Albertus A. Treacy, Thomas F. Donoher, Joannes J. Wallace, Gulielmus J. Worpenberg, Carolus F. Sch. EX NEAPOLITANA P. Augustinis de , Aemil. M. Banks, Josephus F. Barry, Eduardus P. Brandi, Salvator M. P. Degni, Januarius M. Cordoba, Joannes N. Gonzalez, Josephus P. P. Mandalari, Alphonsus M. P. Romano, Aloisius Izaguirre, Modestus P. Testamento, Vincentius Motte, Renatus P. Tummolo, Raphael Campone, Cajetanus Vezza, Raphael Coadj."
    },
    {
        "text": "EX TAURINENSI Laure, Augustinus P. Garrand, Victor Mackin, Carolus P. Ragaru, Aloisius McKey, Michael A. P Rebmann, Jacobus Post, Hubertus A. P. Rossi, Jeremias Post, Joannes A. P. Shallo, Michael G. Allen, Eduardus Ricard, Hieronymus Rinck, Theodorus Chiappa, Vincentius De Coster, Julianus Smith, Robertus Dethoor, Paulus Van Rensselaer, Henricus Walshe, Joannes D. Feusi, Balthasar Hand, Eduardus T. Nov. Sch. EX VENETA P. Cicaterri, Carolus EX MISSIONE NEO AURELIANENSI P. Davis, Nicolaus Herber, Theophilus S. P Desribes, Josephus Higgins, Michael A. P. Dufour, Alphonsus Jannin, Marcellus P. Gache, L. Hippolytus Maring, Henricus S. P. Holaind, Renatus McDonnell, Joannes P. P. Power, Gulielmus Moore, Jacobus P. Bertels, Franciscus Moynihan, Michael Brown, Andreas J. Murphy, Daniel De Potter, Jacobus Murphy, Philippus De Stockalper, Aloisius Nicolet, Ludovicus E. O'Leary, Patritius Faget, Paulus Fontan, Ambrosius M. Rittmeyer, Georgius Guyol, Amadeus Taillant, Antonius Walsh, Patritius Sch. Sac. 46 Schol. 74 Coadj. 6 Univ. 126"
    }
]